[
    {
      "id": "b0f36645-4759-474a-b25e-9fa5d28cf595",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/b0f36645-4759-474a-b25e-9fa5d28cf595",
      "created_at": "Fri Apr 23 11:53:03 UTC 2021",
      "company": "Livestorm",
      "company_url": "https://livestorm.co/",
      "location": "full remote",
      "title": "Back-End Engineer Ruby - Integrations Squad",
      "description": "<p>About Livestorm:</p>\n<p>Livestorm is the all-in-one video communication platform for companies looking to implement a powerful video communication strategy.</p>\n<p>Founded in 2016, Livestorm enables companies to promote, host and analyze their online events. We’re building the future of unified video communication: an all-in-one video communication platform that connects to your tools and lives in your browser. Livestorm is a browser-based platform that doesn’t require a download, or setup. You can use Livestorm for on-demand, live, or pre-recorded meetings or events.</p>\n<p>Livestorm has been built with ease-of-use in mind.</p>\n<p>We serve companies of all sizes, from startups to Fortune500. Front, Honda, Intercom or Spendesk trust Livestorm to organize their meetings, webinars or online events.</p>\n<p>Here are our core values:</p>\n<p>Stay curious: Be interested in the world around you.\nRemain humble: Keep learning and keep your ego in check.\nBe resourceful: Go that extra mile in the most efficient way.\nOwn it: Take pride in what you do, own your wins, and fails.\nBe transparent: Sharing knowledge, learnings, feedback, and mistakes.</p>\n<p>Team description:\nAs Livestorm is growing rapidly, our Team is aiming to develop our public API and everything that has to do with relevant data synchronisation between Livestorm and 2nd/3rd-party softwares. Therefore, we are looking for a talented Back-End Engineer that can be a partner in helping us scale up our integrations ecosystem and make sure Livestorm can be connected with all relevant softwares in the industry.</p>\n<p>While Livestorm has headquarters in Paris, we are a remote-first company. As a matter of fact, Stormies are located between France, Germany, Greece, Mauritius, Spain, USA,... so we are looking for the best talent, no matter where you live.</p>\n<p>Missions:</p>\n<p>In this role, you will be responsible of:</p>\n<p>Designing, building and maintaining features in production\nParticipating in Code Reviews and providing feedback to Team Members\nSharing knowledge with everyone and helping your Team to grow\nHaving the freedom to experiment\nContributing to architectural and design decisions\nMonitoring the production to try to prevent any issue that could impact our customer experience</p>\n<p>Current Stack:</p>\n<p>Backend: Ruby 2.7.1 (soon Ruby 3), Rails 6, NodeJS 12.20.1, Apollo Server\nDatastores: PostgreSQL / Redis\nFrontend: Vue.js\nInfra: AWS\nMore on Stackshare 👉 <a href=\"https://stackshare.io/livestorm/livestorm\">https://stackshare.io/livestorm/livestorm</a>\nPré-requis du poste\nFor this Backend Engineer Ruby - Integrations Squad role, we are looking for someone with the following experience:</p>\n<p>Code:</p>\n<p>At least 3 years experience in Ruby and Rails (Rails 5+)\nPrevious experience with public API\nRigorous about testing and code quality (TDD, acceptance tests, unit tests)\nTeam fit:</p>\n<p>You're a team player and you have a sense of ownership.\nYou can speak / write in English (French is a plus).\nPlus:</p>\n<p>Interested by micro-services oriented architectures\nYou know how to implement event-based communication between micro-services.\nYou have already worked in an agile environment and you loved it.\nYou are curious about new languages and aren't afraid of using new patterns and structures.\nMoreover, we are looking for someone who can work in the Paris timezone (we accept a jet-lag of 2 hours maximum).</p>\n<p>Confidence can sometimes hold us back from applying for a job. But we'll let you in on a secret: there's no such thing as a 'perfect' candidate. So however you identify and whatever background you bring with you, please apply if this is a role that would make you excited to come into work every day.</p>\n<p>What it is like to join Livestorm and the Stormies:</p>\n<p>🗺 Work from anywhere you want:</p>\n<p>🏡 Home (participation for equipment and costs, according to our expense policy)\n🏢 Paris office (snacks, drinks, afterworks...)\n💼 Coworking space (covered up to €300 including VAT per month, or local currency equivalent)\n🚉 Business trips are covered (according to our internal T&amp;E policies)\n🚲 Sustainable mobility package for daily trips to go to work\n🎉 Cheer up your Stormie life:</p>\n<p>🎿 Off-sites twice a year\n🕹 Weekly activities (online board games, riddles...)\n👐 Teambuildings\n🗣 Monthly Talking times\n💙 Take care of yourself (with Moka.care)</p>\n<p>🤝 Participate to our referral program</p>\n<p>👶 Livestorm signed the \"Parental act\"</p>\n<p>And also, benefit from:</p>\n<p>🌍 All legal and mandatory benefits from your work country for EOR contracts.</p>\n<p>🇫🇷 All French legal benefits for French contracts: €9 of lunch vouchers with Swile (covered at 50%), health insurance with Alan (covered at 50%), transport subscription to go to work (covered at 50%), and CSE with cultural &amp; sport activities via Leeto.</p>\n",
      "how_to_apply": "<p>Please apply on <a href=\"https://jobs.livestorm.co/o/backend-engineer-ruby-integrations-squad/c/new\">https://jobs.livestorm.co/o/backend-engineer-ruby-integrations-squad/c/new</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae48e3770ef8ca5c0c1a0dc4ff1808041cd802be/logo-site-livestorm-presta.jpeg"
    },
    {
      "id": "ab44fbb9-8ef5-46f8-af52-46c2ff03c622",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ab44fbb9-8ef5-46f8-af52-46c2ff03c622",
      "created_at": "Fri Apr 23 09:11:55 UTC 2021",
      "company": "Remote",
      "company_url": "http://www.remote.com",
      "location": "Remote",
      "title": "Frontend Engineer",
      "description": "<p>Remote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. (read more about <a href=\"https://remote.com/how-it-works\">how it works</a>). </p>\n<p>We encourage folks from all ethnic groups, genders, sexuality, age and abilities to apply. We value kindness, ownership and team collaboration. You can check out our <a href=\"https://remote.com/handbook\">public handbook</a>. to learn more about our culture. If this job description resonates with you, we want to hear from you!</p>\n<p><strong>How we work</strong></p>\n<p>Remote is fully remote (ah!) and we love <a href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\">Working Async</a>. This means you get to do your own schedule no matter the timezone. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in <a href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\">The Remote Flow</a>.</p>\n<p>The team you'll be joining: 33 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Previous experience working as Frontend Engineer/Developer for at least 2 years</li>\n<li>Solid understanding of <strong>Javascript ES6</strong>\n</li>\n<li>Proficient with <strong>React</strong>\n</li>\n<li>Experience with <strong>Jest</strong> and <strong>React Testing Library</strong> or <strong>Enzyme</strong> in writing meaningful tests. </li>\n<li>Interest in build pages with performance, accessibility and API design in mind</li>\n<li>Attention to details when implementing UI mockups made by our amazing design team.</li>\n<li>It's not required to have experience working remotely, but considered a plus.</li>\n</ul>\n<p><strong>Nice to have</strong></p>\n<ul>\n<li>Nextjs</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Unlimited personal time off - Read our <a href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\">time off</a> policy</li>\n<li>The equipment/tools you need to do your job well and comfortable</li>\n<li>Training budget</li>\n<li>Good salary and company options</li>\n</ul>\n<p><strong>Application process</strong></p>\n<ul>\n<li>(async) Application is reviewed</li>\n<li>Interview with our recruiter</li>\n<li>Interview with your future manager (CTO)</li>\n<li>(async) code exercise (you're not expected to waste more than 2 - 4 hours)</li>\n<li>Interview with the team (without any manager in the call so you can really get to know the people and ask all you want to ask)</li>\n<li>(async) Reference calls</li>\n<li>(async) Offer</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://grnh.se/f38c3f693us\">https://grnh.se/f38c3f693us</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnFoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--faa6bd5b90a46cf3ac0157f4354dd101233e53c5/pJ-7_0_R_400x400.png"
    },
    {
      "id": "7aa4fa1a-7d57-43a1-9f5b-55bdacf3e6a6",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/7aa4fa1a-7d57-43a1-9f5b-55bdacf3e6a6",
      "created_at": "Thu Apr 22 11:57:55 UTC 2021",
      "company": "Limango",
      "company_url": "https://www.limango.de/ehp",
      "location": "Munich",
      "title": "Junior PHP Backend Developer (m/w/d)",
      "description": "<p><strong>OUR MISSION</strong></p>\n<p>limango is the Online Shop for families – We wow our customers every day with a fantastic range of brands at very attractive prices. Based in Munich, our 300 employees share a passion for families. We do everything we can to understand their needs and fulfil their wishes. limango has everything families need: Fashion for Babies, Kids, Women and Men as well as Homeware, Toys, Cosmetics and Family holidays. At limango you’ll find both classic brands and upcoming brands from across Europe. Founded in 2007 and a member of the Otto Group since 2009 limango now has over 22 million members across Germany, Austria, France, the Netherlands and Poland and sells over 40 000 products daily to German customers alone. We want to continue to grow and win the trust of all mums in Europe. To help us achieve this, we’re looking for motivated, talented individuals to work with us and be a part of something big.</p>\n<p><strong>YOUR JOB</strong></p>\n<ul>\n<li>In the limango IT you get the chance to contribute your own ideas and know-how to the development of services all around the different processes of our ecommerce business</li>\n<li>Together with our experienced and international development teams you will improve and expand our php based backend CRM systems</li>\n<li>You will become part of our well-rehearsed agile teams of versatile and experienced developers and a dedicated product owner</li>\n</ul>\n<p><strong>YOUR PROFILE</strong></p>\n<ul>\n<li>A degree with a focus on IT or a comparable training</li>\n<li>You have 1-2 years experience in the development of scalable eCommerce applications in common PHP frameworks such as Symfony3+ as well as knowledge of OOP and design patterns</li>\n<li>You bring practical experience with RESTful APIs and service-oriented architecture</li>\n<li>You have profound experience in relational databases (MySQL/MariaDB)</li>\n<li>DevOps and GoLang experience are desirable</li>\n<li>A well-functioning tool is not enough for you - you enjoy optimizing complex IT processes!</li>\n</ul>\n<p><strong>OUR OFFER</strong></p>\n<ul>\n<li>Challenging tasks, independent work and a great deal of creative freedom in a working environment that burns for results and is happy to be measured against them</li>\n<li>An open, team-oriented working atmosphere</li>\n<li>A steep learning curve in a dynamic company with international orientation</li>\n<li>A great office in Munich's Tech-Spot with probably the coolest roof terrace in the city</li>\n<li>Corporate events, fresh fruit and soft drinks</li>\n</ul>\n<p>Interested? We look forward to receiving your application including CV, salary requirements and your earliest possible starting date.</p>\n<p><img src=\"https://camo.githubusercontent.com/5847810e6df3e310e9a7f0359b12199b8400f650/68747470733a2f2f742e676f686972696e672e636f6d2f682f66663336323231373239383466626366656631313864613139653663316237303434313365376665656136353936346631626561313463353734626531626662\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/076f63218fd916966f368984c132b7e532a45727014fa66f239f48fed4be0d9d\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3FoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aa8c030695bdf8c2f0198aa9c1de4d97c3f666ed/Limango.jpg"
    },
    {
      "id": "019aa8db-0cec-4c98-b340-92d1735df385",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/019aa8db-0cec-4c98-b340-92d1735df385",
      "created_at": "Thu Apr 22 11:08:41 UTC 2021",
      "company": "FundraisingBox c/o Wikando GmbH",
      "company_url": "https://www.fundraisingbox.com/",
      "location": "Augsburg",
      "title": "PHP Senior Developer (m/w/d) in Vollzeit und 100% Home Office / Remote",
      "description": "<p>Wir sind digitale Entwicklungshelfer und ein echtes Remote-Team! Der Firmensitz unserer Wikando GmbH ist zwar in Augsburg, aber wir sind komplett virtuell organisiert. Das hat den großen Vorteil, dass Du nicht umziehen musst, und von überall aus - mit Internetanschluss, versteht sich - mit uns arbeiten kannst. Trotzdem sind wir ein sehr enges, vertrautes Team und besitzen auch eine Teeküche ;-)</p>\n<p>Ob Du digitaler Nomade oder Familienmensch bist, unser Modell ermöglicht Dir Deine optimale Work-Life-Balance. Deine Stelle ist remote und unbefristet. Wir würden uns freuen, Dich kennenzulernen und mit an Bord zu nehmen! Schick uns Deine Bewerbung.</p>\n<p><strong>Das machen wir</strong></p>\n<p>Unsere Mission ist es, Non-Profits weltweit durch unser Experten-Team und Technologien zu befähigen, neue digitale Kanäle des Spendens zu erschließen, manuelle Prozesse zu digitalisieren und den NGOs dabei zu helfen wirksame Entscheidungen bezüglich ihrer Projekte zu treffen.</p>\n<p>Dabei begleiten wir das komplette Spendenerlebnis: Vom digitalen Fundraising (z. B. mit unseren Online-Spendenformularen oder einer Crowdfunding-Kampagne), dem Bezahlen mit neuesten Payment-Methoden (z. B. Google oder Apple Pay) bis hin zum Spender:innenmanagement (z. B. mit unserem eigenen CRM-System oder Anbindung von externen E-Marketing-Diensten, CRMs, usw.).</p>\n<p>Wir sind ein leidenschaftliches Team kluger Köpfe und haben unglaublich viel Spaß an der Entwicklung neuer Lösungen, um Hilfsorganisationen weltweit dabei zu helfen, schneller und einfacher Spenden zu sammeln und zu verwalten. Die Arbeit in unserem wachsenden IT-Unternehmen bietet dir alle Freiheiten und Möglichkeiten, deine Ideen zu verwirklichen!</p>\n<p>Wir würden uns über deine Unterstützung dabei sehr freuen!</p>\n<p>Übrigens: Wir haben unseren Firmensitz in Augsburg, sind aber komplett virtuell organisiert. Das hat den großen Vorteil, dass Du von überall aus mit uns arbeiten kannst. Ob digitale:r Nomad:in oder Familienmensch: Unser Modell ermöglicht dir deine optimale Work-Life-Balance.\nDu kannst sofort starten. Die Stelle ist Vollzeit und unbefristet.</p>\n<p><strong>Deine Aufgaben bei uns</strong></p>\n<p><strong>Agile Weiterentwicklung aller Produkte der FundraisingBox</strong>\nIn unserem integrierten Produktentwicklungsteam konzipierst und entwickelst du neue Features im Bereich Online-Fundraising, treibst mit neuen Technologien die Themen Payments oder API-Connectoren voran oder verbesserst kontinuierlich die Funktionalität unseres CRM-Systems.. Dabei nutzt du die gängigen PHP/CSS/JavaScript-Frameworks und begleitest den gesamten Software Life-Cycle Prozess.</p>\n<p><strong>Integration von innovativen Technologien</strong>\nDu lernst innovative  Software-, Service- und Payment-Provider kennen oder schlägst eigene Technologien vor, liest dich in API-Dokumentationen ein und integrierst modernste Webservices in die FundraisingBox sowie in unser Payment-Gateway.</p>\n<p><strong>Individuelle Beratung von Non-Profit-Kund:innen</strong>\nWenn du möchtest, stehst du in Webinaren und Workshops Kund:innen und deren Entwickler:innen oder Agenturen mit Rat und Tat zur Seite, um sie mit unseren FundraisingBox Technologien bei ihren individuellen Projekten zu unterstützen.</p>\n<p><strong>Kontinuierliche Optimierung bestehender Strukturen</strong>\nDu lässt dein Know-How und deine Erfahrungen in unsere Strukturen einfließen, erkennst Code-, Prozess-, Infrastruktur-Optimierungspotentiale, evaluierst neue Technologien und begleitest deren Einsatz.</p>\n<p><strong>Aktive Gestaltung der FundraisingBox</strong>\nDu bringst eigene Ideen ein und nutzt den kreativen Spielraum in der FundraisingBox. Mit deinem großen Mitspracherecht nimmst du Einfluss auf interne Prozesse, agile Methoden, Produktstrategie und nicht zuletzt unsere Zusammenarbeit als erfahrenes Scrum-Team.</p>\n<p><strong>Das bringst Du mit</strong></p>\n<ul>\n<li>Ein abgeschlossenes Studium im Bereich Informatik/Web-Entwicklung oder eine vergleichbare Ausbildung</li>\n<li>Mindestens drei Jahre relevante Programmiererfahrung, idealerweise im Enterprise-Web-Umfeld</li>\n<li>Sehr gute Kenntnisse in PHP, Git, HTML5, CSS oder Javascript</li>\n<li>Gute Kenntnisse von PHP-Frameworks wie Symfony, Twig oder Laravel</li>\n<li>Gutes Englisch und Deutsch in Wort und Schrift (Level C1)</li>\n<li>Leidenschaft für Software-Entwicklung und agile Arbeitsweisen</li>\n<li>Eigenverantwortung, Teamgeist und Begeisterung für die FundraisingBox</li>\n<li>Neugier und Interesse an neuen Trends und Technologien</li>\n</ul>\n<p><strong>Von Vorteil wären außerdem</strong></p>\n<ul>\n<li>Gute Kenntnisse im Umgang mit Datenbanken (wir nutzen MySQL)</li>\n<li>Erfahrungen mit skalierbaren Web­an­wen­dungen</li>\n<li>Kenntnisse mit Linux, Amazon Web Services (AWS) und dem Web-Framework Bootstrap</li>\n</ul>\n<p><strong>Das bieten wir</strong></p>\n<ul>\n<li>Modernstes Arbeitsumfeld in einem 100% virtuellen Unternehmen: Wir arbeiten seit über acht Jahren remote only und investieren (trotzdem oder gerade deswegen) viel Zeit in unsere Teamkultur</li>\n<li>Volle örtliche Flexibilität: Remote Arbeiten heißt den Laptop dort aufklappen, wo du gerade sein möchtest (und gutes Internet hast)</li>\n<li>Komplette Hardware deiner Wahl, durchdachte Prozesse und zeitgemäße Kollaborationstools</li>\n<li>Eine sinnhafte Tätigkeit als digitale:r Entwicklungshelfer:in: Du hast Kontakt zu internationalen Organisationen Kunden und weltweiten Projekten</li>\n<li>Flache Hierarchien mit kurzen Entscheidungswegen: Wir sind holokratisch organisiert und arbeiten mit OKRs</li>\n<li>Ein leidenschaftliches, erfahrenes und hilfsbereites Team mitfordernden, spannenden und lehrreichen Aufgaben für alle</li>\n<li>Weiterbildung durch Schulungen und die Teilnahme an Konferenzen oder Veranstaltungen sind möglich und klar erwünscht</li>\n<li>Unbefristeter Arbeitsvertrag mit Probezeit und intensiver Kennenlernphase</li>\n<li>Attraktive Bezahlung, Jahres-Boni und betriebliche Altersvorsorge auf Wunsch</li>\n<li>30 Tage Urlaub + Augsburger Feiertage (die meisten in Deutschland)</li>\n<li>An deinem Geburtstag hast du den Nachmittag frei</li>\n</ul>\n<p><strong>Das macht uns aus</strong></p>\n<ul>\n<li>Unsere sinnhafte Arbeit unterstützt Non-Profits weltweit und darauf sind wir stolz</li>\n<li>Kein anonymes kleines Rädchen: Jedes Teammitglied kennt die aktuelle Unternehmensstrategie, laufende Projekte und Fortschritte aller Abteilungen</li>\n<li>Wir nehmen Kommunikation ernst: Neben durchdachten Video-Meetings findet Kollaboration bei uns auch asynchron statt</li>\n<li>Keine Überstundenmentalität und Wochenenden sind ganz klar Freizeit</li>\n<li>Zwei gemeinsame Team-Ausflugswochen pro Jahr, sowie eine dufte Weihnachtsfeier (sobald COVID das wieder zulässt)</li>\n<li>Enges und vertrautes Team: Wir haben sogar eine eigene Teeküche :-)</li>\n<li>Wir treiben maßgeblich die Digitalisierung im Non-Profit Sektor voran und sind immer auf der Suche nach innovativen Lösungen für unsere Kund:innen</li>\n</ul>\n<p><strong>Bewirb Dich jetzt</strong></p>\n<p>Schicke deine Bewerbungsunterlagen bitte in einer PDF-Datei. Enthalten sein sollte: Dein Lebenslauf, ein ausführlicher Track-Record zu deinen bisherigen Projekten sowie deine Gehaltsvorstellung. Gerne auch Links zu deinen Open-Source-Aktivitäten oder deinen öffentlichen Code-Repositories.</p>\n<p>Wir freuen uns auf deine Bewerbung!</p>\n<p><img src=\"https://camo.githubusercontent.com/9f61c7b0a9ffc6ef52e2e1ad966fb75d5126692a/68747470733a2f2f742e676f686972696e672e636f6d2f682f35616561623163373131323932656139353136343264653437633163646563383362353065316633393164376634356636653337316330376335643139306230\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/bcf919191c022e94a743b1619df818a4a274526bf0db5e185c3874793371ba7a\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc09oIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--23ab23411072a59fb07d086b2aa0924a2d470383/FundraisingBox%20c-o%20Wikando%20GmbH.jpeg"
    },
    {
      "id": "52dd0219-6718-4d9b-9a87-9cc1796e4a89",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/52dd0219-6718-4d9b-9a87-9cc1796e4a89",
      "created_at": "Thu Apr 22 11:00:35 UTC 2021",
      "company": "Sharecare GmbH",
      "company_url": "https://www.sharecare.com/",
      "location": "Berlin",
      "title": "Senior Android Developer",
      "description": "<p><strong>Who we are</strong></p>\n<p>Sharecare is the leading digital health company that helps people – no matter where they are in their health journey – unify and manage all their health in one place. Our comprehensive and data-driven virtual health platform is designed to help people, providers, employers, health plans, government organizations, and communities optimize individual and population-wide well-being by driving positive behavior change. Driven by our philosophy that we are all together better, at Sharecare, we are committed to supporting each individual through the lens of their personal health and making high-quality care more accessible and affordable for everyone.</p>\n<p>Our culture is fast-paced, high-energy and continually growing! We are always looking for people that value the opportunity to work hard, have fun on the job, and make a difference in the lives of others through their work every day! Our work is interesting and fun, because our team members are unique, talented and dynamic. We provide a setting where enthusiastic team members work together and take joy in coming to work. There are exciting career opportunities and advancement is supported by leadership teams who are invested in the growth and development of you.</p>\n<p><strong>Tasks and responsibilities</strong></p>\n<ul>\n<li>Program mobile applications for Android version 5 and above</li>\n<li>Implement mobile client applications for Sharcare and partner companies</li>\n<li>Implement client application infrastructure and SDK components</li>\n<li>Create technical documentation of solutions when required</li>\n<li>Debug, profile ad optimize code</li>\n<li>Write unit tests</li>\n<li>Extreme programming with scrum methodologies</li>\n<li>Integrate with 3rdparty APIs, such as Googe and others</li>\n<li>Deployment to Google Play store</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor or Master degree in Computer Science</li>\n<li>4+ years of experience developing native Android apps</li>\n<li>Fluent in English</li>\n<li>Eligibility to work in Germany</li>\n</ul>\n<p><strong>Knowledge and experience</strong></p>\n<ul>\n<li>Experience building Android applications (alone or in a team) that have been released on Google Play</li>\n<li>Strong familiarity with the Google Place store ad the app submission process</li>\n<li>Thorough knowledge of Kotlin, Java, Android SDK and Android NDK</li>\n<li>Excellent skills in Git</li>\n<li>Good knowledge in UI/UX patterns and Material Design components and approaches</li>\n<li>Experience in Client-server architecture and web paradigm</li>\n<li>Experience with the reactive functional programming paradigm RxJava</li>\n<li>Experience with Android Jetpack libraries and tools</li>\n<li>Knowledge of Android architecture approaches (Offline, Synchronization, MVP, MVVM, Clean Architecture etc.)</li>\n<li>Testing experience: Unit testing (JUnit) and UI testing (Espresso)</li>\n<li>Knowledge of Server-side development, iOS development and dependency injection</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>\n<p>Be part of a dynamic, international and talented team</p>\n</li>\n<li>\n<p>The opportunity to get deeply involved in the research and development of our products</p>\n</li>\n<li>\n<p>A high degree of autonomy and flexibility</p>\n</li>\n<li>\n<p>A stack of the most modern technologies</p>\n</li>\n<li>\n<p>Flat hierarchies, cross-team collaborations and short and open channels of communication</p>\n</li>\n<li>\n<p>The chance to learn and grow with regular in-office tech training sessions and participation in conferences</p>\n</li>\n<li>\n<p>A generous perks and benefits program including:</p>\n</li>\n<li>\n<p>Office snacks</p>\n</li>\n<li>\n<p>Team building activities</p>\n</li>\n<li>\n<p>Company parties</p>\n</li>\n<li>\n<p>Office spine gymnastics</p>\n</li>\n<li>\n<p>Office massages</p>\n</li>\n<li>\n<p>Monthly ticket for public transport (Office workers)</p>\n</li>\n<li>\n<p>Educational activities budget</p>\n</li>\n<li>\n<p>Subsidy for occupational pension / occupational disability insurance</p>\n</li>\n<li>\n<p>Referral bonus program</p>\n</li>\n</ul>\n<p><strong>Application</strong></p>\n<p>Thank you for your interest in employment opportunities with Sharecare. We look forward to reviewing your submission!\nPlease apply with the link on the right.</p>\n<p><img src=\"https://camo.githubusercontent.com/a19afc03e3f7eebc1e98cf30494546faca9e660e/68747470733a2f2f742e676f686972696e672e636f6d2f682f35623534626536336362353331643030636261663535303630306532626234613032316362393566313533643865363333633636393738643265666336333138\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/0adfeaf4b5acc39add8a2022cc9d83e9ff5b8d1f9275d202379bb92ccb69e1ce\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0doIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--224b96d4a633781434a74eac9ac62c02e99c924e/Sharecare%20GmbH.png"
    },
    {
      "id": "70cd5f54-5c16-4d0c-a9dc-1f985bab6de2",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/70cd5f54-5c16-4d0c-a9dc-1f985bab6de2",
      "created_at": "Wed Apr 21 13:29:30 UTC 2021",
      "company": "CreatorBooks",
      "company_url": "https://creatorbooks.com",
      "location": "Remote",
      "title": "Full Stack Developer",
      "description": "<p>Hi, my name is Paulina Masson, I am a serial entrepreneur and I enjoy building software companies. The previous company that I built became very successful and was acquired for 7 figures. My background is in software development, but I now focus solely on marketing and business growth.</p>\n<p>I am looking for a full stack software developer to build the initial version of the new software I conceptualized.</p>\n<p>CreatorBooks will be a business analytics software for Youtubers and Streamers.</p>\n<p>We will work with many services content creators use, to pull revenue data via available APIs, such as Amazon Associates, Google Adsense, Twitch API, etc. We will also be reading data from hundreds of affiliate network websites via a browser plugin.</p>\n<p>Ideally, you have experience working at a startup or working on complex projects.</p>\n<p>You will have a lot of creative power when it comes to architectural decisions, which may be more enjoyable for you, comparing to working at a large company.</p>\n<p>If you love to take up new challenges and build something complex and interesting from scratch, let’s work together. I am looking for someone who is reliable and trustworthy.</p>\n<p>REQUIREMENTS:</p>\n<p>This is a proper full stack position. You'll need knowledge of backend, frontend and enough devops to run and maintain the app:</p>\n<p>Laravel 8.x</p>\n<p>PHP 7.4</p>\n<p>PostgreSQL</p>\n<p>JavaScript (ES6)</p>\n<p>React</p>\n<p>AWS (EC2, RDS, etc)</p>\n<p>I have already chosen this theme to develop the application: <a href=\"https://preview.keenthemes.com/metronic/demo1/index.html\">https://preview.keenthemes.com/metronic/demo1/index.html</a></p>\n<p>BENEFITS:</p>\n<p>No corporate structure, small team - no overhead. Everything you need gets communicated fast and decided on quickly.</p>\n<p>Three weeks of paid vacation a year plus paid national holidays (based on your country).</p>\n<p>You'll have plenty of opportunities to learn new skills and grow professionally.</p>\n<p>Open, relaxed and friendly work environment.</p>\n<p>Opportunity to see first hand, how a startup grows from MVP to a 7 figure business, and learn from that experience.</p>\n<p>Salary Range: $4,500 - $5,500 USD a month, with yearly salary increases.</p>\n",
      "how_to_apply": "<p>Apply here:\n<a href=\"https://apply.workable.com/creatorbooks/j/63B1107CAB/\">https://apply.workable.com/creatorbooks/j/63B1107CAB/</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6e387f0391cef40d9c417e838fffb6cca719a352/CreatorBooks_Logo_App%20Icon%20Alt%20Red%20Dark%20BG.png"
    },
    {
      "id": "a1553ed1-f9c8-478e-9e61-f5330efc8a78",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/a1553ed1-f9c8-478e-9e61-f5330efc8a78",
      "created_at": "Wed Apr 21 11:38:36 UTC 2021",
      "company": "AI Incube (parknav)",
      "company_url": "http://www.parknav.com",
      "location": "North America/Europe/Israel (Remote)",
      "title": "Senior Java Backend Engineer",
      "description": "<p>AI Incube, AI-driven company that is changing the way people park thru its parking availability prediction service (Parknav), is looking to add senior software engineers to its team.</p>\n<p>Job Description:\nYou will be working on expanding and enhancing our AI-based prediction service. We are scaling rapidly, and have a number of new projects in the pipeline, primarily dealing with IoT sensors, geospatial data and computer vision.</p>\n<p>Our current stack consists of Java 8, Scala, Kubernetes, Postgis/Redis, Presto, Google Cloud Platform, Play Framework and Spring. Most of our projects involve working with maps, geospatial data and ML systems.</p>\n<p>We are 100% remote, so you can work from anywhere in the world as long as you have a decent internet connection, and can work either during American or European work hours.</p>\n<p>Your Role:</p>\n<ul>\n<li>Design, develop, configure, extend, troubleshoot, deploy and maintain our Parknav prediction service.</li>\n<li>Quick learner – research and learn about new methodologies and applications, and apply what you’ve learned.</li>\n<li>Work with our data science and machine learning teams to build a world class environment for running analysis and predictions on street level geospatial data.</li>\n<li>Desire and ability to work on full stack projects.</li>\n<li>Desire to work with maps, geospatial data and machine learning.</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Java Expert</li>\n<li>GCP, AWS or Azure</li>\n<li>Spring or Lightbend stacks</li>\n<li>Background in Math/Machine Learning or mapping/geospatial experience</li>\n<li>Independence</li>\n<li>Fluent English speaker</li>\n</ul>\n<p>Desired, but not required:</p>\n<ul>\n<li>Statistics, deep learning</li>\n</ul>\n<p>Benefits:</p>\n<ul>\n<li>Remote work</li>\n<li>Flexible hours</li>\n<li>Health, dental and vision insurance plans</li>\n<li>Additional vacation days</li>\n</ul>\n<p>PARKNAV is an equal opportunity employer.</p>\n<p>We look forward to meeting you!</p>\n",
      "how_to_apply": "<p>Email your application to <a href=\"mailto:careers@parknav.com\">careers@parknav.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckNoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--12ba7893ef39b0e573282f1395796f8959e6ee3e/logoparknav.png"
    },
    {
      "id": "676b26f3-b33b-4850-a92b-1ffcb7900966",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/676b26f3-b33b-4850-a92b-1ffcb7900966",
      "created_at": "Wed Apr 21 09:52:03 UTC 2021",
      "company": "DÜRR DENTAL SE ",
      "company_url": "http:",
      "location": "Bietigheim-Bissingen",
      "title": "(Senior) Software Engineer IoT/Cloud Solutions (m/w/d)",
      "description": "<p>Als Technologieführer innerhalb der Gesundheitsbranche entwickelt und produziert Dürr Dental hochinnovative Systemlösungen in den Bereichen Equipment, Diagnostische Systeme und Hygiene. Was uns dabei erfolgreich macht: deutsche Ingenieurkunst, circa 1.200 engagierte Mitarbeiter und unser Anspruch, Medizintechnik immer die entscheidende Idee weiterzudenken.\nFragen Sie Ihren Zahnarzt!</p>\n<p>(Senior) Software Engineer IoT/Cloud Solutions (m/w/d)\nVollzeit</p>\n<p>Ihre Aufgaben:</p>\n<ul>\n<li>Entwicklung und Betrieb einer anspruchsvollen IoT/Cloud Lösung</li>\n<li>Konzeption, Implementierung und DevOps einer microservice-basierten skalierbaren IoT/Cloud Lösung auf AWS-Basis</li>\n<li>Arbeiten mit agilen Methoden (SCRUM) in einem internationalen Team von Softwareentwicklern, Designern, Usability Experten und Testingenieuren</li>\n<li>Mitgestaltung und Betreuung unserer Produkte über den gesamten Produktlebenszyklus</li>\n<li>Analyse, Auswahl von Technologien und Diensten, Spezifikation, Implementierung von Funktionalitäten einschließlich Komponenten-, Integrations- und Unittests</li>\n</ul>\n<p>Ihr Profil:\n- abgeschlossenes Studium der Informatik oder vergleichbarer Qualifikationen</p>\n<ul>\n<li>ausgeprägte Berufserfahrung in der Softwareentwicklung von IoT/Cloud Lösungen\n- Kenntnisse in Serverless Computing und DevOps mit AWS, Azure oder GCP\n- Programmierkenntnisse in Python\n- Kenntnisse über Websocket, RESTful APIs und GraphQL sind von Vorteil\n- Erfahrung in agilen Entwicklungsmethoden sind von Vorteil</li>\n<li>Erfahrungen in testgetriebener Entwicklung (TDD), objektorientierte Programmierung (OOP) und Clean Code sind von Vorteil\n- Erfahrungen mit GitLab, Jira und Confluence sind von Vorteil\n- schnelle technische Auffassungsgabe sowie selbstständige und systematische Arbeitsweise</li>\n<li>ausgeprägte Team- und Kommunikationsfähigkeit</li>\n<li>sehr gute Deutsch- und Englischkenntnisse</li>\n</ul>\n<p>Was wir Ihnen bieten:\nDürr Dental ist ein international ausgerichtetes Familienunternehmen mit großer regionaler Verbundenheit. Wir bieten Ihnen ein attraktives, modernes und sehr kollegiales Arbeitsumfeld mit flexiblen Arbeitszeitmodellen, in welchem Innovationen groß geschrieben werden. Außerhalb Ihrer Arbeitszeit profitieren Sie von attraktiven Sport- und Freizeitangeboten, wie einem integrierten Fitnessraum oder betriebseigenen Ferienwohnungen in beliebten Erholungsgebieten. Werden Sie ein Teil unserer Erfolgsgeschichte!</p>\n<p>Wir freuen uns auf Ihre Bewerbung!\nDÜRR DENTAL SE\nPersonalabteilung\nHöpfigheimer Strasse 17\n74321 Bietigheim-Bissingen\n<a href=\"http://www.duerrdental.com/karriere\">www.duerrdental.com/karriere</a></p>\n",
      "how_to_apply": "<p>Als Technologieführer innerhalb der Gesundheitsbranche entwickelt und produziert Dürr Dental hochinnovative Systemlösungen in den Bereichen Equipment, Diagnostische Systeme und Hygiene. Was uns dabei erfolgreich macht: deutsche Ingenieurkunst, circa 1.200 engagierte Mitarbeiter und unser Anspruch, Medizintechnik immer die entscheidende Idee weiterzudenken.\nFragen Sie Ihren Zahnarzt!\n(Senior) Software Engineer IoT/Cloud Solutions (m/w/d)\nVollzeit\nIhre Aufgaben:</p>\n<pre><code>Entwicklung und Betrieb einer anspruchsvollen IoT/Cloud Lösung\nKonzeption, Implementierung und DevOps einer microservice-basierten skalierbaren IoT/Cloud Lösung auf AWS-Basis\nArbeiten mit agilen Methoden (SCRUM) in einem internationalen Team von Softwareentwicklern, Designern, Usability Experten und Testingenieuren\nMitgestaltung und Betreuung unserer Produkte über den gesamten Produktlebenszyklus\nAnalyse, Auswahl von Technologien und Diensten, Spezifikation, Implementierung von Funktionalitäten einschließlich Komponenten-, Integrations- und Unittests\n</code></pre>\n<p>Ihr Profil:</p>\n<pre><code>abgeschlossenes Studium der Informatik oder vergleichbarer Qualifikationen\nausgeprägte Berufserfahrung in der Softwareentwicklung von IoT/Cloud Lösungen\nKenntnisse in Serverless Computing und DevOps mit AWS, Azure oder GCP\nProgrammierkenntnisse in Python\nKenntnisse über Websocket, RESTful APIs und GraphQL sind von Vorteil\nErfahrung in agilen Entwicklungsmethoden sind von Vorteil\nErfahrungen in testgetriebener Entwicklung (TDD), objektorientierte Programmierung (OOP) und Clean Code sind von Vorteil\nErfahrungen mit GitLab, Jira und Confluence sind von Vorteil\nschnelle technische Auffassungsgabe sowie selbstständige und systematische Arbeitsweise\nausgeprägte Team- und Kommunikationsfähigkeit\nsehr gute Deutsch- und Englischkenntnisse\n</code></pre>\n<p>Was wir Ihnen bieten:\nDürr Dental ist ein international ausgerichtetes Familienunternehmen mit großer regionaler Verbundenheit. Wir bieten Ihnen ein attraktives, modernes und sehr kollegiales Arbeitsumfeld mit flexiblen Arbeitszeitmodellen, in welchem Innovationen groß geschrieben werden. Außerhalb Ihrer Arbeitszeit profitieren Sie von attraktiven Sport- und Freizeitangeboten, wie einem integrierten Fitnessraum oder betriebseigenen Ferienwohnungen in beliebten Erholungsgebieten. Werden Sie ein Teil unserer Erfolgsgeschichte!\nWir freuen uns auf Ihre Bewerbung!\nDÜRR DENTAL SE\nPersonalabteilung\nHöpfigheimer Strasse 17\n74321 Bietigheim-Bissingen\n<a href=\"http://www.duerrdental.com/karriere\">www.duerrdental.com/karriere</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTZoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4cee288cf0bd9ba335e6f8425711864b0f9e1b60/footer_1655.jpg"
    },
    {
      "id": "c4805a8e-97de-4b35-b1dd-cf251ba327aa",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c4805a8e-97de-4b35-b1dd-cf251ba327aa",
      "created_at": "Tue Apr 20 15:59:37 UTC 2021",
      "company": "Literally Media",
      "company_url": "https://literally.media",
      "location": "Remote",
      "title": "Full Stack - Ruby on Rails Developer",
      "description": "<p>About the Company:\nLiterally Media is a digital publishing house that owns and operates a collection of highly successful humor and entertainment websites. The portfolio of legendary digital brands includes eBaum’s World, Cheezburger, Know Your Meme, and Cracked, which dominate the entertainment market with over 50 million organic users a month.</p>\n<p>Be part of the most exciting and fulfilling company in the local digital media space, where we reach millions of people across the world with fun, entertaining brands they keep coming back to. This is a full-time position based remotely, with the option to work out of our offices in Brooklyn, NY.</p>\n<p>Job Description:\nLiterally Media is searching for an experienced, full time, Ruby on Rails web developer to join the KnowYourMeme team. Responsibilities include the full-stack ownership and development of the KnowYourMeme application, platform, and infrastructure. Ideal candidates include self-starters with a passion for internet and technology, with an emphasis on supporting the growth of the site, brand, and community.</p>\n<p>This mid-senior level position comes with a lot of responsibility. You will be architecting and implementing site features in their entirety which will then be served to tens of millions of users per month. You will report to our Head of Product &amp; Technology and work closely with various teams throughout the organization.</p>\n<p>About Development at Literally Media:\nAt Literally Media, we work together to craft software and features that make us proud. We care about our customers and strive to meet the needs of the Monetization, Business and Editorial teams.</p>\n<p>As a developer for KnowYourMeme, you’ll work with a small team of focused individuals who are serious about making a great product; and even more serious about having a great time interacting with our various teams spanning the globe. Every member of our team is vital and has the opportunity to influence the direction of the product, architecture, and the company at large.\nWe are an agile organization that embraces iterative development &amp; continuous deployment with a key focus on data-driven decision making.</p>\n<p>Must Haves (Basic Qualifications):</p>\n<p>●  At least 5 years of proven experience working as a software developer</p>\n<p>●  Applied knowledge and understanding of our Platform specifications (see below)</p>\n<p>●  Experience developing on front &amp; backend consumer facing websites</p>\n<p>●  Experience with Ruby on Rails, Commonly used Gems, MVC, and interfacing with front end technologies such as HTML, HAML, CSS, and Javascript</p>\n<p>●  Familiarity with commonly used front-end libraries, frameworks and tools</p>\n<p>●  Experience with Agile development practices</p>\n<p>●  Familiar with UX &amp; UI best principles, with a keen eye for mobile and desktop design</p>\n<p>●  Proficient in architecting and integrating with a wide variety of web service APIs</p>\n<p>●  Proficient understanding of code versioning with git</p>\n<p>●  Proficient operating in a Linux environment</p>\n<p>●  A very high degree of intellectual curiosity, and a passion for software development</p>\n<p>Optional (Nice to Have):</p>\n<p>●  Work experience with an online digital publisher</p>\n<p>●  Experience with DFP, Header Bidding, and Native Advertising</p>\n<p>●  Experience with Google Analytics</p>\n<p>●  An analytical mindset to facilitate the data-driven company needs</p>\n<p>●  Interest in Internet &amp; Meme culture</p>\n<p>●  Experience integrating with Social Platforms (Facebook, Twitter, Pinterest)</p>\n<p>●  BS/MS degree in Computer Science, Engineering or in a related field a plus</p>\n<p>Our Platform:\n●  Language: Ruby\n●  Framework: Ruby on Rails\n●  Databases: MySQL, Redis\n●  Caching: Memcache\n●  Infrastructure: Self hosted, Ubuntu, Nginx/Unicorn web servers\n●  HAProxy Load Balancer\n●  Front End: Bootstrap, HAML\n●  Images: ImageMagick for processing, s3 for storage\n●  CDN\n●  Deployment: Capistrano Ruby gem (SSH &amp; Git)</p>\n",
      "how_to_apply": "<p>Email you resume to: <a href=\"mailto:careers@literally.media\">careers@literally.media</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4c4cfa24d3d58784b8f8fd7b1750edf4712924cc/Literally%20Logo%20.png"
    },
    {
      "id": "c0dd4b46-df38-4c3a-a72f-ce7c919822b8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c0dd4b46-df38-4c3a-a72f-ce7c919822b8",
      "created_at": "Tue Apr 20 15:44:55 UTC 2021",
      "company": "Design Center, Inc.",
      "company_url": "https://designcenterideas.com/",
      "location": "Saint Paul, MN",
      "title": "Mobile Software Developer",
      "description": "<p>Job Description:</p>\n<p>Design Center, Inc. is looking for mobile application developers with experience or a desire to write native mobile applications for iOS and Android. You will have the opportunity to develop and maintain our custom-designed mobile applications and help us develop applications for new technologies like virtual and augmented reality. Applicants should be comfortable in an environment where you'll be working alongside other developers, designers, copywriters, and 3D artists. You'll be asked to take on new challenges consistently as part of a small team of developers implementing applications of all sizes.</p>\n<p>Our Development Team:</p>\n<p>Develops maintainable code under industry standards, best practices, and guidelines\nCollaborates with multi-functional teams within Scrum methodology\nCreates engaging custom applications with complex animations and effects\nWrites native mobile applications for iOS, Android, and Windows devices (Swift/C#/Xamarin)\nDevelops web applications that drive our mobile applications (C#/ASP.NET/MVC)\nWorks on projects that range from weeks to months, with opportunities to consistently work with new clients and co-workers\nResearches the forefront of technology and is continually learning new and relevant skills\nEngages in improving their own processes and development practices</p>\n<p>Experience: Skills &amp; Requirements:</p>\n<p>Excellent personal skills with the ability to manage a small team of developers and interact with other creatives and clients\n4+ years experience developing a wide range of applications and in a variety of technologies\nThe passion to learn new skills and take on difficult tasks\nSelf-motivation and great time management skills\nA desire to improve on best practices, code standards, and software architecture\nExperience with database design, web development, API creation, and mobile application development\nComputer science degree or equivalent experience</p>\n<p>To the qualified candidate we offer:</p>\n<p>Competitive salary\n401(K) with company match up to 3%\nHealth, dental, vision, and life insurance\nPaid vacation and holidays\nQuarterly team-building events\nPaid day off for birthday\nDog-friendly office\nGame nights\nCasual dress\nSpecial interest clubs\nEmployee Assistance Program\nOpportunities to establish industry-standard processes.\nA fun and challenging environment where you will work as a respected member of a cross-discipline team</p>\n<p>Location: Saint Paul, MN\nDepartment: Software Development\nStatus: Exempt\nReports To: Director of Operations &amp; Software Development\nPosition Type: Full-Time\nSchedule: Monday - Friday</p>\n",
      "how_to_apply": "<p>Please Apply here: <a href=\"https://designcenter.bamboohr.com/jobs/view.php?id=27&amp;source=aWQ9Nw%3D%3D\">https://designcenter.bamboohr.com/jobs/view.php?id=27&amp;source=aWQ9Nw%3D%3D</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUtoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4b08557a5d13df0995a7c7ab7708e75dd0fb8bcb/download.png"
    },
    {
      "id": "1f3b4fb3-3c54-4685-8a97-46c360eb2dd8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/1f3b4fb3-3c54-4685-8a97-46c360eb2dd8",
      "created_at": "Tue Apr 20 08:38:53 UTC 2021",
      "company": "Infoplus",
      "company_url": "https://vonq.io/3sBCpH3",
      "location": "Saint Louis, USA",
      "title": "Support Engineer - Tier III",
      "description": "<p><strong>We're hiring a support engineer.</strong></p>\n<p>This is a semi-customer-facing, mid level role which means you would come to us with 3+ years of web based software application technical support experience, proficient experience in Javascript, API and SQL, 1+ years of Warehouse or WMS knowledge, and dig in immediately to our software and support. If you are a passionate technical problem solver with warehouse industry experience and are focused on creating the win-for-all solutions for customers, then we’d love to hear from you.</p>\n<p><strong>Here's the day to day</strong></p>\n<p>hese are the functional assignments (or FA’s as we call them internally) that make up this job - this is what you’re focused on every day, day in and day out.</p>\n<ul>\n<li>Being a Software SME (Subject Matter Expert)\n<ul>\n<li>You’re focused on becoming the in-house expert for the Infoplus WMS. Anything and everything Infoplus software will be your focus. This ranges from possible escalated tickets about APIs, SQL backend, EDI questions, and any other customer tickets that are escalated from Tier 1 and Tier 2 support queues.</li>\n</ul>\n</li>\n<li>Troubleshooting and Solving Technical Issues\n<ul>\n<li>Your role will help solve the most challenging and in-depth customer tickets (what we call Tier 3). These are customer issues that go deeper than the surface in our software and require technical expertise such as JavaScript, APIs, etc. Anything short of a bug fix falls under this role.</li>\n</ul>\n</li>\n<li>Recreating Warehouse Scenarios and Problems\n<ul>\n<li>You’ll be reproducing and recreating the warehousing problems and scenarios customers face within our software. This includes tickets about: the application itself, the features, scenarios within a warehouse and their related processes, or third party softwares that are tied to Infoplus.</li>\n</ul>\n</li>\n<li>Serving as the Knowledge Resource for Better Documentation\n<ul>\n<li>You will be the technical and Infoplus expert-level knowledge resource to help the rest of your support and content team enhance and create internal and external documentation.</li>\n</ul>\n</li>\n<li>Customer Communication\n<ul>\n<li>This is a semi-customer facing role where your responses are requested. You’ll be comfortable answering customer tickets on a regular basis and providing updates along the way of your solution to exceed their expectations. When you aren’t doing this directly, you’re providing another support agent with the same information and details for them to communicate.</li>\n</ul>\n</li>\n</ul>\n<p><strong>What a Top Candidate Will Have</strong></p>\n<p>We’re interested in the Right Person (yes, it’s meant to be capitalized) - for us, a Right Person is someone who matches our Core Values, has the right skills and experience, and this job would fill their cup and get them excited each morning.</p>\n<ul>\n<li>Knack for Making the Complex, Simple\n<ul>\n<li>You want to take the complex and make it simple (and are the best in your field at it). Your communication and solutions are focused on the greater good for everyone involved. You know you are the expert, and you want to share that knowing it will bring a solution to a new, and better, level.</li>\n</ul>\n</li>\n<li>Strong Independent Worker\n<ul>\n<li>You want to find answers to your own questions. You are someone that has an internal fire to continuously learn the application without being guided or told what to look for. You want to be the expert, and nothing will stop you from becoming that.</li>\n</ul>\n</li>\n<li>Technical Zone of Genius\n<ul>\n<li>You get energy from working in the depths of software. You lose time finding, diagnosing, and solving technical problems. Your passion is supporting great software at the most technical level and beyond.</li>\n</ul>\n</li>\n<li>Focused on Customers Success\n<ul>\n<li>You only accept finding the win-for-all path forward. You choose to look through the lens of the customer first. You make choices with the customer’s long-term goals and relationship in mind (sometimes this is the “hard no”).</li>\n</ul>\n</li>\n<li>Ability to Dig In and Discern\n<ul>\n<li>You want to roll up your sleeves and get down and dirty in the nuances of everything Infoplus. There can be a lot of noise and muck, so you know how to tell what’s important. You also recognize when to come up for air on a problem and can prioritize your workload and customer tickets.</li>\n</ul>\n</li>\n</ul>\n<p><a href=\"https://vonq.io/3sxjJZg\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3sxjJZg\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4339bdf230380b381eb41de70c8d7311c62ea626/Infoplus.png"
    },
    {
      "id": "ff8a7de7-1870-462c-8744-4f2f96ae2dbf",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ff8a7de7-1870-462c-8744-4f2f96ae2dbf",
      "created_at": "Mon Apr 19 16:44:25 UTC 2021",
      "company": "AbleDocs",
      "company_url": "http://AbleDocs",
      "location": "Zurich",
      "title": "Full Stack .Net Developer",
      "description": "<p>About Us</p>\n<p>AbleDocs is a leading global software and service company with the aim of making an inclusive information society possible: every content provider should be able to provide documents in a barrier-free form. Through a combination of human and software processes, AbleDocs makes it easy for companies and non-profits to find information that is inaccessible to all - and to make it accessible!</p>\n<p>AbleDocs is also growing rapidly! From a Startup of 8 outside of Toronto at the beginning of 2019 to becoming a remote-first company of more than 100 people spread across North America and Europe in less than 3 years, AbleDocs has expanded and continues our rapid expansion. We are putting a focus on software solutions for automating document accessibility, and that's where you can help!</p>\n<p>Come join a welcoming culture of teamwork, growth, success, and advancement. We take care of our team and love to see them grow and evolve as professionals. Our team is passionate about document accessibility! This passion is reflected in our products and services while allowing us to deliver a profound impact on the lives of people with disabilities. In turn, we gain an overwhelming feeling of gratitude and fulfillment that our work is positively impacting the lives of others. Every month we create millions of documents or, our customers create them themselves with the help of our software solutions. The spectrum of customers ranges from design agencies to Fortune 100 companies to government agencies all over the world, just to name a few.</p>\n<p>As a full stack .Net developer (m / f / d) you will work together with our VP Technology (in Germany\nand / or Switzerland) and strengthen our software engineering team. With you we want to take our applications to the next level. You are best suited to us if you are a team player with an eye for detail, solve problems in a structured manner, are an absolute .NET crack and already have professional experience working with Azure frameworks.</p>\n<p>Your day-to-day business:</p>\n<ul>\n<li>You develop our innovative applications further</li>\n<li>You help to make our core technologies even better</li>\n<li>You develop new applications using the latest technologies and agile approaches</li>\n<li>You design software architectures and interfaces and create specifications</li>\n<li>You create sustainable software components and flexible microservices (REST)</li>\n<li>You design and build cloud architectures as well as databases</li>\n<li>You create the associated documentation</li>\n<li>You inspire our customers with precise and friendly third level support</li>\n<li>You will help us to further optimize our development process and consistently implement both continuous integration (CI) and continuous delivery (CD)</li>\n<li>You include test automation (unit, integration, end-to-end tests) in the development process as a matter of course</li>\n<li>You work together with other development teams on an international level</li>\n<li>You do not lose sight of the user experience across all project phases</li>\n</ul>\n<p>Our technology stack:</p>\n<ul>\n<li>.NET and .NET Core</li>\n<li>Microsoft Azure</li>\n<li>MS SQL</li>\n<li>Visual Studio, GitHub, Azure DevOps</li>\n<li>React</li>\n<li>JIRA, Confluence</li>\n</ul>\n<p>What you bring:</p>\n<ul>\n<li>Completed degree (university) in the field of IT</li>\n<li>At least 3 years of professional experience in software engineering</li>\n<li>The following technologies and methods are your absolute core competencies:</li>\n<li>.NET and .NET Core</li>\n<li>Microsoft Azure</li>\n<li>Visual Studio, Git</li>\n<li>Software design patterns</li>\n<li>You are an expert in designing and creating relational databases with MS SQL Server</li>\n<li>You are familiar with CI / CD (Azure DevOps)</li>\n<li>You master C # in your sleep. In addition, you have experience in programming and debugging in at least two other languages: for example, JavaScript, PHP or Python.</li>\n<li>You are familiar with working with the project management and documentation tools Jira and Confluence</li>\n<li>You can moderate technical discussions as well as decision-making discussions. It will be easy for you to convey IT topics to both experts and laypeople.</li>\n<li>You speak German and English fluently</li>\n<li>You contribute to transparent and appreciative communication, to our typical AbleDocs team spirit and to a collegial exchange of knowledge</li>\n<li>You are capable of learning and want to stay up to date with the latest technologies</li>\n<li>From time to time you like to travel to meet your teams or to support our customers on site</li>\n</ul>\n<p>What we offer you:</p>\n<ul>\n<li>The challenge of solving diverse and demanding tasks in a team</li>\n<li>A well-structured and supervised induction period through our internal ADAcademy</li>\n<li>We value a high degree of exchange of experiences with colleagues, flat hierarchies, and mutual respect</li>\n<li>Attractive, performance-related remuneration and opportunities for advancement in a growing team</li>\n<li>Flexible working hours and freedom for independent, self-reliant work</li>\n<li>Additional health benefits, bonuses, and participation in our profit-sharing program</li>\n<li>A flexible home or remote office activity with regular in-person days with your team.</li>\n<li>We are a global community of digital accessibility enthusiasts and like to share our knowledge - not only within the company. That is why AbleDocs supports you when you want to write blog posts and articles, organize meetups or speak at conferences.</li>\n</ul>\n<p>This is how you apply:\nThat sounds like you? Then send us your resume to <a href=\"mailto:scosta@abledocs.com\">scosta@abledocs.com</a>.  A few personal words would be nice too. We look forward to meeting you!</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:scosta@abledocs.com\">scosta@abledocs.com</a>.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1doIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--843cdb4a6705e420e4ec710c7be159fdda8232d2/AbleDocs_RGB%20Logo.png"
    },
    {
      "id": "2ecfcca7-2c1b-48c7-ae2b-373cee3fd309",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2ecfcca7-2c1b-48c7-ae2b-373cee3fd309",
      "created_at": "Sun Apr 18 23:18:56 UTC 2021",
      "company": "Service NSW",
      "company_url": "https://www.service.nsw.gov.au/about-us/jobs-service-nsw",
      "location": "New South Wales Australia ",
      "title": "Senior Software Engineer",
      "description": "<p>We are looking for passionate, driven and innovative Senior Software Engineer to join our world class Engineer Team at Service NSW!</p>\n<p>We have Permanent Ongoing  Senior Software Engineer roles now available.</p>\n<p>We are offering a base salary range between $111,806 and $134,667 plus employer’s contribution to superannuation and leave loading, plus offering flexible working arrangements.</p>\n<p>About Our Team:</p>\n<p>You will be a part of a highly creative, agile, human centered development team who  values your happiness, growth and personal development.</p>\n<p>We use XP practices (including TDD, pair programming and CI/CD) to design and build fast stable software and get it into our customers’ hands quickly. We are committed to iterative delivery using the build, measure, learn paradigm. We pride ourselves on being responsive to customers’ needs, consistently delivering value to the people of NSW.</p>\n<p>We work with Java (Spring), JavaScript (React.js, Angular.js, Node.js), AWS Cloud, Cloud Foundry and Apigee to deliver end-to-end platforms. We collaborate closely with other teams to architect and implement the right solutions, applying lean problem-solving to deliver value within a complex ecosystem.</p>\n<p>About You:</p>\n<p>Expertise and strong experience software development. Maybe you’re a web, API or platform specialist who wants to expand your full stack skillset, or maybe you’re already a Front end to cloud database expert. Either way, you know what makes customer focused products special, and love building products that millions of people use.</p>\n<p>Excellent understanding of systems thinking and technical design. You might not be a full-stack unicorn (yet), but you can design and implement system interactions to deliver end-to-end solutions.</p>\n<p>We’d love to see some experience applying technical design skills in large or complex ecosystems.</p>\n<p>Attention to detail. You strive for the best quality code; adopting practices/style guides that encourage clean and readable code. You pay particular attention to code reusability, extensibility, maintainability, scalability and security. Often going out of your way to find the best solution possible.</p>\n<p>Outstanding communication, collaboration and problem-solving skills. You encourage diversity of thought, thrive in a team environment, and do your best work whilst working in a pair/team.</p>\n<p>Proficient in one or more modern programming languages. JavaScript/TypeScript, Java Swift, Objective-C or Kotlin will give you a headstart, but your openness to upskilling and cross-skilling is what will get you across the line.</p>\n<p>Customer-oriented and proud. You are motivated by, and take ownership of, delivering valuable outcomes to the people who use your software.</p>\n<p>Continuous improvement forever! You are a lifelong learner, always driven to improve processes and outcomes. You value close feedback loops, and the concepts of iteration and incremental improvement.</p>\n<p>Security-minded. You have a passion for security by design, and exposure to or interest in security engineering as concept.</p>\n<p>About Service NSW</p>\n<p>At Service NSW we deeply value our customers and our teammates. We are an inclusive, diverse, caring and respectful team and a place where everyone can bring their whole self to work.\"</p>\n<p>People with a disability are strongly encouraged to apply and we welcome a discussion regarding workplace adjustments to help maximise everyone's opportunity to fully participate and contribute.\"</p>\n<p>\"We pay our respects to Aboriginal and Torres Strait Islander peoples and Elders past, present and emerging and acknowledge the traditional custodians of the land, waters, culture and community we walk, work and live.\"</p>\n<p>To Apply, click on the below link,</p>\n<p><a href=\"https://iworkfor.nsw.gov.au/job/senior-software-engineer-239097\">https://iworkfor.nsw.gov.au/job/senior-software-engineer-239097</a></p>\n<p>Please attach a copy of your latest Resume and a cover letter.</p>\n<p>Applications will be reviewed on an ongoing basis - we encourage you to apply ASAP so you don’t miss out on these exciting opportunities within our Engineer Teams at Service NSW</p>\n",
      "how_to_apply": "<p><a href=\"https://iworkfor.nsw.gov.au/job/senior-software-engineer-239097\">https://iworkfor.nsw.gov.au/job/senior-software-engineer-239097</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkdoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c4fbcb3d2cd7ee8cabf5ee3899b16de1b90b283d/SNSW%20PIC2.jpg"
    },
    {
      "id": "ed6a4bb6-e15d-453d-b6bf-1011011f4d95",
      "type": "Contract",
      "url": "https://jobs.github.com/positions/ed6a4bb6-e15d-453d-b6bf-1011011f4d95",
      "created_at": "Fri Apr 16 22:55:53 UTC 2021",
      "company": "Superformula",
      "company_url": "https://www.superformula.com/",
      "location": "Remote (Americas)",
      "title": "Senior Backend Engineer, Digital Products",
      "description": "<p>We are seeking a full-time backend engineer with 6+ years of experience building enterprise-scale and production-ready applications. This is a high visibility product team where you will get a chance to make a positive impact on customer experience in the automotive enthusiast industry. You will be building greenfield products with our product teams on behalf of our clients.</p>\n<p>*denotes must-haves\n<strong>Skills</strong></p>\n<ol>\n<li>Ability to take ownership of work items and help cultivate new ones with a Product-first mindset*</li>\n<li>GraphQL &amp; REST API concepts and implementation patterns*</li>\n<li>Domain-driven design experience within distributed systems*</li>\n<li>Cloud-native / managed services exposure</li>\n<li>Experience with event-driven system architectures</li>\n</ol>\n<p><strong>Languages/frameworks</strong></p>\n<ol>\n<li>TypeScript / Node.js LTS*</li>\n<li>Terraform or other IaC</li>\n<li>Testing frameworks such as Jest or Mocha</li>\n<li>Bash / Shell scripting for CI/CD pipelines</li>\n</ol>\n<p><strong>Tooling</strong></p>\n<ol>\n<li>AWS AppSync, Lambda, DynamoDB, SNS, SQS*</li>\n<li>CI/CD Pipelines</li>\n<li>Familiarity with GraphQL Server ecosystem (Apollo Server, apollo-server-lambda, express-graphql, etc.)</li>\n<li>Exposure to E2E testing tools (Cypress, Selenium, TestCafe, etc.)</li>\n</ol>\n<p><strong>To thrive as a member of our team, you must:</strong></p>\n<ul>\n<li>Operate with an ownership mentality by taking initiative, being resourceful, and executing with passion</li>\n<li>Have excellent verbal and written communications skills</li>\n<li>Ability to work early hours to communicate with our development teams in North America, South America, and Poland</li>\n<li>Be a quick learner and be passionate about learning</li>\n<li>Embody creativity, be honest, humble, mature, committed, and cultivate a positive culture</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://careers.superformula.com/o/senior-backend-engineer-north-central-and-south-america?source=github\">https://careers.superformula.com/o/senior-backend-engineer-north-central-and-south-america?source=github</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTZoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ebc0b539247b6c329fe91cfdda7a24fafac638c/sf-logo.png"
    },
    {
      "id": "59428bb6-51f4-44ba-9e85-1be7cc2e263d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/59428bb6-51f4-44ba-9e85-1be7cc2e263d",
      "created_at": "Fri Apr 16 15:56:15 UTC 2021",
      "company": "Journey",
      "company_url": "http://www.journeyid.com",
      "location": "Denver",
      "title": "Senior Product Engineer",
      "description": "<p>Job Overview</p>\n<p>Journey is tackling two of the original deficiencies of the internet, the veracity of identity and the protection of protection of personal privacy. Journey is looking for an experienced and customer driven software engineer who can translate business requirements into high quality products. Successful Journey engineers enjoy exploring the why of the product in addition to the how. Recognizing that customer experience is pivotal to the success of a product or service is also a requirement for this job. As an agile team, the decision making process is driven by the ability to create the most compelling product for our customers, while simultaneously taking into account the natural limitations of a start-up environment.</p>\n<p>Responsibilities &amp; Growth</p>\n<p>The immediate need is for an intermediate to senior individual contributor for our in-progress products. This will quickly be eclipsed as our product suite grows to become a core product design and development role that includes the role of Product Owner.</p>\n<p>Journey has just completed validation of the MVP of one of our products and now must scale up the team to meet customer needs. The successful candidate is immediately a critical contributor to this product’s development.</p>\n<p>The startup environment also creates an environment for broader opportunities and responsibilities.</p>\n<p>Technologies</p>\n<p>Journey uses a modern suite of development tools wrapped in the SAFE agile methodology. Our development technologies include (but are not limited to) React for the frontend, and Go for the backend. Deployment is targeted at public cloud, private cloud and virtual private cloud environments. A CI/CD pipeline is in place to build and deploy via Github Actions. As a state of the art start-up, Journey has the opportunity to use the best available frameworks and tools, including browser based Tensorflow for our ML features</p>\n<p>The Ideal Candidate</p>\n<p>The ideal candidate will have a strong software background and a broad interest in the rapid evolution of software development and tools. This has been demonstrated through commercial experience as well as personal interests and projects. Direct experience with our current software tools is not a prerequisite, but proven experience with a strongly-typed language in a production environment is desired. You must have an understanding of system architecture, particularly when it comes to redundancy and reliability. You take pride in your work and want to grow, both at Journey and in your career.</p>\n<p>The successful candidate will be a self-starter, an engineer who seeks to understand and discover and an engineer who has a desire to become part of a highly empowered team with a deep understanding of our product, our market and the key metrics of success.</p>\n<ul>\n<li>You have been working on web projects for long enough that you reminisce &amp; complain about the old days of Javascript.</li>\n<li>You feel very confident building React apps using Redux.</li>\n<li>You have extensive experience with a strongly-typed language in a production environment.</li>\n</ul>\n",
      "how_to_apply": "<p>Please email resume to <a href=\"mailto:jobs@journeyid.com\">jobs@journeyid.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--60fe54adcac0ac0e0953a2c53844f4b8598f9bf1/Journey-Primary-Logo-Color-Tagline.jpg"
    },
    {
      "id": "aaeab197-4bbb-4eee-9b03-d45828021d64",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/aaeab197-4bbb-4eee-9b03-d45828021d64",
      "created_at": "Fri Apr 16 11:44:21 UTC 2021",
      "company": "Contabo GmbH",
      "company_url": "https://contabo.com/de/",
      "location": "Cologne",
      "title": "Web-Frontend Developer (m/f/d) with UX/UI Experience in Munich, Nuremberg or Cologne",
      "description": "<p>Contabo is a fast-growing German server provider serving customers in 178 countries. Our rapid growth is fueled by truly German quality of service and great prices.</p>\n<p><strong>Where do we need your help</strong></p>\n<ul>\n<li>You set the groundbreaking course in close cooperation with the team and actively\nparticipate in the technical conceptual design and solution</li>\n<li>You have experience in implementing web front-ends with user experience (UX) methods</li>\n<li>You have a good hand for the design (CSS frameworks) and usability of user\ninterfaces (UI)</li>\n<li>The technical implementation of user interfaces with Svelte is no problem for you</li>\n<li>In addition, you have experience with SPA and possibly PWA</li>\n</ul>\n<p><strong>What are we looking for</strong></p>\n<ul>\n<li>You have a university degree in computer science or comparable training</li>\n<li>You have very good knowledge in the area of UX, UI and TypeScript</li>\n<li>You are a team player and have an agile mindset</li>\n<li>Fluent English language skills and preferably basic understanding of German</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>The opportunity to develop professionally and personally in an innovative and\ntechnological environment</li>\n<li>Conveniently located offices in Munich, Nuremberg or Cologne</li>\n<li>The possibility to work in a mobile office</li>\n<li>Free coffee, drinks, snacks and fruit in the office</li>\n<li>Many team events like summer party, Christmas party or visit of the oktoberfest</li>\n<li>Open communication across all levels and the opportunity to help shape the exciting\ndevelopment of the company</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/40d7bb8c7cbff27453c56afa2daa5affff0168e1/68747470733a2f2f742e676f686972696e672e636f6d2f682f65633834346639373732653562396562383933663263383931343132666539363466616632373562653962626333613731646136373834316539376139343736\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/27fe63fff4f65a677ed2e7f478d04ea400f9dbcc514941bc8a530e2ae74b9c4b\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0bb66156fbfc39d50e45917f0521d841f145b943/Contabo%20GmbH.png"
    },
    {
      "id": "cb49ed6c-8f4e-4f88-9bc4-05f090159155",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/cb49ed6c-8f4e-4f88-9bc4-05f090159155",
      "created_at": "Thu Apr 15 21:22:15 UTC 2021",
      "company": "Alfi",
      "company_url": "https://www.getalfi.com/",
      "location": "Denver, CO",
      "title": "Mobile App Developer",
      "description": "<p>The Company</p>\n<p>Alfi, headquartered near Denver’s historic Union Station, is an AI enterprise SaaS platform powering computer vision with machine learning models, deep learning and edge computing to deliver the right content, to the right person at the right time in a respectful and ethical manner.</p>\n<p>We are an innovative big data company specializing in artificial intelligence and machine learning. Alfi uses computer vision in tandem with custom built, ultra-precise, proprietary models to process customer demographics and sentiment while capturing big data and delivering analytical reporting in real time. Learn more at <a href=\"https://getAlfi.com\">https://getAlfi.com</a>.</p>\n<p>The Opportunity</p>\n<p>The candidate will contribute to the development of the Alfi Tablet and IoT device application. You will help shape and develop the Alfi React Native application (UI/ UX) as well as contribute to the development of the Alfi Android ecosystem. You will work as an integral part of the Alfi engineering team.</p>\n<p>The Responsibilities:</p>\n<ul>\n<li>Deliver high-quality, tested, secure and documented customer-centric solutions</li>\n<li>Implement, test and deploy the Alfi React Native/Android Application</li>\n<li>Implement, test and deploy the Alfi Android ecosystem</li>\n<li>Implement automation through a CI/CD delivery process</li>\n</ul>\n<p>The Requirements:</p>\n<ul>\n<li>3+ years in industry developing Mobile Apps</li>\n<li>Demonstrable knowledge of React Native app development</li>\n<li>Knowledge of UI/UX concepts</li>\n<li>Experience working in an Agile environment</li>\n<li>Bachelor in IT, Software development of related discipline</li>\n</ul>\n<p>The Bonuses:</p>\n<ul>\n<li>Familiar with Agile/SCRUM</li>\n<li>Demonstrable Experience in deploying Android Apps to production</li>\n<li>Experience with IoT, Authentication, Smart Cities technologies</li>\n<li>Strong plus: Java/Kotlin, Swift, JavaScript frameworks (React/Vue/Angular), C/C++, ML &amp; AI at\nthe Edge</li>\n</ul>\n<p>The Benefits;</p>\n<p>If your skillset aligns with the qualifications above, then we welcome your application to work with the best, rapidly growing team here at Alfi. Everyone at Alfi acknowledges that hard work, bravery, honesty, accountability and dignity are universal values that can make or break a team and empower an individual to accomplish even the toughest goals. We invite you to join us on this journey.</p>\n<ul>\n<li>Competitive Salary</li>\n<li>Stock Options</li>\n<li>Two Weeks Paid Vacation Leave</li>\n<li>Healthcare Benefits</li>\n<li>Stocked Onsite Kitchen</li>\n</ul>\n",
      "how_to_apply": "<p>Email your resume to Trevor Siebert at <a href=\"mailto:trevor.siebert@roberthalfes.com\">trevor.siebert@roberthalfes.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2VoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--069e72d84ea8e467e00e6fe0357fce3a852f21d2/ALFI-TAGLINE-1.png"
    },
    {
      "id": "d59c5443-1d5b-4d0b-bacb-f1dbfb04eb72",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d59c5443-1d5b-4d0b-bacb-f1dbfb04eb72",
      "created_at": "Thu Apr 15 21:18:18 UTC 2021",
      "company": "Alfi",
      "company_url": "https://www.getalfi.com/",
      "location": "Denver, CO",
      "title": "Senior Front End Developer",
      "description": "<p>The Company</p>\n<p>Alfi, headquartered near Denver’s historic Union Station, is an AI enterprise SaaS platform powering computer vision with machine learning models, deep learning and edge computing to deliver the right content, to the right person at the right time in a respectful and ethical manner.</p>\n<p>We are an innovative big data company specializing in artificial intelligence and machine learning. Alfi uses computer vision in tandem with custom built, ultra-precise, proprietary models to process customer demographics and sentiment while capturing big data and delivering analytical reporting in real time. Learn more at <a href=\"https://www.getalfi.com\">https://www.getalfi.com</a>.</p>\n<p>The Opportunity</p>\n<p>Excellent opportunity for a top-notch Sr. Front-End Developer skilled in React to help drive and contribute to the development and vision of Alfi’s current &amp; next-gen products.</p>\n<p>As a Sr. Front-End Developer, you will have the chance to take ownership of your wheelhouse as you lead in your own direction in lockstep with your peers. You will be responsible for delivering clean and effective code in alignment with initiative deadlines, contributing to the adherence of the Scrum methodology, and using your skills &amp; experience to provide mentorship to Junior Developers to facilitate industry best practices.</p>\n<p>This is an exciting opportunity in a fast-growing startup enterprise for anyone who is looking to advance their career with the expectation of contributing to our company values &amp; team-culture. If you’re looking to get in with an edge company at a great time, with a great team of passionate engineers, please read on.</p>\n<p>The Responsibilities:</p>\n<ul>\n<li>Translate UI/UX compositions into functional, extensible, and testable components.</li>\n<li>Develop readable code from an interface-first approach to deliver features on a timely cadence.</li>\n<li>Provide feedback &amp; review peers’ code and refactor code of your own when necessary.</li>\n<li>Contribute to ongoing documentation.</li>\n<li>Provide articulate mentorship of Mid-Level &amp; Junior developers on clean code design and best\npractices.</li>\n<li>Participate in all faculties of Scrum Methodology.</li>\n</ul>\n<p>The Requirements:</p>\n<ul>\n<li>5+ years of JavaScript (ES5+), CSS(2+), and experience consuming internal &amp; external Web\nAPI’s.</li>\n<li>2+ years of React development and Flux implementations.</li>\n<li>Strong understanding of Front-End concepts: e.g; Hash-Routing, DOM, ShadowDOM, CSSOM,\nBox-Model.</li>\n<li>Demonstrable ability to decompose UI elements into reusable components.</li>\n<li>Solid understanding of both OOP and Functional Programming concepts.</li>\n<li>Firm understanding of Software Coupling, Composition vs Inheritance, and Function Purity.</li>\n<li>Eye for UX design, mind for engineering simplicity, and propensity to program to interfaces --\nnot implementations.</li>\n</ul>\n<p>The Bonuses:</p>\n<ul>\n<li>Familiarity with Scrum Methodology</li>\n<li>Classic algorithms &amp; data-structures, Software Design Patterns, SOLID, and more than 1 front-\nend framework.</li>\n<li>ReactNative, Redux, or other front-end stores and data-flow models.</li>\n<li>Java, Scala, Kotlin, and Android development.</li>\n<li>Python, AWS, Lambdas, REST.</li>\n<li>Experience or interest in PHP/Wordpress.</li>\n</ul>\n<p>The Benefits:</p>\n<p>If your skillset aligns with the qualifications above, then we welcome your application to work with the best, rapidly growing team here at Alfi. Everyone at Alfi acknowledges that hard work, bravery, honesty, accountability and dignity are universal values that benefit everyone and empower the individual to accomplish even the toughest goals. We invite you to join our growing family of engineers on this journey.</p>\n<ul>\n<li>Competitive Salary</li>\n<li>Stock Options</li>\n<li>Two Weeks Paid Vacation Leave</li>\n<li>Healthcare Benefits</li>\n<li>Stocked Onsite Kitchen</li>\n</ul>\n",
      "how_to_apply": "<p>Email your resume to Trevor Siebert at <a href=\"mailto:trevor.siebert@roberthalfes.com\">trevor.siebert@roberthalfes.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1doIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--602b29fcf54086993bc256619abbb92d5d84df5c/ALFI-TAGLINE-1.png"
    },
    {
      "id": "f4250b25-4c26-44b3-96d6-3298e0cac40d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/f4250b25-4c26-44b3-96d6-3298e0cac40d",
      "created_at": "Thu Apr 15 16:47:36 UTC 2021",
      "company": "4Degrees",
      "company_url": "http://4degrees.ai",
      "location": "Chicago (open to Remote)",
      "title": "Senior Software Engineer",
      "description": "<h2>The short version</h2>\n<p>Early-stage venture-backed startup looking for a software engineer to use Python, Javascript, and HTML/CSS to help build out our web platform. Good fit if you like moving fast, having impact, and working on a variety of different things.</p>\n<h2>Who we are</h2>\n<p>We’re a fast-moving startup with a vision to empower all professionals by helping them build better relationships. Our vision is to fix the network gap: the inequality of opportunity driven by not having the right connections. To solve this problem, we’re combining the best practices of the world’s top relationship builders with artificial intelligence.</p>\n<p>We’re building a mission-driven team that strives to live out our values every day:</p>\n<ul>\n<li>Customer-centricity</li>\n<li>Diversity of perspective</li>\n<li>Authenticity</li>\n<li>Growth (individual and collective)</li>\n<li>Impact</li>\n</ul>\n<p>We’re an ambitious, driven team and we push ourselves to accomplish a lot quickly. In the past couple of years we've gone through one of the world's top accelerators, raised two rounds of venture financing, launched our product, rapidly grown our customer base, and architected a robust set of machine learning models as a core source of competitive advantage. In the process, we’ve been named one of Chicago’s top 50 startups to watch, one of Chicago Inno’s 50 on Fire, a part of the highly selective Google for Startups Black Founders Accelerator and Black Founders Fund. And we’re just getting started!</p>\n<h2>The opportunity</h2>\n<p>4Degrees is at an inflection point - we’ve built a product that’s pioneering a new category of software (relationship intelligence), and are rapidly growing.  We're well funded, have hundreds of highly engaged customers, who consistently increase their contract size with us, and are planning with us on how we can take this company into the future.  We’ve done this with a scrappy, early-stage team.</p>\n<p>The opportunity ahead of us is vast - every business that relies on their relationship network to drive their business has a use case for 4Degrees.  To seize that opportunity, we're looking for great engineers to help us build on top of the foundation we've created, while also pioneering new ways to help our customers unlock the value their relationships can bring to their business.  You’ll build and use a versatile set of skills: switching between tasks like rolling out major new functionality, diagnosing and fixing bugs, and playing support for other front-end or back-end engineers.</p>\n<p>By joining us, you will play a highly impactful role in re-inventing the way professional relationships are managed and building a rapidly growing category. Along the way, you’ll have an opportunity to get unrivaled exposure to all facets of building a startup, and directly shape the outcomes of 4Degrees and its customers.  And if you want to build a company of your own after joining us, you'll get direct mentorship from the founding team and support in doing so!</p>\n<h2>The impact you’ll make by joining us</h2>\n<h3>Within 1 month you’ll:</h3>\n<ul>\n<li>Complete our onboarding process - which will help you ramp up on our company, vision, product, key objectives, and how your role will contribute to all of those!</li>\n<li>Dive deep into our product development process and understand how we go from concept to design to implementation</li>\n<li>Learn our technical stack and apply development patterns throughout your work</li>\n<li>Ship your first small feature to our customers</li>\n<li>Join our customer outreach program - including sitting in on your first set of live conversations with existing customers.</li>\n</ul>\n<h3>Within 3 months you’ll:</h3>\n<ul>\n<li>Assume ownership of a quarterly roadmap project, which will enable you to drive the development of a key piece of functionality for our customers</li>\n<li>Drive timely resolution of customer issues, in coordination with the customer success and implementation teams.</li>\n<li>Have made a visible impact on the product for all 4Degrees users</li>\n</ul>\n<h3>Within 6 months you’ll:</h3>\n<ul>\n<li>Reliably ship full features to our customers and for internal team use</li>\n<li>Understand the product at scale and be able to provide input to improve our technical systems and tools</li>\n<li>Be comfortable navigating most of our stack and infrastructure</li>\n<li>Participate in interviewing and hiring, as a way to influence team growth and how our values inform our culture</li>\n</ul>\n<h3>Within 1-2 years, you’ll:</h3>\n<ul>\n<li>Be responsible for the planning, scoping, design, and implementation of new features</li>\n<li>Champion future engineering initiatives</li>\n<li>Help build and shape the future of engineering at 4Degrees</li>\n</ul>\n<h2>About you</h2>\n<ul>\n<li>Excited about the 4Degrees mission and believes in our core values</li>\n<li>Thrives in a fast-paced environment, and is comfortable with experimentation and risk-taking</li>\n<li>Driven by the opportunity to create impact, and takes full ownership of achieving personal and team objectives</li>\n<li>Motivated to explore the potential for technology to augment people’s ability to form and strengthen professional relationships</li>\n<li>Challenges existing industry best practices and takes inspiration from disparate sources to build a groundbreaking product</li>\n<li>Collaborative mindset - recognizing that most great outcomes are accomplished by teams, not individuals</li>\n</ul>\n<h2>Skills you’ll need</h2>\n<ul>\n<li>Proficiency with back-end programming (Python preferred, but we can train you if you're good with Ruby, Node, PHP, etc.)</li>\n<li>Proficiency with front-end programming in vanilla languages (Javascript, HTML, CSS)</li>\n<li>Comfort with plain SQL and an ORM</li>\n</ul>\n<h2>We’d be really excited if you are</h2>\n<ul>\n<li>Experienced with mobile development, particularly using React Native</li>\n<li>Experienced with the Flask web framework</li>\n<li>Experienced with machine learning and/or statistical analysis</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Competitive cash+equity compensation based on level of capability</li>\n<li>Unlimited PTO (min. 2 weeks, avg. 3-4)</li>\n<li>Unlimited paid sick leave (mandatory for infectious diseases)</li>\n<li>Employer group health insurance, subsidized 75% by company</li>\n<li>Annual professional development stipend</li>\n<li>Commuter benefits</li>\n</ul>\n",
      "how_to_apply": "<p>Send over a quick note with your resume and thoughts on why this role is exciting to you to <a href=\"mailto:talent@4degrees.ai\">talent@4degrees.ai</a>.</p>\n<p>Our values are critical to us; in your email, please also talk a bit about how these values resonate with you.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8f5bc28f1b7b3497630bd77c9f90d4268440bf6a/4d-logo-purple-flat-square.png"
    },
    {
      "id": "b29d72a6-f2dd-4e77-8ab9-93d58c21aa8e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/b29d72a6-f2dd-4e77-8ab9-93d58c21aa8e",
      "created_at": "Thu Apr 15 11:23:13 UTC 2021",
      "company": "be+ GmbH",
      "company_url": "https://www.beplus.de/",
      "location": "Schwabach",
      "title": "Frontend-Developer (w/m/d)",
      "description": "<p>Wir sind eine Truppe von 11 Frauen &amp; Männern zwischen 23 &amp; 53 Jahren, die seit Februar 2020 gemeinsam ein Produkt bauen, das für Unternehmen im War for Talents einen entscheidenden Unterschied machen kann: wir entwickeln eine cloudbasierte Plattform, um die Benefits eines Unternehmens für alle easy nutzbar zu machen. Warum wir das machen? Weil wir 2 Sachen kacke finden: Wenn Mitarbeiter<em>innen sich nicht wertgeschätzt fühlen &amp; die Investitionen der Unternehmer</em>innen in ihre Belegschaft irgendwie nicht richtig ankommen. Das wollen wir gemeinsam mit Dir ändern.</p>\n<p><strong>Das machst du</strong></p>\n<p>Du entwickelst  &amp; setzt gemeinsam mit unserem Lead-Entwickler Viktor Oberflächen um, die unsere User täglich nutzen. Für die geile Optik von be+ arbeitet ihr mit unserem obersten Produktentwickler Robin zusammen. Euch stehen dafür modernste Technologien, wie cloudbasierte Microservice-Architekturen, REST APIs, reaktives Angular, Spring Boot, Docker &amp; Kubernetes zur Verfügung. Ihr seid dabei eigenverantwortlich unterwegs &amp; habt ein Maß an Gestaltungsfreiheit, das keine Wünsche übrig lässt.</p>\n<p>Kurz &amp; Knapp</p>\n<ul>\n<li>technische Konzeption &amp; Entwicklung von Responsive Web-Apps mit Angular</li>\n<li>Konzeption &amp; Weiterentwicklung bestehender Frontend-Architekturen</li>\n<li>Entwicklungsvorschläge zur User Experience einbringen &amp; umsetzen</li>\n</ul>\n<p><strong>Das brauchst du</strong></p>\n<ul>\n<li>mindestens 3 Jahre Praxiserfahrung in HTML, CSS/SASS, JavaScript sowie dem JS-Framework Angular</li>\n<li>Basiskenntnisse in Java, Docker &amp; REST</li>\n<li>Erfahrung mit agilen Entwicklungsmethoden, die wir auch für unsere Organisation nutzen können</li>\n<li>sehr gute Deutsch- &amp; Englischkenntnisse</li>\n<li>Affinität zur Gestaltungsfreiheit in Verbindung mit der Eigenschaft, eigenverantwortlich zu handeln</li>\n<li>das Mindset von „together is better“</li>\n<li>Offenheit für das Arbeiten in einem sich entwickelnden Umfeld</li>\n</ul>\n<p><strong>Das bekommst du</strong></p>\n<ul>\n<li>gutes Gehalt, obwohl wir ein Start Up sind</li>\n<li>30 Tage Urlaub im Jahr</li>\n<li>deinen Spirit bei be+ einfließen lassen</li>\n<li>freie Gestaltung Deiner Arbeitszeit</li>\n<li>freie Auswahl Deiner Technik</li>\n<li>erstklassige Tipps für Deine Altersvorsorge durch unsere Vorsorgeexperten im Team</li>\n<li>Remote Work</li>\n<li>aus der Komfortzone gelockt werden &amp; merken, zu welchen geilen Sachen Du fähig bist</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/e77ac6eb6369e7a5bb52fe9e4cb6316d5cbf1d33/68747470733a2f2f742e676f686972696e672e636f6d2f682f30653233373832366637376161373531646532326666373336633564653638646631376163306163323261363633316364633432616332316361323562623136\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/55458843c665bddba94891e0a5cddf6c9e3caa8dfac50eb7e65ca8ba7565f489\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dfd8c9105d72fb2514e475eb08ec780f3ae7c30c/be+%20GmbH.jpeg"
    },
    {
      "id": "9c0f1e52-7e55-4982-b3e4-ec646493b92c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9c0f1e52-7e55-4982-b3e4-ec646493b92c",
      "created_at": "Wed Apr 14 20:55:10 UTC 2021",
      "company": "Paysafe",
      "company_url": "http://www.paysafe.com",
      "location": "Atlanta, Georgia",
      "title": "Senior Software Engineer iGaming",
      "description": "<p>About Paysafe\nPaysafe Limited (“Paysafe”) (NYSE:PSFE) (PSFE.WS) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, and online cash solutions.</p>\n<p>With over 20 years of online payment experience, an annualized transactional volume of US $92 billion in 2020, and approximately 3,400 employees located in 12+ global locations, Paysafe connects businesses and consumers across 70 payment types in over 40 currencies around the world. Delivered through an integrated platform, Paysafe solutions are geared toward mobile-initiated transactions, real-time analytics and the convergence between brick-and-mortar and online payments. Further information is available at <a href=\"http://www.paysafe.com\">www.paysafe.com</a></p>\n<p>Are you ready to make an impact? Join our team that is inspired by a unified vision and propelled by passion.</p>\n<p>Paysafe is a leading global provider of payment solutions with deep experience across a wide variety of specialized markets, including iGaming. As U.S. states continue to deregulate iGaming, Paysafe is well positioned to be the market leader.</p>\n<p>To help us fuel accelerated growth, through both our payment gateway and gaming consumers, we are looking for an experienced full-stack Senior Software Engineer.</p>\n<p>Your responsibilities would include:</p>\n<p>-Working on an agile team to design, develop, and maintain systems across the platform</p>\n<p>-Writing high-quality, performant, secure, and testable code</p>\n<p>-Helping to drive the team forward in engineering disciplines and practices</p>\n<p>-Giving and receiving candid code review feedback to maintain high quality code</p>\n<p>You have:</p>\n<p>-7+ years of experience design and development experience in Java, Spring, Angular, MVC, etc.</p>\n<p>-Exposure to working in agile product development mode using concepts such as micro-services-based development and deployments</p>\n<p>-Previous experience in a Payment/e-commerce industry</p>\n<p>-Develop large scale online transaction systems</p>\n<p>-Experience with SOA &amp; microservice architectures</p>\n<p>-API design, development, and integration experience</p>\n<p>-A bachelor’s degree or higher in a technical field or equivalent experience</p>\n<p>Nice to have:</p>\n<p>-Experience dealing with mission-critical production issues in terms of data volumes and speed of data</p>\n<p>-4+ years of experience in a product development organization</p>\n<p>Our culture values humility, high trust &amp; autonomy, a desire for excellence and meeting commitments, strong team cohesion, a sense of urgency, a desire to learn, pragmatically pushing boundaries, and accomplishing goals that have a direct business impact.  We encourage you to apply even if your experience does not exactly align as we value diverse thoughts, experience, and backgrounds.</p>\n<p>Equal Employment Opportunity\nPaysafe provides equal employment opportunities to all employees, and applicants for employment, and prohibits discrimination of any type with regard to ethnicity, religion, age, sex, national origin, disability status, sexual orientation, gender identity or expression, or any other protected characteristics. This policy applies to all terms and conditions of recruitment and employment. If you need any reasonable adjustments, please let us know. We will be happy to help and look forward to hearing from you</p>\n",
      "how_to_apply": "<p><a href=\"https://career5.successfactors.eu/sfcareer/jobreqcareer?jobId=40461&amp;company=26684T1\">https://career5.successfactors.eu/sfcareer/jobreqcareer?jobId=40461&amp;company=26684T1</a></p>\n",
      "company_logo": null
    },
    {
      "id": "dffc7d23-b3cb-4b50-a0a8-4a2dd09ba557",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/dffc7d23-b3cb-4b50-a0a8-4a2dd09ba557",
      "created_at": "Wed Apr 14 21:03:22 UTC 2021",
      "company": "Paysafe",
      "company_url": "http://www.paysafe.com",
      "location": "Atlanta, Georgia",
      "title": "Senior Software Engineer",
      "description": "<p>About Paysafe\nPaysafe Limited (“Paysafe”) (NYSE:PSFE) (PSFE.WS) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, and online cash solutions.</p>\n<p>With over 20 years of online payment experience, an annualized transactional volume of US $92 billion in 2020, and approximately 3,400 employees located in 12+ global locations, Paysafe connects businesses and consumers across 70 payment types in over 40 currencies around the world. Delivered through an integrated platform, Paysafe solutions are geared toward mobile-initiated transactions, real-time analytics and the convergence between brick-and-mortar and online payments.  Further information is available at <a href=\"http://www.paysafe.com\">www.paysafe.com</a></p>\n<p>Are you ready to make an impact? Join our team that is inspired by a unified vision and propelled by passion. We are remote currently and offer a very flexible work arrangement when we open up!</p>\n<p>Paysafe Group (Paysafe) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, card issuing and online cash solutions.</p>\n<p>We are looking for a full-stack Senior Software Engineer to join the US Acquiring team, based in Atlanta, as a part of the Global Payment Processing unit of Paysafe.  The US Acquiring teams owns the platform that includes merchant onboarding, customer portal, back office, and multiple customer APIs and backend services.  This team is responsible for building the product suite capabilities used by over 100K customers as well as building and enhancing connections to backend payment processors, gateways, vendors, and APIs.</p>\n<p>Your responsibilities would include:</p>\n<p>-Working on an agile team to design, develop, and maintain systems across the platform</p>\n<p>-Writing high-quality, performant, secure, and testable code</p>\n<p>-Helping to drive the team forward in engineering disciplines and practices</p>\n<p>-Giving and receiving candid code review feedback to maintain high quality code</p>\n<p>You have:</p>\n<p>-7+ years of experience developing web applications, APIs, and backend systems using C#, ASP.net and the wider Microsoft development platform and web application frameworks</p>\n<p>-Experience with SOA &amp; microservice architectures</p>\n<p>-API design, development, and integration experience</p>\n<p>-A bachelor’s degree or higher in a technical field or equivalent experience</p>\n<p>Nice to have:</p>\n<p>-Experience in building cloud-native solutions in Azure/AWS including both IaaS and PaaS</p>\n<p>-Knowledge of event driven &amp; distributed architectures</p>\n<p>-Previous experience in the payment processing industry</p>\n<p>Our culture values humility, high trust &amp; autonomy, a desire for excellence and meeting commitments, tight team cohesion, a sense of urgency, a desire to learn, pragmatically pushing boundaries, and accomplishing goals that have a direct business impact.  We encourage you to apply even if your experience does not exactly align as we value diverse thoughts, experience, and backgrounds.</p>\n<p>Equal Employment Opportunity\nPaysafe provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p>\n",
      "how_to_apply": "<p><a href=\"https://career5.successfactors.eu/career?career_ns=job_listing&amp;company=26684T1&amp;navBarLevel=JOB_SEARCH&amp;rcm_site_locale=en_GB&amp;career_job_req_id=40461\">https://career5.successfactors.eu/career?career_ns=job_listing&amp;company=26684T1&amp;navBarLevel=JOB_SEARCH&amp;rcm_site_locale=en_GB&amp;career_job_req_id=40461</a></p>\n",
      "company_logo": null
    },
    {
      "id": "0a0562e1-f9d8-4a43-bec2-9d5ea4ef2eca",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0a0562e1-f9d8-4a43-bec2-9d5ea4ef2eca",
      "created_at": "Wed Apr 14 21:07:45 UTC 2021",
      "company": "Paysafe",
      "company_url": "http://www.paysafe.com",
      "location": "Atlanta, Georgia",
      "title": "Senior Software Quality Engineer",
      "description": "<p>About Paysafe\nPaysafe Limited (“Paysafe”) (NYSE:PSFE) (PSFE.WS) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, and online cash solutions.</p>\n<p>With over 20 years of online payment experience, an annualized transactional volume of US $92 billion in 2020, and approximately 3,400 employees located in 12+ global locations, Paysafe connects businesses and consumers across 70 payment types in over 40 currencies around the world. Delivered through an integrated platform, Paysafe solutions are geared toward mobile-initiated transactions, real-time analytics and the convergence between brick-and-mortar and online payments.  Further information is available at <a href=\"http://www.paysafe.com\">www.paysafe.com</a>.</p>\n<p>Are you ready to make an impact? Join our team that is inspired by a unified vision and propelled by passion.</p>\n<p>Paysafe Group (Paysafe) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, card issuing and online cash solutions.</p>\n<p>We are looking for a Senior Software Quality Engineer to join the US Acquiring team, based out of Atlanta, as a part of the Global Payment Processing unit of Paysafe.  The US Acquiring teams owns the platform that includes merchant onboarding, customer portal, back office, and multiple customer APIs and backend services.  This team is responsible for building the product suite capabilities used by over 100K customers as well as building and enhancing connections to backend payment processors, gateways, vendors, and APIs.</p>\n<p>Your responsibilities include:</p>\n<p>-Working on an agile team to develop automated test scripts as well perform manual testing</p>\n<p>-Helping to drive the team forward in quality engineering disciplines and practices</p>\n<p>-Analyzing business requirements, developing, and maintaining automated test cases that ensure adequate test coverage for Web applications, APIs, and backend services</p>\n<p>-Facilitating and prioritizing resolution of defects, and tracking through retest to closure</p>\n<p>-Collaborating with team to help ensure highest standards of quality at all stages of development life cycle</p>\n<p>-Defining and tracking quality KPIs and metrics</p>\n<p>You have:</p>\n<p>-7+ years of experience testing web applications, APIs, and backend systems</p>\n<p>-3+ years of hands-on experience with test automation tools like Selenium</p>\n<p>-Strong practical experience in implementing tests that require an understanding of application logic</p>\n<p>-Experience working with relational databases and strong knowledge in SQL scripts</p>\n<p>-Excellent problem solving, analytical skills and technical troubleshooting skills</p>\n<p>-A bachelor’s degree or higher in a technical field or equivalent experience</p>\n<p>Nice to have:</p>\n<p>-Previous experience in the payment processing industry</p>\n<p>Our culture values humility, high trust &amp; autonomy, a desire for excellence and meeting commitments, tight team cohesion, a sense of urgency, a desire to learn, pragmatically pushing boundaries, and accomplishing goals that have a direct business impact.  We encourage you to apply even if your experience does not exactly align as we value diverse thoughts, experience, and backgrounds.</p>\n<p>Equal Employment Opportunity\nPaysafe provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p>\n",
      "how_to_apply": "<p><a href=\"https://career5.successfactors.eu/career?career_ns=job_listing&amp;company=26684T1&amp;navBarLevel=JOB_SEARCH&amp;rcm_site_locale=en_GB&amp;career_job_req_id=40477\">https://career5.successfactors.eu/career?career_ns=job_listing&amp;company=26684T1&amp;navBarLevel=JOB_SEARCH&amp;rcm_site_locale=en_GB&amp;career_job_req_id=40477</a></p>\n",
      "company_logo": null
    },
    {
      "id": "118ce060-712e-45e4-a3a5-e98c3d7941a1",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/118ce060-712e-45e4-a3a5-e98c3d7941a1",
      "created_at": "Wed Apr 14 21:13:14 UTC 2021",
      "company": "Paysafe",
      "company_url": "http://www.paysafe.com",
      "location": "Atlanta, Georgia",
      "title": "Software Engineering Manager",
      "description": "<p>About Paysafe\nPaysafe Limited (“Paysafe”) (NYSE:PSFE) (PSFE.WS) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, and online cash solutions.</p>\n<p>With over 20 years of online payment experience, an annualized transactional volume of US $92 billion in 2020, and approximately 3,400 employees located in 12+ global locations, Paysafe connects businesses and consumers across 70 payment types in over 40 currencies around the world. Delivered through an integrated platform, Paysafe solutions are geared toward mobile-initiated transactions, real-time analytics and the convergence between brick-and-mortar and online payments.  Further information is available at <a href=\"http://www.paysafe.com\">www.paysafe.com</a></p>\n<p>Are you ready to make an impact? Join our team that is inspired by a unified vision and propelled by passion.</p>\n<p>Paysafe Group (Paysafe) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, card issuing and online cash solutions.</p>\n<p>We are looking for a Software Engineering Manager to join the US Acquiring team, based in Atlanta, as a part of the Global Payment Processing unit of Paysafe.  The US Acquiring teams owns the platform that includes merchant onboarding, customer portal, back office, and multiple customer APIs and backend services.  This team is responsible for building the product suite capabilities used by over 100K customers as well as building and enhancing connections to backend payment processors, gateways, vendors, and APIs.</p>\n<p>As a leader of Software Engineering, you will lead a team of software development engineers to deliver high-powered, cutting-edge solutions. You will work collaboratively with Product Owners, vendors, and business stakeholders to architect and create enterprise-level technology solutions that are both scalable and robust. The ideal candidate will be a strong leader, have full-stack technical knowledge and the ability to work in a fast-paced agile environment.</p>\n<p>Your responsibilities would include:</p>\n<p>-Developing the engineering team by honing technical skills and advancing their career</p>\n<p>-Leading and owning outcomes based on commitments</p>\n<p>-Empowering the engineering team to deliver consistently with high quality</p>\n<p>-Partnering with stakeholders, product leaders, and other engineering teams</p>\n<p>-Guiding the team forward in engineering disciplines and practices</p>\n<p>-Advocating and advancing modern, agile development practices</p>\n<p>You have:</p>\n<p>-Bachelor's degree in Computer Science, Information Systems or a related field of study</p>\n<p>-8 plus years of related software development experience</p>\n<p>-2+ years of leadership experience leading direct reports with agile development practices</p>\n<p>-A track record for leading high performing engineering teams</p>\n<p>-A deep desire to see people thrive in a culture of trust, accountability, and excellence</p>\n<p>-Technical experience building systems using the Microsoft technology platform as well as web application frameworks</p>\n<p>-The technical acumen to help engineers solve problems and design solutions</p>\n<p>-Experience and practices to help engineers grow individually and as a team by leading by example, aligning focus, and executing on commitments</p>\n<p>-Strong and effective communication skills</p>\n<p>Nice to have:</p>\n<p>-Experience in building cloud-native solutions in Azure/AWS</p>\n<p>-Knowledge of event driven, distributed, and microservices architectures</p>\n<p>-Previous experience in the payment processing industry</p>\n<p>Include in your cover letter:</p>\n<p>-Why you decided to become a manager and what you enjoy most about the role</p>\n<p>-Your approach to engineering management and leadership</p>\n<p>-One of the most rewarding experiences you have had as a manager</p>\n<p>Our culture values humility, high trust &amp; autonomy, excellence in technical delivery, strong team cohesion, a focused sense of urgency, a desire to learn, pragmatically pushing boundaries, and accomplishing goals that have a direct business impact.  We encourage you to apply even if your experience does not exactly align as we value diverse thoughts, experience, and backgrounds.</p>\n<p>Equal Employment Opportunity\nPaysafe provides equal employment opportunities to all employees, and applicants for employment, and prohibits discrimination of any type with regard to ethnicity, religion, age, sex, national origin, disability status, sexual orientation, gender identity or expression, or any other protected characteristics. This policy applies to all terms and conditions of recruitment and employment.  If you need any reasonable adjustments, please let us know.  We will be happy to help and look forward to hearing from you.</p>\n",
      "how_to_apply": "<p><a href=\"https://career5.successfactors.eu/sfcareer/jobreqcareer?jobId=40479&amp;company=26684T1\">https://career5.successfactors.eu/sfcareer/jobreqcareer?jobId=40479&amp;company=26684T1</a></p>\n",
      "company_logo": null
    },
    {
      "id": "2f305dec-1a30-42a3-bd7a-df4b96efda6d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2f305dec-1a30-42a3-bd7a-df4b96efda6d",
      "created_at": "Wed Apr 14 21:05:15 UTC 2021",
      "company": "eddii",
      "company_url": "http:",
      "location": "New York",
      "title": "Exceptional full stack mobile developer with experience in React Native (iOS/Android)",
      "description": "<p>Eddii.inc\nLocation: New York, NY\nJob type: Full-time\nSalary: Competitive</p>\n<p>Position title: Software Engineer</p>\n<p>About eddii</p>\n<p>eddii is a digital health startup based in New York that provides an AI-enabled app for people living with chronic conditions to track their health. Through gamification and witty conversation, eddii becomes a smart, virtual health buddy, providing users with health reports and collectible in-app items.</p>\n<p>Responsibilities</p>\n<ul>\n<li>Develop, test and deploy software (native, hybrid applications, APIs)</li>\n<li>Manage individual priorities, deadlines and deliverables</li>\n<li>Work with UX/UI designer and animation team to implement full-stack mobile software</li>\n<li>Recommend and deliver strategic technical solutions to match business requirements and product life cycle deliverables</li>\n<li>Ensure software is scalable as the business grows</li>\n</ul>\n<p>Requirements</p>\n<p>Culture and Teamwork</p>\n<ul>\n<li>Ability to work in a startup culture and comfortable with change</li>\n<li>Passion for Eddii’s vision and product</li>\n<li>Strong communication skills - ability to communicate effectively with members of the team</li>\n<li>Passionate about creating quality products that will solve problems and help others</li>\n<li>Desire to learn and share new practices</li>\n</ul>\n<p>Technical</p>\n<ul>\n<li>2+ years of mobile programming in React Native</li>\n<li>Highly skilled in Javascript</li>\n<li>Bachelor’s degree in computer science or other technical degree</li>\n</ul>\n<p>Opportunity</p>\n<ul>\n<li>Direct interaction with the founder, team, and advisors</li>\n<li>Exposure to the entrepreneurial ecosystem in New York and Boston</li>\n<li>Direct impact on the company and its digital infrastructure</li>\n<li>Fast-paced learning and energetic team</li>\n</ul>\n",
      "how_to_apply": "<p>Please email your resume to <a href=\"mailto:farhaneh@eddiihealth.com\">farhaneh@eddiihealth.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7938e9c9758f0162da802b7b5a88940677536ce0/Eddii_logo_orange%20(2)-1.png"
    },
    {
      "id": "e5819a13-3f65-46d5-93f5-0cd5f2e2b772",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e5819a13-3f65-46d5-93f5-0cd5f2e2b772",
      "created_at": "Wed Apr 14 18:37:31 UTC 2021",
      "company": "Penske Truck Leasing",
      "company_url": "https://penske.jobs",
      "location": "Tampa, FL",
      "title": "Software Development Manager, Mobile (iOS and Android)",
      "description": "<p><strong>What You Will Be Doing:</strong></p>\n<p>As a Penske Software Development Manager, Mobile, you will lead a team of IT associates in providing state-of-the-art technology solutions that support our suite of mobile applications. You will be responsible for the planning, management, and execution of our mobile development strategies. In this position, you will manage the internal development team and work with our internal departments and marketing group, as well as external vendors, on our customer-facing mobile applications.</p>\n<p>In addition to the qualifications listed below, ideal candidates will have at least 10 years of broad-based IT experience with at least 5 years of experience in mobile development using the latest techniques and technologies. Working knowledge of agile methods is a plus.</p>\n<p>This position sits out of our IT Center in Tampa, FL.</p>\n<p><strong>Penske Responsibilities:</strong></p>\n<ul>\n<li>Provide direction and day-to-day management of development staff to ensure that any roadblocks are removed, and developers/teams are successfully moving forward</li>\n<li>Ensure that development projects are prioritized, scheduled, and completed according to business needs</li>\n<li>Foster collaboration by leading regular meetings and communicating with process owners, product managers, agile teams, IT groups, and other stakeholders to negotiate priority and timelines while managing resources required to get the job done</li>\n<li>Hire new associates, guide, and mentor their career development, including conducting performance reviews</li>\n<li>Ensure on-time and defect-free delivery of applications in accordance with Penske standards</li>\n<li>Ensure technical leads follow the Penske Development Process (PDP) and maintain management reporting</li>\n<li>Act as the point of contact for multiple systems, agile teams, and cross-functional projects</li>\n<li>Identify new technologies to support product line development.</li>\n<li>Other projects, teams, and responsibilities as assigned by manager</li>\n</ul>\n<p><strong>Penske Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Math or Information Systems or equivalent development experience</li>\n<li>10+ years overall IT experience</li>\n<li>3+ years leading/supervising multiple IT projects through the full SDLC (Software Development Life Cycle) including prior work defining complex application architecture and integration with multi-tiered systems</li>\n<li>Significant (5+ years) functional experience/working knowledge of the following or similar Technologies: Swift/Objective C for iOS, Kotlin/Java for Android, OOT (Object-Oriented Design, Programing, Architecture), Relational DB’s, SQL, Web Services, JSON, Typescript, NodeJS, Spring Framework, Swagger, Postman</li>\n<li>Experience with Mobile Metrics, Firebase, API Gateways, UML, Splunk, Big Data, Cloud, iOS/Android native mobile development, and the Atlassian toolset is a plus.</li>\n<li>Experience in leading teams in custom development, evaluating, selecting, integrating and implementing application software (package) solutions when appropriate</li>\n<li>Experience prioritizing technology needs within set budget requirements Strong leadership and people management skills with the ability to build and grow teams of highly motivated, deeply technical, productive software engineers preferably in an Agile environment</li>\n<li>Strong interpersonal and decision-making skills</li>\n<li>Ability to communicate highly technical concepts in clear/concise manner to non-technical individuals</li>\n<li>Knowledge of project management methods and tools</li>\n<li>Regular, predictable, full attendance is an essential function of the job</li>\n<li>Willingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required.</li>\n</ul>\n<p><strong>Physical Requirements:</strong></p>\n<ul>\n<li>The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li>\n<li>The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines.</li>\n<li>While performing the duties of this job, the associate may be required to stand, walk, and sit.  The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms.  The associate must be able to occasionally lift and/or move up to 25lbs/12kg.</li>\n<li>Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus.</li>\n</ul>\n<p><strong>Penske is an Equal Opportunity Employer.</strong></p>\n<p><strong>About Penske Truck Leasing</strong>\nPenske Truck Leasing Co., L.P., headquartered in Reading, Pennsylvania, is a partnership of Penske Corporation, Penske Automotive Group and Mitsui &amp; Co., Ltd. A leading global transportation services provider, Penske operates a premier fleet of vehicles and serves its customers from locations in North America, South America, Europe, Australia, and Asia. Penske’s product lines include full-service truck leasing, contract maintenance, commercial and consumer truck rentals, used truck sales, transportation and warehousing management and supply chain management solutions. Visit <a href=\"http://www.GoPenske.com\">www.GoPenske.com</a> to learn more.</p>\n<p><a href=\"https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101862&amp;src=JB-12120\">Click Here to Apply</a></p>\n",
      "how_to_apply": "<p>Click the link to apply: <a href=\"https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101862&amp;src=JB-12120\">https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101862&amp;src=JB-12120</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2FoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7293d6b32361cd0ac9a5163eb4571381452bbeca/1200px-Penske_Logo.svg.png"
    },
    {
      "id": "d75a51be-d35e-4ce0-ab04-5b59a366628d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d75a51be-d35e-4ce0-ab04-5b59a366628d",
      "created_at": "Wed Apr 14 18:27:58 UTC 2021",
      "company": "Penske Truck Leasing",
      "company_url": "https://penske.jobs",
      "location": "Reading, PA",
      "title": "Manager of IT Engineering - Cloud Systems",
      "description": "<p><strong>What You Will Be Doing:</strong></p>\n<p>As a Penske Manager of IT Engineering – Cloud Systems You will be working with and innovating Penske's cutting-edge Cloud environment with a team of industry-leading experts. You will lead the Cloud Engineering teams and support staff through a diverse range of projects. You will be responsible for the reliability, performance, recoverability, and security of the corporate Cloud environment and the underlying team that manages and supports the environment.  You will be keeping Penske updated with the latest technology and knowledge from the industry and implementing these changes across the whole company.</p>\n<p>This position sits out of our corporate headquarters in Reading, PA.</p>\n<p><strong>Penske Responsibilities:</strong></p>\n<ul>\n<li>Maintain and recommend information technology strategies, policies, and procedures</li>\n<li>Manage a staff, including recruiting, selecting, onboarding, training, coaching, and supervising associate performance</li>\n<li>Own for team results of enterprise projects by coordinating resources</li>\n<li>Enable faster and smarter business processes and implement analytics for meaningful insights</li>\n<li>Maintain reliability, performance, recoverability, and security of the corporate Cloud environment</li>\n<li>Oversee daily operations of design, configuration, implementation, support, troubleshooting, maintenance, performance monitoring and the development of specialized procedures relating to the use of the corporate cloud computing environment</li>\n<li>Work closely with technical staff on best practice development and implementation.</li>\n<li>Ensure the functional, cost-effectiveness and timely support of systems on a 24x7 basis</li>\n<li>Plan for growth and provide projections for business plan</li>\n<li>Assess need for any system reconfigurations and execute them if required</li>\n<li>Research and implement new open-source and commercial tools, technologies and methodologies</li>\n<li>Serve as thought leader and final decision maker able to drive the team to conclusions regarding technical solutions</li>\n</ul>\n<p><strong>Penske Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Information Technology, Computer Engineering or related field required. If no degree, then at least 5 years of information technology management experience required</li>\n<li>2+ years of supervisory or team leadership experience highly preferred</li>\n<li>5+ years leading/supervising multiple enterprise-level IT Infrastructure projects</li>\n<li>Expertise in creating, analyzing, and repairing large-scale distributed systems</li>\n<li>Expertise in systems infrastructure and architecture, including:\nLinux &amp;AWS knowledge (AWS VPCs, Availability Zones, Security Groups, ELB/ALB, etc.)\nOpen source and purchased middleware products such as webservers, application servers, database servers, API management gateways, single-sign-on software, identity management software, ETL software, collaboration software, etc.</li>\n<li>Database technologies such as Gemfire, Greenplum and MySQL</li>\n<li>Strong problem solving and communication skills required</li>\n<li>Experience running and maintaining a 24x7 production environment</li>\n<li>Regular, predictable, full attendance is an essential function of the job</li>\n<li>Willingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required</li>\n</ul>\n<p><strong>Physical Requirements:</strong></p>\n<ul>\n<li>The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li>\n<li>The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines.</li>\n<li>While performing the duties of this job, the associate may be required to stand, walk, and sit.  The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms.  The associate must be able to occasionally lift and/or move up to 25lbs/12kg.</li>\n<li>Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus.</li>\n</ul>\n<p><strong>Penske is an Equal Opportunity Employer.</strong></p>\n<p><strong>About Penske Truck Leasing</strong></p>\n<p>Penske Truck Leasing Co., L.P., headquartered in Reading, Pennsylvania, is a partnership of Penske Corporation, Penske Automotive Group and Mitsui &amp; Co., Ltd. A leading global transportation services provider, Penske operates a premier fleet of vehicles and serves its customers from locations in North America, South America, Europe, Australia, and Asia. Penske’s product lines include full-service truck leasing, contract maintenance, commercial and consumer truck rentals, used truck sales, transportation and warehousing management and supply chain management solutions. Visit <a href=\"http://www.GoPenske.com\">www.GoPenske.com</a> to learn more.</p>\n",
      "how_to_apply": "<p>Click the link to apply: <a href=\"https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101803&amp;src=JB-12120\">https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101803&amp;src=JB-12120</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0doIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--59f3071ddabca536a46cbfa6681f26afdb3e42ba/1200px-Penske_Logo.svg.png"
    },
    {
      "id": "55d7d98f-0270-4693-83b6-c368e694a82f",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/55d7d98f-0270-4693-83b6-c368e694a82f",
      "created_at": "Wed Apr 14 18:15:36 UTC 2021",
      "company": "Penske Truck Leasing",
      "company_url": "https://penske.jobs",
      "location": "Reading, PA",
      "title": "Director of Connected Fleet - IT",
      "description": "<p><strong>What You Will Be Doing:</strong></p>\n<p>As Director of Connected Fleet IT you will oversee multiple projects and initiatives geared towards pulling sensor data from Penske’s fleet of vehicles and pushing it into Penske’s data platform to support various operational and analytical use cases. You will be working very closely with various data providers, IoT device suppliers, data engineering, data platform teams, product managers, Cloud Engineering, and various consumer application groups. You will also be jointly responsible for the quality of the incoming data and the exposed data services. In this role, you will lead the Big Data Integration and Services (BDIS) and the associated applications teams. You will also be responsible for talent management (recruiting, onboarding, and career development). This is a high-impact role as the capabilities developed through this program are critical to the success of Penske’s internal and external customers.</p>\n<p>This position sits out of our corporate headquarters in Reading, PA.</p>\n<p><strong>Penske Responsibilities:</strong></p>\n<ul>\n<li>Work closely with various stakeholder groups and partners at mid to Sr. Management level to build and execute upon the program roadmaps</li>\n<li>Oversee enterprise-wide projects and initiatives or several large projects concurrently, assigned from department and client group senior leadership including other IT departments</li>\n<li>Lead and manage multiple global teams of big data developers, architects, QA, project managers, and team leaders to ensure that programs/projects are prioritized, scheduled, and completed according to the business needs</li>\n<li>Responsible for budgeting and tracking costs of various streaming platform components and be involved in vendor negotiations and vendor relationship management</li>\n<li>Understand contractual opportunities and pitfalls including reviewing and providing inputs to technical SOW’s</li>\n<li>Provide strategic input to functional leaders and senior IT management regarding IT needs and opportunities</li>\n<li>Maintain awareness of IoT, Streaming technology, API Management, and Data Servicestrends and know how to leverage them within the organization</li>\n<li>Ensure that the various applications and environments are available and supported as per the SLAs agreed with the business</li>\n<li>Follow IT practices in security, licensing, source code management, incident management, and following architectural standards</li>\n<li>Delegate and assign tasks to onshore and offshore technical resources for projects. Work with the partner leadership and onsite team members to regularly review project requirements, deliverables, and quality</li>\n<li>Ensure the associates lead project scope development and option analysis in an effort to recommend technical solutions to meet customer needs</li>\n<li>Follow the Penske Development Process (PDP) and ensure that all information is captured on time so relevant metrics can be generated. This should include attending relevant tollgates, change control, and deployment discussions.</li>\n<li>Ensure project completion and implementation on time, and ensure all tasks and projects are executed to department quality standards</li>\n<li>Assist in business planning</li>\n<li>Identify skill gap within the teams and layout a robust plan to bridge those gaps</li>\n<li>Build lasting relationships based on mutual respect and trust</li>\n<li>Coach and mentor associates. Develop team members to increase value to the organization</li>\n<li>Foster collaboration among associates and within workgroups</li>\n<li>Reduce complexity in the environment</li>\n<li>Identify future opportunities for system enhancement and value generation</li>\n<li>Use dashboards and metrics to properly prioritize work and ensure milestones on projects are being met</li>\n</ul>\n<p><strong>Penske Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science, Information Systems, or equivalent development experience</li>\n<li>10+ years of leadership experience with responsibility of leading cross-functional teams as well as managing onsite and remote teams of highly skilled technical experts</li>\n<li>3+ years experience leading large enterprise wide programs/projects</li>\n<li>2+ year’ experience of cloud -preferably AWS</li>\n<li>Strong experience with Agile / DevOps approaches or methodologies</li>\n<li>Strong Technical Program Management experience is required</li>\n<li>Proven experience in developing program strategies driving incremental value and repeatable growth through products, services, and capabilities directly tied to IoT data</li>\n<li>Have strong knowledge of Integration technologies like Spring Integration Framework, API Management, Micro-services, and Cloud (preferably AWS)in IoT space, and experience rolling it out as an enterprise solution</li>\n<li>Experience managing cloud platforms taking advantage of cloud capabilities, implementing DevOps and CI/CD</li>\n<li>Expertise in leading the architecture, design &amp; implementation of highly complex data integrations and data services by utilizing technologies such as Spring Boot, Spring Cloud Data Flow, Kafka, Cloud Foundry, API management, Postgres/Timescale, In-memory cache like Gemfire, GreenPlum, mySQL, Aurora, Oracle etc.</li>\n<li>Familiarity with Observability concepts and tools like Wavefront and ELK</li>\n<li>Strong experience in presenting to mid&amp; senior management</li>\n<li>Strong process management capability</li>\n<li>Strong experience in building, coaching, mentoring, and motivating large teams</li>\n<li>Advanced Experience working with business leadership to establish a project/program application development roadmap</li>\n<li>Advanced experience in working with the various IT teams to build and implement a scalable architecture for relevant software solutions</li>\n<li>Experience implementing and managing Data Science and Advanced Analytics related projects including managing teams and technical resources, managing priorities, and defining measurable milestones</li>\n<li>Demonstrated ability to adapt to change and viewing change as an opportunity to add value to the organization</li>\n<li>Demonstrated capability to break technical solutions into logical units and have the ability to use models to show information or data flow</li>\n<li>Full fluency and expert-level knowledge in systems/languages applicable to the role</li>\n<li>Full understanding of system development lifecycle, methodologies and standards</li>\n<li>Green Belt, Black Belt, Lean, or PMP certification preferred but not required.</li>\n<li>Regular, predictable, full attendance is an essential function of the job</li>\n<li>Willingness to travel as necessary, work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required.</li>\n</ul>\n<p><strong>Physical Requirements:</strong></p>\n<ul>\n<li>The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li>\n<li>The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines.</li>\n<li>While performing the duties of this job, the associate may be required to stand, walk, and sit.  The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms.  The associate must be able to occasionally lift and/or move up to 25lbs/12kg.</li>\n<li>Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception, and the ability to adjust focus.</li>\n</ul>\n<p><strong>Penske is an Equal Opportunity Employer.</strong></p>\n<p><strong>About Penske Truck Leasing</strong>\nPenske Truck Leasing Co., L.P., headquartered in Reading, Pennsylvania, is a partnership of Penske Corporation, Penske Automotive Group, and Mitsui &amp; Co., Ltd. A leading global transportation services provider, Penske operates a premier fleet of vehicles and serves its customers from locations in North America, South America, Europe, Australia, and Asia. Penske’s product lines include full-service truck leasing, contract maintenance, commercial and consumer truck rentals, used truck sales, transportation and warehousing management, and supply chain management solutions. Visit <a href=\"http://www.GoPenske.com\">www.GoPenske.com</a> to learn more.</p>\n",
      "how_to_apply": "<p>Click the link to apply: <a href=\"https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101761&amp;src=JB-12120\">https://gopenske.taleo.net/careersection/.penske.ex.jsa.hs/jobdetail.ftl?lang=en&amp;job=2101761&amp;src=JB-12120</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a329c8a278f575d274bfe09dc3d695aee51cbf9f/1200px-Penske_Logo.svg.png"
    },
    {
      "id": "6090721e-686a-45b4-a7aa-933112c3e703",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6090721e-686a-45b4-a7aa-933112c3e703",
      "created_at": "Wed Apr 14 12:30:41 UTC 2021",
      "company": "GEOTAB",
      "company_url": "https://careers.geotab.com/",
      "location": "Greater Toronto Area, Greater Waterloo Area, Ottawa, Montreal, Vancouver, Burnaby",
      "title": "Senior Software Developer ",
      "description": "<p>Who we are</p>\n<p>Geotab is a global leader in IoT and connected transportation and certified “Great Place to Work.” We are a company of diverse and talented individuals who work together to help businesses grow and succeed, and increase the safety and sustainability of our communities.</p>\n<p>Geotab is advancing security, connecting commercial vehicles to the internet and providing web-based analytics to help customers better manage their fleets. Geotab’s open platform and Marketplace, offering hundreds of third-party solution options, allows both small and large businesses to automate operations by integrating vehicle data with their other data assets. Processing billions of data points a day, Geotab leverages data analytics and machine learning to improve productivity, optimize fleets through the reduction of fuel consumption, enhance driver safety and achieve strong compliance to regulatory changes.</p>\n<p>Our team is growing and we’re looking for people who follow their passion, think differently and want to make an impact. Join us for a fulfilling career with opportunities to innovate, great benefits, and our fun and inclusive work culture. Reach your full potential with Geotab. To see what it’s like to be a Geotabber, check out our blog and follow us @InsideGeotab on Instagram, Twitter or Facebook.</p>\n<p>Who you are</p>\n<p>As a Senior Software Developer, you consider yourself a Software Wizard. You are a Solutions Architect and Systems Designer who will settle for nothing less than building highly scalable, highly reliable, and fault tolerant web applications. You develop high level code with attention to system integration and feasibility. You are able to create representations for functions and user interfaces. You will ensure that the software meets all requirements of design, quality, security, extensibility etc. You have the ability to take the solution all the way to the finish line. You are also a coach and always provide technical guidance and mentorship to other developers and engineers in the team.</p>\n<p>What you'll do</p>\n<p>Your job is to be part of a team who builds a state of the art telematics platform, that makes sense of the data collected by our custom built hardware. We receive detailed data and metrics for millions of vehicles globally, which is processed and interpreted to create actionable information for our customers. Your key area of responsibility will be to contribute to a dynamically scalable system by leading architecture, design, and end-to-end development of key features in our applications. You will write high performance code (C#, Java, Python, or Rust) and SQL queries to process and store this information in real-time.</p>\n<p>We have adopted a hybrid working model in response to COVID-19. Eligible candidates must be able to travel to one of our Geotab offices in the following locations: Oakville, ON, Toronto,ON, Waterloo, ON, Burnaby, BC or Laval, QC.</p>\n<p>How you'll make an impact\nDesign, build, and maintain efficient, reusable, reliable code to develop high throughput, performance critical, and scalable applications.</p>\n<p>Translate application storyboards and use cases into functional applications.</p>\n<p>Ensure the best possible performance, quality, and responsiveness of applications.</p>\n<p>Perform Test Driven Development (TDD), take part in peer code reviews, ensuring coding standards are followed, looking for logic errors and other bugs.</p>\n<p>Lead and contribute to system design discussions while acting as a mentor and SME to other Junior developers.</p>\n<p>What you'll bring to this role\n5+ years of demonstrated experience of coding at a high competency, enterprise level with low tolerance to error.</p>\n<p>Solid understanding of object-orientated or functional programming in C#, Java, or Python.</p>\n<p>Knowledge of front-end languages and libraries (e.g. HTML/CSS, JavaScript, XML, ES6, jQuery) and JavaScript frameworks(e.g. Angular, React, Node.js, Vue.js) and experience with UI/UX design.</p>\n<p>Experience with SQL database design, optimization and writing queries.</p>\n<p>Working knowledge of web services including REST and MVC.</p>\n<p>Working knowledge with Git and Jira is preferred.</p>\n<p>Bachelor of Computer Science, Electrical/Software Engineering or other related degree.</p>\n<p>Bonus if you have:Cloud computing experience with GCP (preferred), AWS, or Azure.</p>\n<p>Docker, Kubernetes.</p>\n<p>Messaging queues such as Kafka, RabbitMQ</p>\n<p>Our Tech Stack\nC#</p>\n<p>.NET Core 5.0</p>\n<p>Web services, REST APIs, object-oriented design, unit testing, optimization and multithreaded programming</p>\n<p>PostgreSQL</p>\n<p>Google BigQuery, and Google Cloud Platform</p>\n<p>Docker, Kubernetes</p>\n<p>How we work</p>\n<p>At Geotab, we understand that the world is always changing and that we need to change with it. Geotab has adopted a hybrid model for working, including a flexible work from home program, with the opportunity to work in our safe, clean offices. When working from home, you are required to have a reliable internet connection with at least 50mb DL/10mb UL. Remote work is supported with cloud-based applications, collaboration tools and asynchronous working. The health and safety of employees are a top priority. We encourage work-life balance and keep the Geotab culture going strong with online social events, chat rooms and gatherings. Join us and help reshape the future of technology!</p>\n<p>Geotab encourages applications from all qualified candidates. Geotab is committed to accommodating persons with disabilities throughout the interview, selection and employment process. If you require accommodation at any stage of the application process or want more information about our accommodation policies and practices, please contact us at <a href=\"mailto:careers@geotab.com\">careers@geotab.com</a>. Click here to learn more about what happens with your personal data.</p>\n",
      "how_to_apply": "<p><a href=\"https://careers.geotab.com/jobs/description/76ff28d8-f265-4ac3-9aa1-3142534b23fe/\">https://careers.geotab.com/jobs/description/76ff28d8-f265-4ac3-9aa1-3142534b23fe/</a></p>\n",
      "company_logo": null
    },
    {
      "id": "4cb87de1-8c92-4c41-bf23-f90daa83e739",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4cb87de1-8c92-4c41-bf23-f90daa83e739",
      "created_at": "Wed Apr 14 13:45:51 UTC 2021",
      "company": "Smile.io",
      "company_url": "https://smile.io/careers",
      "location": "Anywhere",
      "title": "Senior Software Engineer",
      "description": "<p>Smile.io is the world’s largest loyalty platform, providing easy-to-use reward programs that help scaling e-commerce brands transform one-time sales into repeat, loyal customers. Over 60,000 brands use Smile to turn transactional purchases into passionate repeat shoppers.</p>\n<p>We’re celebrating explosive growth and need your help empowering every entrepreneur to grow their brand and build lasting relationships with their customers. We are a remote-first company, and we believe you should be able to work from anywhere. We have team members working from home offices across the globe, and our team has never been more connected. Tell us where you'd like to work when you apply!</p>\n<p><strong>About the Team:</strong>\nThe engineering team at Smile.io believes in being proud of your code, owning what you ship, and embracing new tools to increase developer happiness. We believe small, empowered teams can ship products with the highest impact. Right now we’re working on expanding our product to support the massive growth of e-commerce.</p>\n<p>We currently power over 60,000 rewards programs, reaching more than 500 million customers, and serving 1M API requests/hour. Our primary deployment languages are Ruby on Rails, React &amp; Ember.js, but as a team, we enjoy learning new languages and technologies - so this list could change! We use Github, Slack, and CircleCI to communicate efficiently and ship code every day.</p>\n<p>We value diversity, inclusion, and belonging. It helps us build a better product, it helps us create opportunity for growth and change. It helps us enjoy the work we do and create a supportive creative environment to do our best work. It helps us to be human.</p>\n<p><strong>About the Role:</strong>\nAs a Software Engineer, you'll be working on a distributed team with diverse skills across the tech stack. We build features, enhancements, experiments, and deliver sustainable, quality software in an agile environment.</p>\n<p><strong>What you'll help us achieve:</strong></p>\n<ul>\n<li>Write, test, instrument, document, and maintain software for Smile.io</li>\n<li>Review code and provide thoughtful, constructive feedback for your team</li>\n<li>Collaborate closely with Product, Design, and partner Engineering teams to build new features.</li>\n<li>Analyze how your features are performing in production to learn and make the product better</li>\n<li>Support a highly available service used by millions of users on a daily basis</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li>Have high empathy in everything you do</li>\n<li>5+ years technical experience in software engineering or similar</li>\n<li>Have built web experiences and systems at scale</li>\n<li>Enjoy and thrive in a remote-first, distributed work culture</li>\n<li>Are highly self-directed and take initiative to go above and beyond expectations</li>\n<li>Value clear written and verbal communication</li>\n<li>Believe  mentoring, and sharing information is better than hoarding it</li>\n<li>Able to pick up new concepts quickly and put them into practice</li>\n<li>Use data to validate your hypotheses and inform your decision making</li>\n<li>You enjoy automating and scaling</li>\n<li>You believe in simplicity over complexity</li>\n<li>You value agility and the ability to shift focus quickly</li>\n<li>You value products over projects</li>\n<li>You’re more focused on outcomes over output</li>\n</ul>\n<p><strong>Bonus if you have:</strong></p>\n<ul>\n<li>Ecommerce Industry Experience</li>\n<li>API Development Experience</li>\n<li>Experience with complex data structures and data architecture</li>\n<li>Experience with automated integration testing and test automation</li>\n<li>Security by Design, and Privacy by Design principles</li>\n<li>Experience with Amazon Web Services, Postgres, Kafka, Elasticsearch</li>\n</ul>\n<p><strong>Who are we?</strong>\nEveryone at Smile is driven by these core values:</p>\n<ul>\n<li>Be Humble - think of the team before thinking of yourself. We have no room for massive egos.</li>\n<li>Be Hungry - set hard goals, ask lots of questions, and learn every day.</li>\n<li>Be Human - show empathy towards others, consider the impact of your decisions on other teams.</li>\n</ul>\n<p>We know that Smile.io as a business is in constant evolution - the same is true of our people. We’re here to support each other in our growth, so we talk openly about our career &amp; personal goals. With such a diverse team of people, we know we can offer you the mentorship, tools, and encouragement you need to grow.</p>\n",
      "how_to_apply": "<p>Send us an application to: <a href=\"https://jobs.lever.co/Smile.io/9b8f234c-1686-4fb0-9708-ee1f1775fa86\">https://jobs.lever.co/Smile.io/9b8f234c-1686-4fb0-9708-ee1f1775fa86</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdktnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d55f126113a9088617b7bf281a7b3d5c012af12d/001%20(1).png"
    },
    {
      "id": "9ea89eeb-0e6a-4b49-90a5-350a4e5d7326",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9ea89eeb-0e6a-4b49-90a5-350a4e5d7326",
      "created_at": "Wed Apr 14 13:12:51 UTC 2021",
      "company": "Paladin Studios",
      "company_url": "http://www.paladinstudios.com",
      "location": "The Hague, The Netherlands",
      "title": "Systems Developer",
      "description": "<p><strong>We are looking for an experienced developer with a passion for games, development and architecture. Someone who thrives in a changing environment, and works together to solve problems and create scalable solutions.</strong></p>\n<p><strong>As systems developer you will be an integral part of our game development teams. You work closely with art and design, and plan systems and tools to bring our game visions to live. You understand what it takes to work in multidisciplinary teams, and strive for improving what and how we develop.</strong></p>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li>Create games together with artist, designers and producers</li>\n<li>Champion code quality, scalability, stability and performance</li>\n<li>Design, develop and iterate on game systems</li>\n<li>Take ownership in finding technical solutions and estimating new features and projects</li>\n<li>Collaborate and promote cross-project cooperation and knowledge sharing</li>\n</ul>\n<p><strong>ROLE-BASED SKILLS</strong></p>\n<p><strong>What we are looking for:</strong></p>\n<ul>\n<li>Excellent C# programming skills</li>\n<li>Understanding of readable, robust code and best practices</li>\n<li>Understanding of programming patterns</li>\n<li>Understanding of debugging, performance monitoring and optimization</li>\n<li>The ability to summarize complex topics both verbally and in writing</li>\n<li>Experience using source control systems and tools</li>\n</ul>\n<p><strong>What could help:</strong></p>\n<ul>\n<li>Understanding of game development processes and tools</li>\n<li>Experience with mobile &amp; console development</li>\n<li>Knowledge of other programming languages</li>\n<li>Understanding of client / server communication and data serialization</li>\n<li>Experience with build automation and build scripts</li>\n<li>Experience with third-party API’s and SDK’s</li>\n<li>Experience with writing clear, concise and accurate technical documentation</li>\n</ul>\n<p><strong>Soft skills:</strong></p>\n<ul>\n<li>\n<strong>Insight</strong>: Deconstructing complex situations in order to obtain and share a complete picture</li>\n<li>\n<strong>Accountability</strong>: Taking responsibility for your own actions and those of your colleagues</li>\n<li>\n<strong>Flexibility</strong>: Adapting to reach a certain goal</li>\n<li>\n<strong>Initiative</strong>: Recognizing and creating opportunities</li>\n</ul>\n<p><strong>Are you qualified?</strong></p>\n<p>We would much rather read your application, than miss out on a great candidate. So please apply if you are interested!</p>\n<p><strong>QUALIFICATIONS</strong></p>\n<ul>\n<li>A strong passion for making games</li>\n<li>5+ years experience in programming</li>\n<li>3+ years experience with Unity development with at least 1 game published</li>\n<li>Excellent English communication skills, both written and verbal</li>\n</ul>\n<p><strong>CULTURAL COMPETENCIES</strong></p>\n<p>Paladin has five core values that we’re looking for in team members:</p>\n<ul>\n<li>\n<strong>Kaizen</strong>: We make positive changes on a regular basis</li>\n<li>\n<strong>Spark</strong>: We leave a mark, providing a positive experience for everyone involved</li>\n<li>\n<strong>Wholehearted</strong>: We love the work we do, and we commit to our work</li>\n<li>\n<strong>Fellowship</strong>: We are in this together</li>\n<li>\n<strong>Autonomy</strong>: We make decisions and take responsibility for our actions</li>\n</ul>\n<p><strong>WE OFFER</strong></p>\n<ul>\n<li>Diverse and challenging projects</li>\n<li>A place in a highly motivated and skilled team and an ambitious company</li>\n<li>Positive, healthy work environment</li>\n<li>Coaching and plenty of opportunities for personal development</li>\n<li>A high degree of freedom and responsibility</li>\n<li>Competitive salary and benefits</li>\n</ul>\n<p>We work in autonomous development teams. This ensures tight communications, a real sense of ownership and truly agile development. In our weekly show &amp; tell meetings, every team shares their progress and all aspects of the company can be discussed. We believe in transparency and autonomy, and this creates a high degree of freedom and responsibility.</p>\n<p><strong>ABOUT PALADIN STUDIOS</strong></p>\n<p>We create games that make people smile – be it a sweet twinkle, loud laugh, or evil grin.</p>\n<p>Paladin is a game developer. Our basecamp is in The Hague but we are currently working remote due to COVID-19. We are a team of 35+ knights and growing. Our mission is to create games with a spark, for players all over the world. We achieve this goal by being a world-class game studio with soul, that brings out the best in people. That means a studio filled to the brim with creativity, professionalism, and good vibes.</p>\n<p>Some of our recent games include:</p>\n<ul>\n<li>\n<a href=\"http:/paladinstudios.com/cut-the-rope\">Cut The Rope Remastered</a>  - A remaster of the legendary Cut the Rope puzzle game!</li>\n<li>\n<a href=\"http:/paladinstudios.com/good-job\">Good Job!</a>  - Climb the corporate ladder one office-themed puzzle at a time</li>\n<li>\n<a href=\"http:/paladinstudios.com/stormbound\">Stormbound</a>  – Tactical CCG combat with beautiful visuals</li>\n<li>\n<a href=\"http:/paladinstudios.com/tamagotchi\">My Tamagotchi Forever</a>  – The 90s reborn on your smartphone!</li>\n</ul>\n<p><strong>HOW TO APPLY</strong></p>\n<p>Does this sound good? Awesome! To apply, please fill in the <a href=\"https://paladinstudios.bamboohr.com/jobs/view.php?id=48\">application form</a> . First come, first serve. Please link to your portfolio and CV or add them as attachments.</p>\n",
      "how_to_apply": "<p>Please use this link to apply: <a href=\"https://paladinstudios.bamboohr.com/jobs/view.php?id=48\">https://paladinstudios.bamboohr.com/jobs/view.php?id=48</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXlnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--53913f151a08d476ed5dd52dd1964aa9601caf89/Paladin_Logo_paladinArthur.png"
    },
    {
      "id": "80f3b7f0-97ca-47a7-a751-89f9d766b0c6",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/80f3b7f0-97ca-47a7-a751-89f9d766b0c6",
      "created_at": "Wed Apr 14 12:20:37 UTC 2021",
      "company": "Clark Germany GmbH",
      "company_url": "https://www.clark.de",
      "location": "Frankfurt",
      "title": "Senior Software Engineer (m/f/x)",
      "description": "<p><strong>Who is Clark (<a href=\"http://www.clark.de\">www.clark.de</a>)?</strong></p>\n<p>Since our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by 150.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!</p>\n<p><strong>As our Senior Software Engineer, you..</strong></p>\n<ul>\n<li>play a central role in the design and development of our backend system and architecture</li>\n<li>actively contribute to product management and influence our features right from the start</li>\n<li>lift the intelligence of our robo advisor and the efficiency of our insurance operations team</li>\n<li>closely interact with colleagues who use your software to service our customers</li>\n<li>conceptualise and deliver features on a platform that will soon serve &gt; 500000 customers.</li>\n</ul>\n<p><strong>Your Background, you...</strong></p>\n<ul>\n<li>have gained a Technical University or Bachelor's degree</li>\n<li>have minimum 4 years experience in software engineering and web development, incl. 2 years Ruby on Rails, as well as other languages</li>\n<li>a deep understanding of modern software architecture and software design principles, e.g. SOLID, Event Processing, and Domain Driving Design, git, scrum and agile approaches</li>\n<li>test-driven development and quality assurance through automated testing are selfevident</li>\n<li>good knowledge of cloud infrastructure and continuous deployment</li>\n<li>experience with Javascript Frontend Frameworks especially with Ember are a plus</li>\n<li>excellent skills in handling SQL and relational database</li>\n</ul>\n<p><strong>This is Clark – this is what we love to offer you:</strong></p>\n<ul>\n<li>besides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.</li>\n<li>we subsidize your job ticket and the company pension scheme.</li>\n<li>want e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark</li>\n<li>if you need to work absolutely focused, you use our silent room – no disturbance, no noise.</li>\n<li>if you need to relocate, you have our support.</li>\n<li>you need to brush up your German? We are offering beginner and advanced German courses!</li>\n<li>you want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.</li>\n<li>and last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch &amp; breakfast as well as our weekly Friday get together.</li>\n</ul>\n<p>This sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.</p>\n",
      "how_to_apply": "<p><a href=\"https://clark.join.com/jobs/2089461-senior-software-engineer-m-f-x?pid=357a3b4531918760973f&amp;oid=f16780b4-5ed8-458e-ad72-419c1a665787&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bsoftware%2Bengineer%2Bm%2Bf%2Bx\">https://clark.join.com/jobs/2089461-senior-software-engineer-m-f-x?pid=357a3b4531918760973f&amp;oid=f16780b4-5ed8-458e-ad72-419c1a665787&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bsoftware%2Bengineer%2Bm%2Bf%2Bx</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf259abb757f7c297af856b622e44b3683110263/clark-germany-gmb-h-logo-xl.png"
    },
    {
      "id": "46ab84b4-12dc-4a95-ab08-422428554dfc",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc",
      "created_at": "Fri Oct 09 19:42:30 UTC 2020",
      "company": "Playco",
      "company_url": "http://www.play.co",
      "location": "Remote / EMEA",
      "title": "Core/Backend Engineer",
      "description": "<p>Here at Playco, we make games that bring the world closer together through play!</p>\n<p>Our ideal teammates are thoughtful, low ego, and hardworking professionals who can both zoom into the details and zoom out to embrace the big picture. We are passionate about makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you'll enrich our team with your enthusiasm and passion, both for games and for life.</p>\n<p>Our engineering teams write scalable backend systems, cross-compilers, JavaScript / TypeScript game APIs and tools, and whatever else it takes to make our game studios efficient at what they do best -- create games. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack. If you thrive in a fast paced and creative environment, this may be the role for you!</p>\n<p><strong>The Role</strong></p>\n<p>We’re looking for engineers who are excited about redefining the technology stack to build and operate games reaching millions of people. Playco’s instant play first approach means that traditional industry approaches to game engine design, client/server architecture, big data and analytics, and games as a service needs to be rethought and redone. When you join our team, you’ll be at the forefront of the technology stack to enable millions of gamers to play with their friends, instantly.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Architect and code sophisticated client/server systems for instant gaming.</li>\n<li>Play a critical role in day-to-day coding, performance profiling, optimization, and general troubleshooting.</li>\n<li>Collaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Learn from and mentor other engineers on your team.</li>\n<li>Take ownership of your projects to make them the best they can possibly be.</li>\n<li>Provide valuable input on the company’s long-term engineering roadmap and help identify areas of opportunity for improvement.</li>\n</ul>\n<p><strong>Some projects that we work on</strong></p>\n<ul>\n<li>Backend as a service platform for game studios that allows game developers to effortlessly add persistence and multiplayer features for their games.</li>\n<li>Synchronous multiplayer game hosting platform that scales horizontally to any load.</li>\n<li>Common analytics layer to that allows to capture data consistently across games.</li>\n<li>Integration with new and exciting platforms that run instant games.</li>\n<li>Custom tooling framework to allow developers to deploy custom-purpose tools that help games with live ops.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience.</li>\n<li>Experience writing clean, testable, high-quality code and designing highly scalable systems in production.</li>\n<li>Solid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).</li>\n<li>Strong Computer Science fundamentals in software systems design, algorithms, and data structures.</li>\n<li>Ability to interact with peers in a constructive and productive style.</li>\n<li>Familiarity with git, svn, or other VCS.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.</li>\n<li>Strong team player with a positive attitude.</li>\n</ul>\n<p><strong>Bonus</strong></p>\n<ul>\n<li>Expert knowledge of NodeJS and ES6 / TypeScript.</li>\n<li>DevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.</li>\n<li>Experience in game development and shipped titles.</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://jobs.lever.co/playco/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">Apply Here</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"
    },
    {
      "id": "e69b3ab9-54fc-4e56-a337-59763e9f81c2",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e69b3ab9-54fc-4e56-a337-59763e9f81c2",
      "created_at": "Tue Apr 13 19:27:53 UTC 2021",
      "company": "Findaway",
      "company_url": "http://Findaway",
      "location": "Remote or Solon, OH",
      "title": "Architect / Senior Python Developer",
      "description": "<p>Company Description</p>\n<p>Findaway is an audio technology company, innovating every day to bring more audiobooks to more listeners around the globe. As the World's Audiobook Partner, we revolutionize the audiobook industry through products, technology, creation, and publishing. We are focused on making it possible for people all over the world to share their stories and we are using the power of audio to do it. Findaway has been awarded recognition as one of the fastest growing companies in Northeast Ohio and in America. We have been honored as one of the \"Best Places to Work\" in Northeast Ohio and have been on the Plain Dealer's Top Workplaces list. If you are looking to join a team of fearless Findawayers who aggressively pursue goals, share ideas, and bring every thought to the table in a high growth, entrepreneurial culture - check us out!</p>\n<p>Job Description</p>\n<p>The Architect / Senior Python Developer position will be responsible for design and implementation oversight of all new products in the Digital Products Group using industry best practices and principles.  The role will also be involved in assessing existing systems and suggesting design/architecture improvements to achieve scalability and long-term maintainability.  There will be no direct reports, but the Lead Developer is expected to provide mentorship, guidance, and training to the rest of the development team in order to establish consistent work product across multiple teams.</p>\n<p>Duties &amp; Responsibilities</p>\n<p>-Defines and promotes common architecture designs, methodology, standards and practices across the digital products group\n-Create technical design specs for all major development projects to give direction for developers\n-Work with Head of Technology to analyze resource requirements and usage and suggest options to optimize and cut costs in our AWS hosted environment.\n-Assess existing systems and suggest improvements in design, architecture, and frameworks\n-Mentor and educate junior developers on coding best practices and design principles\n-Ensure all code deployed to production has been properly reviewed to meet coding and design standards\n-Foster a culture of continuous education and continuous improvement</p>\n<p>Qualifications</p>\n<p>-Demonstrated ability to lead architecture development activities and methodologies leading to comprehensive discovery, analysis and technical/business recommendations\n-10+ years of experience in software development\n-5+ years of experience in a lead or architect role designing and maintaining consumer facing enterprise web applications and APIs\n-5+ years of experience working with and deploying systems to AWS\n-5+ years of experience with Python development\n-Proficiency with JavaScript and SQL\n-Comfortable at a Linux command prompt as this is the run-time environment for all of our services.\n-Understanding of microservices architecture and the bigger picture</p>\n<p>Preferences</p>\n<p>-Experience in constrained environments, i.e. SOC, PCI.\n-Experience with AI/ML/NLP\n-Experience with Django and Django Rest Framework\n-Experience with REST and GraphQL API architectures\n-Experience with Mongo and PostgreSQL\n-Experience with React or a similar Javascript framework</p>\n",
      "how_to_apply": "<p>Email your resume directly to <a href=\"mailto:mklouse@findaway.com\">mklouse@findaway.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1438d2a7232b48effbe3004a5765f277adf2d2b6/Findaway-logo-clipboard.jpg"
    },
    {
      "id": "d1c2f4ed-9894-4304-9083-905756c046b6",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d1c2f4ed-9894-4304-9083-905756c046b6",
      "created_at": "Tue Apr 13 15:43:27 UTC 2021",
      "company": "Novus",
      "company_url": "http:",
      "location": "Austin / NYC / Zurich / Remote until return to office",
      "title": "Front-End Engineer",
      "description": "<p>Our Mission</p>\n<p>Novus serves capital allocators and managers, helping them enrich and manage their data, extract actionable investment insights, and improve stakeholder communication via visualization and automation. We strive to be the center of the institutional investment ecosystem, where the world’s investors gather to manage their portfolios and engage with one another.</p>\n<p>Over $120 trillion is invested annually on behalf of pensions, endowments, sovereign funds, private investors, and family offices. Unfortunately, many of these institutions are using outdated and disconnected tools to manage their portfolios. Novus offers comprehensive solutions for multi-asset class portfolios. By providing a single platform that streamlines data processes, quantifies investment skill, uncovers bias, and helps investors plan more accurately, we are helping investors amplify their impact.</p>\n<p>Our Values</p>\n<p>If the following sounds like you, we look forward to getting to know you —</p>\n<ul>\n<li>You are looking to join a fast-paced team that will mentor and support you as you take on challenging projects.</li>\n<li>You understand that deadlines and goals – even if self-imposed – are what help businesses succeed.</li>\n<li>You appreciate direct, unvarnished feedback – you know it will help you grow.\nAlso:</li>\n<li>The thought of deploying code to production several times day excites you. You know it is better to \"fail fast\" than to never ship at all.</li>\n<li>You enjoy mastering your craft, but also love learning about technologies and tools outside your core expertise.</li>\n<li>You don't take yourself too seriously and know the importance of bringing some levity to an otherwise tense situation.</li>\n</ul>\n<p>What You’ll Do</p>\n<p>You’ll join our Product Team as a Front-End Engineer (HTML/JavaScript) developing the core Novus product, Alpha Platform. This role will expose you to our rapidly evolving product suite, with consistent opportunity to make a direct impact on the business.</p>\n<p>Novus is a small firm, so we need our engineers to take ownership of their projects. You’ll do more than merely “code to a wireframe.” From the start, you’ll be helping bring products from concept to production while solving distinct design, UI and UX challenges.</p>\n<p>Some responsibilities will include:</p>\n<ul>\n<li>Become an expert in our front-end stack</li>\n<li>Learn about our backend stack, coded in Scala, MySQL and AWS technologies.</li>\n<li>Collaborate across the entire organization, including backend engineers, data operations team, client services and product managers.</li>\n<li>Develop expertise in a broad array of financial topics.</li>\n</ul>\n<p>Critical Skills / Abilities</p>\n<p>Our ideal candidate has at least 2 years professional experience building applications in HTML5 and JavaScript and experience with</p>\n<ul>\n<li>Web frameworks such as Angular or React</li>\n<li>Web application layout and design using a CSS preprocessor (Sass, Stylus), and a templating language (Pug, Mustache)</li>\n<li>Continuous Delivery, including integration testing with tools such as Cypress or Selenium</li>\n</ul>\n<p>Additional skills that we would love to see but are not required:</p>\n<ul>\n<li>Hands-on experience with backend technologies, specifically Java, Scala, or SQL</li>\n<li>Familiarity Node.js and/or Puppeteer</li>\n<li>Personal interest in capital markets, finance and investing (even if you’ve never traded stock).</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://grnh.se/2e673e8d1us\">https://grnh.se/2e673e8d1us</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3FnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c99cb8f1626d2e08f07cfa41427d0a6eaa244ae0/Novus_Square.png"
    },
    {
      "id": "3e5506a4-dd55-42cf-9079-066aefed8cff",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3e5506a4-dd55-42cf-9079-066aefed8cff",
      "created_at": "Tue Apr 13 12:46:46 UTC 2021",
      "company": "PostNL",
      "company_url": "http://www.post.nl",
      "location": "Den Haag",
      "title": "Senior Data Engineer Smart Logistics",
      "description": "<h2>Senior Data Engineer Smart Logistics</h2>\n<p>Coding our future, increasing our agility, and staying ahead in the world of e-commerce. We are looking for a Data Engineer Smart Logistics to enable a far more agile, adaptive, and aligned supply chain logistic operation.</p>\n<h2>What is this job about?</h2>\n<p>We are looking for a Senior Data Engineer Smart Logistics to help develop our ambitious Digital Supply Chain Platform that will connect and combine real-time operational data from many IoT sensors, logistical processes, and existing platform systems.</p>\n<p>You will be responsible for building, designing, developing, optimizing, and monitoring our data pipeline and event flows sourced from our IoT platform and existing systems. You will have prior involvement with the rollout of large-scale sensory data, information fusion architectures, and enterprise data integration. You are self-directed, efficient, and effective in re-orienting when working across different system architectures, data sources, storage engines, and types. You fully embrace a Cloud Native(AWS) approach to the expansion of data systems were most appropriate. You are agile and adaptive and have adopted an always learning approach to professional development. You are comfortable working across different functional teams within a dynamic environment.</p>\n<h2>What are you going to do?</h2>\n<ul>\n<li>You act as a coach in the team that is in full development.</li>\n<li>You take a leading role in the further development of areas of expertise, such as security, CI/CD, machine learning, programming, maturity of the applications, etc.</li>\n<li>You align with data scientists, data architects, other platforms for integration, multiple stakeholders on the business/system requirements. You are excellent in understanding what business requires and translating those into technical solutions.</li>\n<li>You guide the team in build sustainable and scalable applications on AWS.</li>\n<li>You keep track of innovations and new service developments.</li>\n<li>You design, implement, review and evaluate complex real-time solutions.</li>\n<li>You determine the optimal choice of database management systems and application databases, taking software, hardware and network capabilities into considerations.</li>\n</ul>\n<h2>Our aim</h2>\n<p>We are building the digital future of PostNL Parcels. With our fundamental approach to data we will digitally transform our supply chain and allow for real-time and automated decision making.</p>\n<h2>What are we looking for</h2>\n<ul>\n<li>Higher education or academic background (HBO/WO) in Computer Science, Informatics, or demonstrably gained through experience;</li>\n<li>4-10 years of working experience in data engineering related field;</li>\n<li>At least 3 years of working experience with cloud services, preferred in AWS;</li>\n<li>Solid Knowledge in cloud security, connectivity, CI/CD, API design;</li>\n<li>Experience in Python, SQL, Spark, understand how Hadoop works;</li>\n<li>Experience in SQL &amp; NoSQL databases, such as AWS RDS, DynamoDB;</li>\n<li>Solid knowledge in translating business requirements into technical solutions;</li>\n<li>Excellent communication skills, written and spoken in English at least;</li>\n<li>Familiar with agile working;</li>\n<li>Machine learning knowledge is preferred.</li>\n</ul>\n<h2>What do we offer</h2>\n<ul>\n<li>Competitive salary based on experience and the talent you bring to the table. Salary up to maximum € 6.357,- (salary scale 11/12 based on experience, fulltime and in accordance with the - PostNL Collective Labor Agreement;</li>\n<li>Part- or fulltime position 32 till 37 hours with view to permanent contract;</li>\n<li>Great benefits including 25 vacation days and 8% holiday pay and attractive Pension benefits;</li>\n<li>A dynamic, flexible and entrepreneurial environment with an innovative and collaborative PostNL team, and external suppliers creating value to the platform;</li>\n<li>Professional growth opportunities, for example as technical lead or skills diversification to other languages, platforms or in-depth development and specialism;</li>\n<li>Room for personal development through education and training in the PostNL learning environment, content driven and knowledge sharing sessions;</li>\n<li>Office location: Easy Public Transport commute to our PostNL office in the Hague;</li>\n<li>Engineering laptop, mobile phone and compensation towards your travel costs.</li>\n</ul>\n<h2>Interested?</h2>\n<p>Apply now via the <strong>application form</strong></p>\n<p>A pre-employment screening is part of the selection process, including the transmittal of a Certificate of Conduct (VOG).</p>\n<p><a href=\"https://vonq.io/3tiICJh\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3tiICJh\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcitnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--804555d7045613063a7e270ea53e61ea045b8382/post.nl.jpeg"
    },
    {
      "id": "6c93bdd8-940b-415a-a509-b662424a68c1",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6c93bdd8-940b-415a-a509-b662424a68c1",
      "created_at": "Tue Apr 13 11:41:19 UTC 2021",
      "company": "Bosch Group",
      "company_url": "https://vonq.io/327uJSg",
      "location": "Sofia, Bulgaria",
      "title": "Embedded software developper for automotive",
      "description": "<p><strong>Welcome to a place where your ideas lead to something big. Welcome to Bosch.</strong></p>\n<p>Bosch is a leading global supplier of technology and services for the automotive industry.</p>\n<p>Bosch Engineering Center Sofia is founded in 2019 as an integral part of Bosch worldwide engineering network. Today, in the Engineering Center in Sofia nearly 400 talented software and hardware professionals develop innovative technologies for the automotive industry in areas such as driving assistance, automated driving, AI and electric mobility.</p>\n<p>Our mission is to contribute to safer mobility through software technologies, with care for the environment and society.</p>\n<p><strong>Start something big and become a part of forward thinkers where you can create something remarkable!</strong></p>\n<p><strong>We are looking for the right person for the following vacancy:</strong></p>\n<p><strong>Embedded Software Developer</strong></p>\n<h2>Job Description</h2>\n<ul>\n<li>\n<p><strong>Evolving software experience:</strong> Design and implement embedded software for various BOSCH devices, infrastructures, and modern applications.</p>\n</li>\n<li>\n<p><strong>Taking responsibility:</strong> Technical analysis of use cases with regard to feasibility and estimations, specify, implement and verify software components.</p>\n</li>\n<li>\n<p><strong>Developing the future:</strong> Actively drive the development of innovations for the future generation.</p>\n</li>\n<li>\n<p><strong>Holistic development:</strong> Drive the development from the design phase to deployment also considering documentation as well as maintenance.</p>\n</li>\n<li>\n<p><strong>Cross-functional:</strong> Communicate proactively within a cross-functional project team as well as with other BOSCH units in order to fulfill system-wide requirements and to ensure a seamless user experience.</p>\n</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>\n<p><strong>Personality:</strong> creative, open-minded and proactive</p>\n</li>\n<li>\n<p><strong>Working Practice:</strong> accurate, analytical and self-dependent, open to Agile process</p>\n</li>\n<li>\n<p><strong>Experience and Knowledge:</strong> demonstrated engineering background (3+ years) developing embedded software. Experience in writing, debugging and testing <strong>C</strong> or <strong>C++</strong> software. Experience in working with various embedded devices as well as expertise in RTOS, USB, CAN is an important plus. Knowledge about the hardware is needed for every embedded developer, but not strictly required. Understanding the IoT concepts and tools like IFTTT, MQTT, BLE, REST API are also a beneficial experience.</p>\n</li>\n<li>\n<p><strong>Languages:</strong> good competencies in spoken and written English</p>\n</li>\n<li>\n<p><strong>Education:</strong> completed University degree (Bachelor/Masters/Diploma) in Electrical Engineering, Computer Science, Mathematics or comparable qualifications</p>\n</li>\n</ul>\n<h2>Additional information</h2>\n<p><strong>Our Benefits</strong></p>\n<ul>\n<li>25 days paid annual leave</li>\n<li>Private health insurance and life insurance</li>\n<li>Food vouchers</li>\n<li>Transportation allowance</li>\n<li>Flexible working time and options to work from home</li>\n<li>Free parking</li>\n<li>Sports venue pass at a preferential price</li>\n<li>Specialized training programs and professional qualifications, career development opportunities and programs, as well as foreign language courses</li>\n<li>Employee discounts for company products and services</li>\n<li>Modern office with gaming and relax rooms</li>\n<li>Fresh fruits and drinks in the office</li>\n<li>Convenient office location</li>\n</ul>\n<p>The personal data you provide to us is processed by Robert Bosch EOOD within your application in the recruiting process. Your personal data is shared exclusively and only to employees of the Bosch Group and the candidate data retention period is 6 months. You have the right to obtain information about the processing of your personal data. In addition, you have the right to correct, to block and to delete it in accordance to the legal regulations. To enforce your rights, you only need to contact us. Remark: If you request to block or to delete your data, your application can no longer be considered.</p>\n<p>Предоставените от вас лични данни се обработват от Роберт Бош ЕООД в рамките на заявената от вас кандидатура в процеса на набиране на персонал за нашата фирма. Те се разкриват изключително и само на сътрудници на Група Бош и се съхраняват при нас за срок от 6 месеца. По ваше желание можете да получите информация за обработката на вашите лични данни. Освен това имате право на тяхното коригиране, блокиране и заличаване в съответствие със законовите разпоредби. За да се възползвате от тези права е необходимо само да се свържете с нас. абележка: При заявка за блокиране и изтриване на вашите данни, кандидатурата ви вече не може да бъде разглеждана.</p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/327uJSg\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcktnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31adc535acd3400b5b4b0bbb41dece50038b8d25/Bosch.png"
    },
    {
      "id": "3fd403c0-dac9-45d2-9ec1-4f05a5e92af0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3fd403c0-dac9-45d2-9ec1-4f05a5e92af0",
      "created_at": "Tue Apr 13 10:35:40 UTC 2021",
      "company": "Synergeticon GmbH",
      "company_url": "https://synergeticon.de",
      "location": "Remote",
      "title": "Golang Developer (m/f/d)",
      "description": "<p>We are a small / medium sized company in Hamburg. Take-off was 2015 with the aerospace industry. Our base is in the ZAL-TechCenter close to our airborn customers Airbus, Premium Aerotec, Lufthansa Technik etc. Since then we were also heading towards the automotive and maritime and medical industry. Our products and solutions include b2b software for advanced AI computer vision and IoT based assistance systems to enable our customers with the latest digital technologies.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>Implement apis with (e.G. GraphQL or gRPC web) for our microservice architecture</li>\n<li>Write microservices with gRPC communication that control robots</li>\n<li>Create connectors to industrial devices (e.G. via TCP protocols)</li>\n<li>Connect and query graph databases like dGraph or Neo4j</li>\n<li>Define software architectures with our young and dynamic team</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p>You just need to love Go.</p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Work in a company where people love what they do</li>\n<li>Create awesome stuff, learn as you go</li>\n<li>Work from home or come to our office with river view</li>\n<li>Equipment is high end, choose your os, editor</li>\n</ul>\n<p>Come as you are.</p>\n",
      "how_to_apply": "<p><a href=\"https://synergeticon.join.com/jobs/2125177-go-lang-with-us-as-a-developer-mfd?pid=357a3b4531918760973f&amp;oid=ea847e43-ec0f-4edb-bbe2-f89becd6a212&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=go%2Blang%2Bwith%2Bus%2B-%2Bas%2Ba%2Bdeveloper%2Bmfd\">https://synergeticon.join.com/jobs/2125177-go-lang-with-us-as-a-developer-mfd?pid=357a3b4531918760973f&amp;oid=ea847e43-ec0f-4edb-bbe2-f89becd6a212&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=go%2Blang%2Bwith%2Bus%2B-%2Bas%2Ba%2Bdeveloper%2Bmfd</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcStnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--70fbd310f2ed572108c949968f5f3680b2b33ca2/synergeticon-gmb-h-logo-xl.png"
    },
    {
      "id": "0e9fc2a4-dbe0-4930-845d-c8df56730837",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0e9fc2a4-dbe0-4930-845d-c8df56730837",
      "created_at": "Tue Apr 13 00:03:39 UTC 2021",
      "company": "OneLogin",
      "company_url": "http://www.onelogin.com",
      "location": "Remote",
      "title": "Engineering Lead, Test/Release Automation",
      "description": "<p>ABOUT THE ROLE:</p>\n<p>OneLogin needs an experienced software engineer and technical team lead to assume ownership of all things Automation. Join our close knit Quality Engineering team that is responsible for the quality of our product offerings from the beginning of the SDLC all the way through the release to production.</p>\n<p>Provide leadership for a team of automation engineers: providing solid feedback and advice to the team manager, managing team projects, and leading team meetings.</p>\n<p>Assume principle ownership of our proprietary E2E test framework (Node.js, puppeteer, Ava):  enhance and maintain this framework, document its use, and provide training and tooling necessary to enable the feature teams to write their own effective and maintainable E2E tests.</p>\n<p>Consult and collaborate with the Platform team to ensure that the CI/CD pipeline meets the needs of the company throughout the development, testing, and release cycles.</p>\n<p>Project planning, implementation, and delegation to provide tooling to integrate the E2E tests into a continuous test pipeline.</p>\n<p>Build a system that provides telemetry, quality metrics, reports and alerting for automated tests.</p>\n<p>Participate in Release Management (with oversight) in the short term, until the current manual processes are effectively automated/streamlined.</p>\n<p>Develop, maintain, extend a software solution linking TestRail test plans with JIRA tickets and the E2E test framework for well directed automatic test run generation and reporting.</p>\n<p>While this position is principally concerned with E2E tests, must be able to clearly communicate with and advise feature teams on effective unit and integration test coverage. </p>\n<p>Will own measuring (not implementing) unit/integration test coverage, helping to ensure that we have comprehensive test coverage at the proper places in the test pyramid.</p>\n<p>ABOUT YOU:</p>\n<p>The right person for this position needs to be a strong contributor to the design and implementation of complex, multi-team software projects as well as providing leadership for the existing Automation engineers. Must be able and willing to participate in the manual deployment processes to understand and affect major releases and then implement  their replacement with automation.  Will participate in second tier on-call rotation for the systems the Automation team is responsible for.</p>\n<p>In order to truly be effective in OneLogin culture, the right candidate will need to cooperate with other teams to get the right things done, providing advice and guidance.  The successful candidate must stand on their principles but be flexible in approach, comfortable with finding best-fit solutions, tracking the technical debt any compromises introduce, and be vigilant in following up over time to eliminate that debt.</p>\n<p>3+ years of Quality Engineering experience preferably in an enterprise SaaS company</p>\n<p>3+ years NodeJS experience.  Familiarity with promises and functional programming will be a plus.  Experience with other programming languages, particularly Ruby a definite advantage.</p>\n<p>3+ years of UI and API test automation, using Selenium, Puppeteer or similar.</p>\n<p>3+ years experience building, using, maintaining CI/CD pipelines, gitHub Actions or similar a plus.</p>\n<p>3+ years of small team tech lead experience.</p>\n<p>2+ years Experience testing microservices, being mindful of dependencies between services and monolithic components.</p>\n<p>1+ years of experience providing automatic quality metrics, using observability and monitoring tools (our stack includes Sumo, DataDog, NewRelic and Elasticsearch)</p>\n<p>Professional experience with Kubernetes, EKS, GKE, AKS, etc a plus.</p>\n<p>Demonstrated ability to effectively partner with development teams on quality initiatives.</p>\n<p>Strong communication and decision making skills with the ability to balance conflicting interests</p>\n<p>Bachelor’s degree in Computer Science, Engineering or related field</p>\n<p>ABOUT ONELOGIN:</p>\n<p>OneLogin is the leader in Unified Access Management, Enabling Organizations to Access the World™. Businesses of all sizes use OneLogin to secure company data, while increasing IT administrator and end users efficiencies. Implementation of our identity management solutions can be achieved in hours not days, delivering a fully featured administrative and self-service portal. Our ability to handle on-premises and cloud/SaaS applications makes us the identity as a service vendor of choice for the hybrid enterprise. Two-factor authentication, mobile identity management for one-click access on smartphones and tablets, and real-time directory synchronization add an extra layer of protection.</p>\n<p>Our core values:</p>\n<p>Security first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility</p>\n",
      "how_to_apply": "<p><a href=\"https://grnh.se/97d274da1us\">https://grnh.se/97d274da1us</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcCtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ebd5ab8ae0cb54316363e2b26023287289036078/onelogin%20work%20mark.png"
    },
    {
      "id": "5633f376-475f-4016-ab7c-51bd1d327f88",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/5633f376-475f-4016-ab7c-51bd1d327f88",
      "created_at": "Mon Apr 12 23:22:39 UTC 2021",
      "company": "OneLogin",
      "company_url": "http://www.onelogin.com",
      "location": "Remote, US",
      "title": "Senior BackEnd Software Engineer",
      "description": "<p>ABOUT THE ROLE</p>\n<p>HELP US BUILD THE NEXT GENERATION OF CLOUD-BASED IDENTITY AND ACCESS MANAGEMENT (IAM) SOLUTIONS\nMAKE A BIG IMPACT ON PRODUCT IN A FLEXIBLE WORK ENVIRONMENT WITH A STRONG FOCUS ON PROFESSIONAL DEVELOPMENT</p>\n<p>OneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers.  We just closed a $100M series-D, and we are growing. OneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers. As part of building out new cloud services, we’re looking for talented SOFTWARE ENGINEERS. </p>\n<p>WHAT YOU’LL BE DOING:</p>\n<p>Work on technically challenging product that is solving real problems for our customers</p>\n<p>Enjoying friendly working environment where you can grow (a lot!)</p>\n<p>Communicating with other OneLogin engineers across the world</p>\n<p>Building and designing secure, scalable, and reliable micro-services in cloud SaaS environment</p>\n<p>Redesigning or splitting the legacy monolith in something much nicer</p>\n<p>Thinking out-of-the-box to come up with a solution to problems that do not seem to have one</p>\n<p>Continuously trying new technologies and applying them if they make sense and solve customer problems</p>\n<p>Ruby, Rails, NodeJS, Javascript, React, Redis, Postgres, HAProxy, Networking, API’s, Authentication, MFA, RabbitMQ, Docker, Swarm, Consul, CI/CD … and a lot more and always changing</p>\n<p>WHAT YOU BRING TO THE TABLE:</p>\n<p>Security-first mindset</p>\n<p>Getting things done attitude with focus on quality</p>\n<p>Bringing different perspectives and opinions</p>\n<p>4+ years of experience working in SaaS or Cloud environment </p>\n<p>Strong engineering ability in multiple languages - Ruby/Rails, Javascript/NodeJS are plus</p>\n<p>Knowledge and interest in IAM/authentication is great</p>\n<p>Experience working on the backend, with a background in building and deploying scalable micro-services</p>\n<p>Understanding of best practices in the design of RESTful APIs</p>\n<p>SQL and general database knowledge</p>\n<p>Computer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States</p>\n<p>WHY YOU SHOULD JOIN US:</p>\n<p>Join a small, close-knit team with the ability to impact highly visible product already trusted by millions\nGet in early on a small, close-knit team with ownership and impact on products trusted by millions\nAward-winning company culture, strong local leadership, and great career development opportunities\nCompetitive salary plus great perks including equity, full insurance (medical, dental, &amp; vision), unlimited time off, and flexible WFH policies </p>\n<p>ABOUT ONELOGIN</p>\n<p>OneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide. We are headquartered in San Francisco, California. For more information, visit www.onelogin.com.</p>\n<p>Our core values</p>\n<p>Security first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility</p>\n",
      "how_to_apply": "<p><a href=\"https://grnh.se/a143f6531us\">https://grnh.se/a143f6531us</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a79482b48ee40fe1a3a126c2b7544281d0a46ff0/onelogin%20work%20mark.png"
    },
    {
      "id": "224f07bf-655d-4359-ac7f-5eb2a96aa661",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/224f07bf-655d-4359-ac7f-5eb2a96aa661",
      "created_at": "Mon Apr 12 18:45:20 UTC 2021",
      "company": "Toptal",
      "company_url": "https://www.toptal.com/",
      "location": "Remote",
      "title": "React Developer – Full-Time, Remote",
      "description": "<p>Design your full-time freelance career as a top freelance developer with Toptal.</p>\n<p>Freelance work is defining developer careers in exciting new ways. If you’re passionate about finding rapid career growth potential working with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.</p>\n<p>Toptal is an elite talent network made up of the world’s top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you’ll choose your own schedule and work from anywhere. Jobs come to you, so you won’t bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time. Our sophisticated screening process makes sure you are provided with top clients without additional overhead, as well as assistance in maximizing the potential of your full-time freelance career. Joining the Toptal network also gives you access to technical training programs, mentors, and coaching programs, so you can connect with a global community of experts like you to share peer-to-peer knowledge and expand your network globally.</p>\n<p>As a freelance developer, you can become a part of an ever-expanding community of experts in over 120 countries, working remotely on projects that meet your career ambitions.</p>\n<p>That’s why the world’s top 3% of developers choose Toptal. Developers in our elite network share:</p>\n<p>English language proficiency</p>\n<p>3+ years of professional experience</p>\n<p>Project management skills</p>\n<p>A keen attention to detail</p>\n<p>Experience with system architecture or leading a software team is a strong advantage</p>\n<p>Full-time availability is a strong advantage</p>\n<p>If you’re interested in pursuing an engaging career working on full-time freelance jobs for exclusive clients, take the next step by clicking apply and filling out the short form: <a href=\"https://topt.al/v7cnRN\">https://topt.al/v7cnRN</a></p>\n",
      "how_to_apply": "<p>Take the next step by clicking apply and filling out the short form: <a href=\"https://topt.al/v7cnRN\">https://topt.al/v7cnRN</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzZnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ef8cac0eccaead1d9ed898249fd179347c15e6a8/toptal_logo.png"
    },
    {
      "id": "2fdcf257-3257-450e-ba3d-adc03a6f41aa",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2fdcf257-3257-450e-ba3d-adc03a6f41aa",
      "created_at": "Mon Apr 12 17:28:09 UTC 2021",
      "company": "Cased",
      "company_url": "https://cased.com",
      "location": "Remote, US",
      "title": "Backend Engineer",
      "description": "<p>At Cased, we create innovative solutions and workflows for the growing number of security, compliance, and productivity challenges that face software companies.</p>\n<p>Cased was founded in early 2020 by four former GitHub employees, with investment from Founders Fund and some of the most experienced angel investors in technology. Our product enables growing tech companies to ship fast, while staying secure as they grow. Our product includes features like approval workflows for important operations, automatic logging and recording of DevOps tooling, and integrations that link identity providers to command line tools. And we're just getting started.</p>\n<p>You'll help to shape both the future of our product and the company we become. You'll ship world-class software and work alongside engineering, design, and product leaders who helped build GitHub, Facebook, Zillow, Yelp, and Simple.</p>\n<p>Cased embraces diversity, equity and inclusion, and invites applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences.</p>\n<p><strong>What we're looking for</strong></p>\n<ul>\n<li>4+ years experience writing Ruby on Rails code (or significant experience with a similar framework) and have previously collaborated with others in large codebases.</li>\n<li>You're excited about working on a fast-growing product, and can adapt to changing product and customer needs.</li>\n<li>You are familiar with good REST API design and best practices including authentication, rate limiting, content encoding, schemas, and errors.</li>\n<li>Solid database design skills, and some familiarity with search technology is helpful.</li>\n</ul>\n<p><strong>What you'll do</strong></p>\n<ul>\n<li>Work alongside Cased founders and engineers to assist in the design, scalability, and implementation of customer-centric features.</li>\n<li>Learn from customer feedback and weigh in on product decisions.</li>\n<li>Help to build a diverse and inclusive company culture. As an early employee you'll have a significant impact on the type of company Cased becomes.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Work remotely from anywhere in the United States</li>\n<li>Competitive equity and salary</li>\n<li>Medical, dental, and vision health care coverage</li>\n<li>A maxed-out MacBook Pro (or equivalent depending on your preference)</li>\n<li>$1,500 stipend to setup your home office as you see fit</li>\n</ul>\n<p><strong>Our tech stack right now includes:</strong></p>\n<ul>\n<li>Ruby on Rails</li>\n<li>Go</li>\n<li>Postgres</li>\n<li>Kafka</li>\n<li>Elasticsearch</li>\n<li>Terraform</li>\n</ul>\n",
      "how_to_apply": "<p>To apply, send your resume, GitHub, or LinkedIn profile to <a href=\"mailto:team@cased.com\">team@cased.com</a>, along with a brief note on why you'd like to work at Cased.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2lnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2217bef5c097da7b45e3d2f92692e87cfa4294ce/Frame%2015.png"
    },
    {
      "id": "3cc340d4-6662-4a10-8a53-f7cb571427b3",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3cc340d4-6662-4a10-8a53-f7cb571427b3",
      "created_at": "Wed Jan 13 11:00:56 UTC 2021",
      "company": "Remote",
      "company_url": "http://www.remote.com",
      "location": "Anywhere",
      "title": "Senior Frontend Engineer",
      "description": "<p>Remote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. Read more about <a href=\"https://remote.com/how-it-works\">how it works</a>.</p>\n<p>We encourage folks from all ethnic groups, genders, sexuality, age and abilities to apply. We value kindness, ownership and team collaboration. You can check out  <a href=\"https://remote.com/handbook\">public handbook</a> to learn more about our culture. If this job description resonates with you, we want to hear from you!</p>\n<p><strong>How we work</strong></p>\n<p>Remote is fully remote (ah!) and we love <a href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\">Working Async</a>. This means you get to do your own schedule no matter the timezone. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in <a href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\">The Remote Flow</a>.</p>\n<p>The team you'll be joining: 30 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Previous experience working as Frontend Engineer/Developer for at least 4 years</li>\n<li>Solid understanding of <strong>Javascript ES6</strong>\n</li>\n<li>Proficient with <strong>React</strong>\n</li>\n<li>Experience with <strong>Jest</strong> and <strong>React Testing Library</strong> or <strong>Enzyme</strong> in writing meaningful tests.</li>\n<li>Interest in build pages with performance, accessibility and API design in mind</li>\n<li>Attention to the details when implementing UI mockups made by our amazing design team.</li>\n<li>It's not required to have experience working remotely, but considered a plus.</li>\n</ul>\n<p><strong>Experience Bonus</strong></p>\n<ul>\n<li>Next.js</li>\n<li>Elixir/Phoenix</li>\n<li>Docker</li>\n<li>GitLab CI</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Remote work culture</li>\n<li>Your family comes first! Unlimited paid <a href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\">time off</a>.</li>\n<li>The equipment/tools you need to do your job well and comfortable* Good salary and company options</li>\n<li>Flexible working hours</li>\n<li>Home office setup</li>\n<li>Health insurance</li>\n</ul>\n<p><strong>Application process</strong></p>\n<ul>\n<li>(async) Application is reviewed by your future manager (CTO)</li>\n<li>Interview with the recruiter</li>\n<li>Interview with the CTO</li>\n<li>(async) Code exercise (async, no deadline, a very simple exercise)\nInterview with the team (no managers on the call, just for you to get a sense of who you'd be working with)</li>\n<li>(async) Offer</li>\n</ul>\n",
      "how_to_apply": "<p>Please apply at <a href=\"https://grnh.se/f7ebb2123us\">https://grnh.se/f7ebb2123us</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cbe5144ce9fdf21e6b57c9b1845fb2a64276fd1/pJ-7_0_R_400x400.png"
    },
    {
      "id": "6ce8038c-9b2b-4842-9522-2ff2802879d0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6ce8038c-9b2b-4842-9522-2ff2802879d0",
      "created_at": "Mon Apr 12 16:38:06 UTC 2021",
      "company": "Bright Cellars",
      "company_url": "https://jobs.lever.co/brightcellars",
      "location": "Remote",
      "title": "Full Stack Engineer",
      "description": "<p>We're looking for a Full Stack Engineer to join our growing Data Platform team.</p>\n<p>What You’ll be Working On:\nImplement new features on core data products\nDesign API while keeping speed and cost in mind\nCollaborate with the team to gather requirements\nCommunicate with design team to implement based on product roadmap</p>\n<p>Key Technical Skills You’ll Bring:\nPython, Flask, unittest, flask_testing, MySQL, PostgreSQL\nAWS ECS, RDS, Redshift\nGit, Github, CircleCI, Jest</p>\n<p>Additional Skills:\nData ETL experience, Apache airflow\nExperience with advanced data visualization tool  (e.g. D3.js, observable, and vega)\nExperience with designing and implementing REST APIs</p>\n<p>Experience You’ll Bring:\nBachelor's degree in Computer Science (or a related field) and 3+ years of relevant experience\n3+ years working in Python, and MySQL\nProficient with HTML, CSS, React (or a similar frontend framework)\nExperience with AWS and CI / CD processes\nKnowledge of other programming languages a plus</p>\n<p>Who You Are:\nYou’re an Innovator - You enjoy working with new technologies ranging from the frontend to backend, and are particularly passionate and an expert in multiple stacks\nYou’re A Problem Solver - You have strong experience with various technologies, and know how to pick the right tool for any job.\nYou’re a Team Player - You love to collaborate closely with the team to brainstorm ideas, gather requirements, and review and improve code\nYou’re Driven - You have the ability to take initiative and work with minimal supervision\nYou’re Curious - You are naturally curious and have an interest in learning new things.</p>\n",
      "how_to_apply": "<p>Please email your resume to <a href=\"mailto:caila.cullen@brightcellars.com\">caila.cullen@brightcellars.com</a> OR, apply directly on our careers page.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--82afcc935314e4e0cf3655aa54c348504a20c889/Square_socialLogoBC%20(3).png"
    },
    {
      "id": "833a538c-bf21-4ba9-8a0c-c1fa2a72945f",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/833a538c-bf21-4ba9-8a0c-c1fa2a72945f",
      "created_at": "Mon Apr 12 15:30:52 UTC 2021",
      "company": "kognition",
      "company_url": "https://kognition.ai",
      "location": "Philadelphia, PA or remote",
      "title": "Senior Software Engineer, Video ",
      "description": "<p>Job Title: Senior Software Engineer, Video\nCompany: Kognition AI\nDept./Group: Engineering\nEmployment Terms :Contract to hire (3-6 months) for Full-Time\nPosition reports to: Chief Technology Officer\nNumber of Direct Reports: 0-3\nCompensation: Market salary rate + equity incentives + full benefits upon hiring</p>\n<p>Position Summary (Purpose of job):</p>\n<p>Kognition is an enterprise AI software company that develops an interoperability infrastructure for smart buildings and smart cities. Kognition's AI-powered policy engine automates complex business operations in real-time. We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R&amp;D team. We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!</p>\n<p>As a Senior Software Engineer, you will be a key part of our research and development team that builds our core products. You will design, develop, document, test and debug software applications and services. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.</p>\n<p>Key Responsibilities:</p>\n<ol>\n<li>\n<p>Analyze, design, and plan complex software solutions -- 20%</p>\n</li>\n<li>\n<p>Lead programming effort -- 40%</p>\n</li>\n<li>\n<p>Performs complex bug verification, testing, and program support for various products -- 30%</p>\n</li>\n<li>\n<p>Provide technical assistance, mentorship and guidance to junior software developers -- 10%</p>\n</li>\n</ol>\n<p>Minimum Job Qualifications:</p>\n<p>Education/Training: Bachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related</p>\n<p>Business Experience:\n5+ years experience in software engineering</p>\n<p>Critical Skills:</p>\n<p>-Working with digital video and particularly low latency stable web video (WebRTC, MPEG-DASH, HLS).\n-Experience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)\n-Experience with streaming live web cam or IP camera video using RTSP\n-Thorough understanding of modern web languages (e.g. HTML5, CSS3, ES6+)\n-Strong application design skills and understanding of enterprise software design patterns\n-Thorough understanding and experience working with both functional and object oriented programming languages and paradigms (e.g. Java, C++, Rust)\n-Thorough understanding and experience working with scripts and scripting languages (e.g. Bash, Python)\n-Experience developing highly available, highly scalable web applications\n-Experience working with various testing methodologies, including test-driven development (TDD), behavior-driven development (BDD), and unit testing\n-Experience with performance-monitoring and tuning of complex applications\n-Experience deploying, managing, and configuring applications both on-prem and in-cloud (AWS, Google Cloud, Azure)\n-Solid understanding of the Software Development Life Cycle in Agile environment (e.g. Kanban, Scrum)</p>\n<p>Desired Skills:</p>\n<p>-Experience with real-time pub/sub, flow, and streaming frameworks (e.g. Kafka, NiFi)\n-Experience with NoSQL databases (e.g. MongoDB, Cassandra)\n-Experience building and integrating RESTful APIs\n-Experience with machine vision (i.e. openCV)\n-Experience working with containers and container orchestration systems (e.g. Docker, Kubernetes, DC/OS, Nomad)\n-Experience working with deep net frameworks (e.g. Tensorflow, Torch, mxnet, gluon)\n-Experience working with native code in non-native languages (e.g. JNA, JNI, DllImport)\n-Security industry experience</p>\n<p>Additional Specialized Knowledge/Skills:</p>\n<p>-Passion for cutting-edge software design and development\n-Highly motivated and self-directed\n-Excellent written and oral communication skills\n-Keen attention to detail\n-Proven analytical, evaluative, and problem-solving abilities\n-Ability to effectively prioritize and execute tasks in a high-pressure environment\n-Exceptional customer service orientation\n-Extensive experience working in a team-oriented, collaborative environment\n-Willingness to mentor and train junior developers\n-Willingness to support resolution of escalated technical support issues\n-Willingness to travel to client locations is preferred</p>\n<p>Work Location During Pandemic:\nFully remote</p>\n<p>Post-Pandemic Location:\nPosition will be located in our Philadelphia, PA office after the pandemic is over\nWFH flexibility with a focus on in-office availability (post-pandemic)\nGeneral Office- travel less than 10%.</p>\n",
      "how_to_apply": "<p>Email resume to: <a href=\"mailto:jobs@kognition.ai\">jobs@kognition.ai</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0tnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4f8ff6e72639c0c85d3e0ad9bb2bc97f0e96df08/Kognition-Logo.png"
    },
    {
      "id": "5514a0a7-7fe0-4647-9108-8243d453bd6b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/5514a0a7-7fe0-4647-9108-8243d453bd6b",
      "created_at": "Mon Apr 12 15:06:38 UTC 2021",
      "company": "Canada Life",
      "company_url": "https://www.canadalife.com/",
      "location": "Toronto, Ontario, Canada",
      "title": "Software Developer",
      "description": "<p>We are Canada Life</p>\n<p>Being a part of Canada Life means you have a voice. This is a place where your unique background, perspectives and talents are valued, and shape our future success.</p>\n<p>You can be your best here. You’re part of a diverse and inclusive workplace where your career and well-being are championed. You’ll have the opportunity to excel in your way, finding new and better ways to deliver exceptional customer and advisor experiences.</p>\n<p>Together, as part of a great team, you’ll deliver on our shared purpose to improve the well-being of Canadians. It’s our driving force. Become part of a strong and successful company that’s trusted by millions of Canadians to do the right thing. </p>\n<p>Be your best at Canada Life.</p>\n<p>About Canada Life’s Digital Hub</p>\n<p>Canada Life’s Digital Hub is a team driven by customer needs. We provide expertise and strategic thought leadership that’s fueling Canada Life’s customer experiences.  </p>\n<p>Our team of experts in design, technology, product and agile work collaboratively with our business partners, creating digital tools that improve our customers’ lives. Come join an organization committed to delivering innovative, digital experiences. </p>\n<p>We are looking for a Software Developer</p>\n<p>As a Software Developer on our Digital team, you will play a key role in delivering engaging digital products, web sites and mobile applications quickly and with minimal customizations for a configured solution that meets the needs of our customers.</p>\n<p>What you will do </p>\n<ul>\n<li>Working predominantly in Agile scrum teams, build out business processes using Java, Microsoft .Net Framework, ASP.NET and Angular.</li>\n<li>Involved in all phases of the project lifecycle - from low-level design and development through to deployment and post-production support</li>\n<li>Challenge ideas and opinions to avoid pitfalls and inefficient solutions</li>\n<li>Help and mentor other members of the team</li>\n</ul>\n<p>What you will bring </p>\n<ul>\n<li>3+ years experience working on development teams, ideally using Agile development techniques</li>\n<li>Full Stack Developer experienced in Java, Spring Boot, PL/SQL, Angular and other JavaScript frameworks, HTML5 and CSS and ready and willing to jump right into a training program to come up to speed quickly on the Salesforce Vlocity and Force.com platforms</li>\n<li>Understanding of APIs and how to use them in practice</li>\n<li>Knowledge and experience with routing and messaging integration platforms such as Apache Camel and queuing techniques</li>\n<li>Adept at picking up new skills and technologies and excited to constantly learn</li>\n<li>Bachelor’s degree in Computer Science or equivalent experience</li>\n</ul>\n<p>We are one of Canada's top 100 employers!</p>\n<p>Canada Life serves the financial security needs of more than 13 million people across Canada, with additional operations in Europe and the United States. As members of the Power Financial Corporation group of companies, we’re one of Canada’s leading insurers with interests in life insurance, health insurance, investment and retirement savings. We offer a broad portfolio of financial and benefit plan solutions for individuals, families, businesses and organizations.  </p>\n<p>We are committed to providing an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live, and to creating an environment where every employee has the opportunity to reach their potential.  </p>\n<p>Canada Life would like to thank all applicants, however only those who qualify for an interview will be contacted  </p>\n",
      "how_to_apply": "<p>Submit an application here: <a href=\"https://bit.ly/3a53Wue\">https://bit.ly/3a53Wue</a> or email a copy of your resume directly to <a href=\"mailto:aynsley.hamilton@canadalife.com\">aynsley.hamilton@canadalife.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0NnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c100f88bfaeb2a7594caa849f9ca0d1aeb56c1b8/Canada%20Life%20Logo%20-%20LI.jfif"
    },
    {
      "id": "a17c1673-09b8-42e1-9ebf-6b8e97a40cc4",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/a17c1673-09b8-42e1-9ebf-6b8e97a40cc4",
      "created_at": "Mon Apr 12 15:05:51 UTC 2021",
      "company": "kognition",
      "company_url": "https://kognition.ai",
      "location": "Philadelphia, PA or remote",
      "title": "DevOps Engineer",
      "description": "<p>Job Title: DevOps Engineer\nCompany: Kognition AI\nDept./Group: Engineering\nEmployment Terms: Contract to hire (3-6 months) for Full-Time\nPosition reports to: Chief Technology Officer\nNumber of Direct Reports: 0-3\nCompensation: Market salary rate + equity incentives + full benefits upon hiring</p>\n<p>Position Summary (Purpose of job):</p>\n<p>Kognition is an enterprise AI software company that develops an interoperability infrastructure for smart buildings and smart cities. Kognition's AI-powered policy engine automates complex business operations in real-time. We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R&amp;D team. We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!</p>\n<p>As a DevOps Engineer, you will be a key part of our research and development and operations team that builds and operates our core products. You will design, develop, deploy, document, test, and debug our on-prem and cloud Kubernetes infrastructure. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.</p>\n<p>Key Responsibilities:</p>\n<ol>\n<li>\n<p>Analyze, design, and plan complex software solutions -- 20%</p>\n</li>\n<li>\n<p>Lead programming effort -- 40%</p>\n</li>\n<li>\n<p>Performs complex bug verification, testing, and program support for various products -- 30%</p>\n</li>\n<li>\n<p>Provide technical assistance, mentorship and guidance to junior software developers -- 10%</p>\n</li>\n</ol>\n<p>Minimum Job Qualifications:</p>\n<p>Education/Training: Bachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related</p>\n<p>Business Experience:\n5+ years experience in IT operations, software engineering</p>\n<p>Critical Skills:</p>\n<p>-Strong application design skills and understanding of AWS cloud services and Kubernetes\n-Thorough understanding and experience working with scripts and scripting languages (e.g. Bash, Python)\n-Experience working with containers and container orchestration systems and specifically Kubernetes.\n-Experience writing and deploying Helm charts on Kubernetes\n-Experience developing highly available, highly scalable web applications\n-Experience with real-time pub/sub, flow, and streaming frameworks (e.g. Kafka, NiFi)\n-Experience with NoSQL databases (e.g. MongoDB, Cassandra, CouchDB) and replication\n-Experience working with various testing methodologies, including test-driven development (TDD), behavior-driven development (BDD), and unit testing\n-Experience with performance-monitoring and tuning of complex applications\n-Experience deploying, managing, and configuring applications both on-prem and in-cloud (AWS, Google Cloud, Azure)\n-Solid understanding of the Software Development Life Cycle in Agile environment (e.g. Kanban, Scrum)</p>\n<p>Desired Skills:</p>\n<p>-Experience with machine vision (i.e. openCV)\n-Experience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)\n-Experience working with deep net frameworks (e.g. Tensorflow, Torch, mxnet, gluon)\n-Experience working with native code in non-native languages (e.g. JNA, JNI, DllImport)\n-Security industry experience</p>\n<p>Additional Specialized Knowledge/Skills:</p>\n<p>-Passion for cutting-edge software design and development\n-Highly motivated and self-directed\n-Excellent written and oral communication skills\n-Keen attention to detail\n-Proven analytical, evaluative, and problem-solving abilities\n-Ability to effectively prioritize and execute tasks in a high-pressure environment\n-Exceptional customer service orientation\n-Extensive experience working in a team-oriented, collaborative environment\n-Willingness to mentor and train junior developers\n-Willingness to support resolution of escalated technical support issues\n-Willingness to travel to client locations is preferred</p>\n<p>Work Location During Pandemic:\nFully remote</p>\n<p>Post-Pandemic Location:\nPosition will be located in our Philadelphia, PA office after the pandemic is over\nWFH flexibility with a focus on in-office availability (post-pandemic)\nGeneral Office- travel less than 10%.</p>\n",
      "how_to_apply": "<p>Email resume to: <a href=\"mailto:jobs@kognition.ai\">jobs@kognition.ai</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbjZnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--35cd9cd717939c8c544d0d49474428b858be3bd5/Kognition-Logo.png"
    },
    {
      "id": "3e546b76-6555-41a5-a0f3-0b98f800e04e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3e546b76-6555-41a5-a0f3-0b98f800e04e",
      "created_at": "Mon Apr 12 14:34:59 UTC 2021",
      "company": "kognition",
      "company_url": "https://kognition.ai",
      "location": "Philadelphia, PA or remote",
      "title": "Senior UI / UX Engineer - React, Node.js",
      "description": "<p>Job Title: Senior UI / UX Engineer\nCompany: Kognition AI\nDept./Group: Engineering\nEmployment Terms: Contract to hire (3-6 months) for Full-Time\nPosition reports to: Chief Technology Officer\nNumber of Direct Reports: 0-3\nCompensation: Market salary rate + equity incentives + full benefits upon hiring</p>\n<p>Position Summary (Purpose of job):</p>\n<p>Kognition is an enterprise AI software company that develops an interoperability infrastructure for smart buildings and smart cities. Kognition's AI-powered policy engine automates complex business operations in real-time. We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R&amp;D team. We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!</p>\n<p>As a Senior UI Engineer, you will be a key part of our research and development team that builds our core products. You will design, develop, document, test and debug Web UI applications and services. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.</p>\n<p>Key Responsibilities:</p>\n<ol>\n<li>\n<p>Analyze, plan, and design easy-to-use user interfaces infocore products -- 20%</p>\n</li>\n<li>\n<p>Lead programming effort -- 40%</p>\n</li>\n<li>\n<p>Performs complex bug verification, testing, and program support for various products -- 30%</p>\n</li>\n<li>\n<p>Provide technical assistance, mentorship and guidance to junior software developers -- 10%</p>\n</li>\n</ol>\n<p>Minimum Job Qualifications:</p>\n<p>Education/Training: Bachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related</p>\n<p>Business Experience:\n5+ yrs experience web development\n3+ yrs experience with React.js and Node.js</p>\n<p>Critical Skills:</p>\n<p>-Strong application design skills and understanding of single page app design patterns\n-Thorough understanding of modern web languages (e.g. HTML5, CSS3 and ES6+)\n-Thorough understanding modern web build chain technologies and purpose (e.g. webpack, gulp)\n-Thorough understanding of React.js\n-Comprehensive knowledge of available library options within the React ecosystem (e.g. Redux, Material-UI, etc.)\n-Experience developing highly available, highly scalable web applications\n-Experience building and integrating RESTful APIs, and integrating back-end services\n-Experience with RDBMS and NoSQL databases\n-Experience working with various testing methodologies, including test-driven development (TDD), behavior-driven development (BDD), and unit testing\n-Experience with performance-monitoring and tuning of web stack applications\n-Experience deploying, managing, and configuring applications both on-prem and in-cloud (e.g. AWS, Google Cloud, Azure)\n-Solid understanding of the Software Development Life Cycle and various Agile methodologies (e.g. Kanban, Scrum)</p>\n<p>Desired Skills:</p>\n<p>-Experience working with containers and container orchestration systems (e.g. Docker, Kubernetes, DC/OS, Nomad)\n-Experience with machine vision (i.e. openCV)\n-Experience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)</p>\n<p>Additional Specialized Knowledge/Skills:</p>\n<p>-Passion for cutting-edge software design and development\n-Highly motivated and self-directed\n-Excellent written and oral communication skills\n-Keen attention to detail\n-Proven analytical, evaluative, and problem-solving abilities\n-Ability to effectively prioritize and execute tasks in a high-pressure environment\n-Focus on user experience\n-Extensive experience working in a team-oriented, collaborative environment\n-Willingness to mentor and train junior developers\n-Willingness to support resolution of escalated technical support issues</p>\n<p>Work Location During Pandemic:\nFully remote</p>\n<p>Post-Pandemic Location:\nPosition will be located in our Philadelphia, PA office after the pandemic is over\nWFH flexibility with a focus on in-office availability (post-pandemic)\nGeneral Office- travel less than 10%.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@kognition.ai\">jobs@kognition.ai</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmlnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9cc81f3fdd0714ab6f095c69dde26b36da42744/Kognition-Logo.png"
    },
    {
      "id": "660d99c2-9b56-4005-8fa5-5faed6753ac9",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/660d99c2-9b56-4005-8fa5-5faed6753ac9",
      "created_at": "Mon Apr 12 14:15:47 UTC 2021",
      "company": "Canada Life",
      "company_url": "https://www.canadalife.com/",
      "location": "Canada",
      "title": "Salesforce Vlocity Developer",
      "description": "<p>We are Canada Life</p>\n<p>Being a part of Canada Life means you have a voice. This is a place where your unique background, perspectives and talents are valued, and shape our future success.</p>\n<p>You can be your best here. You’re part of a diverse and inclusive workplace where your career and well-being are championed. You’ll have the opportunity to excel in your way, finding new and better ways to deliver exceptional customer and advisor experiences.</p>\n<p>Together, as part of a great team, you’ll deliver on our shared purpose to improve the well-being of Canadians. It’s our driving force. Become part of a strong and successful company that’s trusted by millions of Canadians to do the right thing. </p>\n<p>Be your best at Canada Life.</p>\n<p>About Canada Life’s Digital Hub  </p>\n<p>Canada Life’s Digital Hub is a team driven by customer needs. We provide expertise and strategic thought leadership that’s fueling Canada Life’s customer experiences.   </p>\n<p>Our team of experts in design, technology, product and agile work collaboratively with our business partners, creating digital tools that improve our customers’ lives. Come join an organization committed to delivering innovative, digital experiences.  </p>\n<p>We are looking for a Salesforce Vlocity Developer </p>\n<p>Given the size and scope of our organization, we have the flexibility for this position to be located in the following head office locations: Toronto, London, or Winnipeg</p>\n<p>Overview</p>\n<p>As a Salesforce Industries Vlocity developer, you are responsible for transforming the design and product vision into a seamless and engaging product. You work hard to stay on top of fast changing technology and invest a lot of energy to learn new platform features. You stay on top of the latest Salesforce product developments and anticipate what the near future will bring. You love clean code, clean interfaces and have a real passion for problem solving.</p>\n<p>As a Salesforce Industries Vlocity Developer, you will also have deep understanding and proven grasp of end-to-end programming and an approach to development that focuses on building light-weight re-usable components that can be used to deliver a great product.</p>\n<p>What you'll do </p>\n<ul>\n<li>Design and build experiences in Salesforce Communities using the Salesforce Industries Vlocity cloud platform</li>\n<li>Ensure the code follows latest coding practices and industry standards</li>\n<li>Work closely with other developers to understand and properly use the platform components</li>\n<li>Write both unit and integration tests and develop automation tools for daily tasks</li>\n<li>Challenge ideas and opinions to avoid pitfalls and inefficient solutions</li>\n<li>Help and mentor other members of the team</li>\n<li>Be a member of a high performing Agile team</li>\n</ul>\n<p>What you'll bring </p>\n<ul>\n<li>4+ years of experience in Salesforce application development and administration</li>\n<li>1+ years of experience in Salesforce Lightning Web Components development</li>\n<li>1+ years of experience in Salesforce Vlocity application development</li>\n<li>An in-depth understanding of the Salesforce Lightning Design System (SLDS) and Vlocity Newport Design System</li>\n<li>Expert level experience using the core Vlocity technologies – Cards, Templates, Integration Procedures, OmniScripts and Data Raptors</li>\n<li>Understanding of APIs and how to use them in practice</li>\n<li>Experience with continuous integration tools like JIRA, Bitbucket, Jenkins and Confluence</li>\n<li>Knowledge &amp; experience with unit testing</li>\n<li>Understanding and flexible in working in an Agile environment</li>\n<li>Bachelor’s degree in Computer Science or equivalent experience</li>\n</ul>\n<p>Who you are</p>\n<ul>\n<li>Excellent Salesforce knowledge and a positive attitude/customer focused</li>\n<li>Keeps up to date with platform best practices, processes, and configuration patterns</li>\n<li>Supports proactive identification risk and issues</li>\n<li>Demonstrated ability to meet deadlines, handle and prioritize simultaneous requests</li>\n<li>Creative and analytical thinker with strong problem-solving skills</li>\n<li>Must demonstrate exceptional verbal and written communication skills</li>\n<li>Ability to critically evaluate information gathered from multiple sources &amp; reconcile conflicts</li>\n<li>Ability to assess the impact of new requirement on Salesforce.com and all upstream and downstream applications, systems, and processes</li>\n</ul>\n<p>We are one of Canada's top 100 employers!</p>\n<p>Canada Life serves the financial security needs of more than 13 million people across Canada, with additional operations in Europe and the United States. As members of the Power Financial Corporation group of companies, we’re one of Canada’s leading insurers with interests in life insurance, health insurance, investment and retirement savings. We offer a broad portfolio of financial and benefit plan solutions for individuals, families, businesses and organizations.  </p>\n<p>We are committed to providing an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live, and to creating an environment where every employee has the opportunity to reach their potential.  </p>\n<p>Canada Life would like to thank all applicants, however only those who qualify for an interview will be contacted.</p>\n",
      "how_to_apply": "<p>Submit an application here: <a href=\"https://bit.ly/3a4hMx7\">https://bit.ly/3a4hMx7</a> or email a copy of your resume directly to <a href=\"mailto:aynsley.hamilton@canadalife.com\">aynsley.hamilton@canadalife.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbStnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e86f3ac8f41ba685faa63546acfcba6c9f933895/Canada%20Life%20Logo%20-%20LI.jfif"
    },
    {
      "id": "b3262e6f-bf14-4f06-9918-ded69df9e0dc",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/b3262e6f-bf14-4f06-9918-ded69df9e0dc",
      "created_at": "Mon Apr 12 13:21:17 UTC 2021",
      "company": "Canada Life",
      "company_url": "https://www.canadalife.com",
      "location": "Canada",
      "title": "Salesforce Developer",
      "description": "<p>We are Canada Life</p>\n<p>Being a part of Canada Life means you have a voice. This is a place where your unique background, perspectives and talents are valued, and shape our future success.</p>\n<p>You can be your best here. You’re part of a diverse and inclusive workplace where your career and well-being are championed. You’ll have the opportunity to excel in your way, finding new and better ways to deliver exceptional customer and advisor experiences.</p>\n<p>Together, as part of a great team, you’ll deliver on our shared purpose to improve the well-being of Canadians. It’s our driving force. Become part of a strong and successful company that’s trusted by millions of Canadians to do the right thing.\n \nBe your best at Canada Life.</p>\n<p>About Canada Life’s Digital Hub</p>\n<p>Canada Life’s Digital Hub is a team driven by customer needs. We provide expertise and strategic thought leadership that’s fueling Canada Life’s customer experiences.  </p>\n<p>Our team of experts in design, technology, product and agile work collaboratively with our business partners, creating digital tools that improve our customers’ lives. Come join an organization committed to delivering innovative, digital experiences. </p>\n<p>We are looking for a Salesforce Developer</p>\n<p>Given the size and scope of our organization, we have the flexibility for this position to be located in the following head office locations: Toronto, London, or Winnipeg</p>\n<p>Overview</p>\n<p>As a Salesforce Developer, you will be responsible for the ongoing development of our Salesforce.com platform with 4000+ users. You will have a record of success in improving processes and adoption using the platform, working closely with leaders, business units, and subject matter experts to identify, configure, and deploy new business processes. This includes, but is not limited to: sales, support, marketing and corporate.</p>\n<p>As a Salesforce Developer, you will also have a deep understanding and grasp for executing on the day-to-day configuration, support, maintenance, and improvement of our platform.</p>\n<p>What you’ll do</p>\n<ul>\n<li>Deliver configurations based on specifications to meet product requirements</li>\n<li>Collaborate with our architects and analysts to configure and integrate components and third-party products, tools and solutions with the platform</li>\n<li>Identify and recommend solutions for application defects, determining root causes and minimizing the introduction of new defects</li>\n<li>Perform unit testing, code and configuration management activities, system development and providing guidance to team members</li>\n<li>Perform analysis, design, configuration, and implementation support for our platform</li>\n<li>Troubleshoot platform issues and drive exploration of options, recommending solutions and / or preparing discussion for escalation</li>\n<li>Study and implement new Salesforce features and capabilities in support of evolving business needs </li>\n<li>Identify and incorporate new user flows within the platform to optimize functionality</li>\n</ul>\n<p>What you’ll bring</p>\n<ul>\n<li>Minimum 3 years of experience as a Salesforce.com developer</li>\n<li>3-5 years technical Salesforce experience building solutions using Sales Cloud, Service Cloud, Community Cloud</li>\n<li>Experience in Apex Code, triggers, custom object development, SFDC APIs, Web services, Force.com, Lightning Web Component development</li>\n<li>Sales Cloud, Service Cloud and Developer certifications preferred</li>\n<li>Platform Developer 1 certification preferred</li>\n<li>Proven ability to design and implement new processes and facilitate user adoption</li>\n<li>Strong understanding of the platform, with the ability to build custom apps and objects, formula fields, workflows, custom views, and other content of intermediate complexity</li>\n<li>Strong understanding of Salesforce.com best practices and functionality</li>\n<li>Previous experience working in a SCRUM or agile environment preferred </li>\n</ul>\n<p>Who you are</p>\n<ul>\n<li>Excellent Salesforce knowledge and a positive attitude/customer focused</li>\n<li>Keeps up to date with platform best practices, processes, and configuration patterns</li>\n<li>Supports proactive identification risk and issues</li>\n<li>Demonstrated ability to meet deadlines, handle and prioritize simultaneous requests</li>\n<li>Creative and analytical thinker with strong problem-solving skills</li>\n<li>Must demonstrate exceptional verbal and written communication skills</li>\n<li>Ability to critically evaluate information gathered from multiple sources &amp; reconcile conflicts</li>\n<li>Ability to assess the impact of new requirement on Salesforce.com and all upstream and downstream applications, systems, and processes</li>\n</ul>\n<p>We are one of Canada's top 100 employers!</p>\n<p>Canada Life serves the financial security needs of more than 13 million people across Canada, with additional operations in Europe and the United States. As members of the Power Financial Corporation group of companies, we’re one of Canada’s leading insurers with interests in life insurance, health insurance, investment and retirement savings. We offer a broad portfolio of financial and benefit plan solutions for individuals, families, businesses and organizations.  </p>\n<p>We are committed to providing an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live, and to creating an environment where every employee has the opportunity to reach their potential.  </p>\n<p>Canada Life would like to thank all applicants, however only those who qualify for an interview will be contacted  </p>\n",
      "how_to_apply": "<p>Submit an application here: <a href=\"https://bit.ly/3a0NM4T\">https://bit.ly/3a0NM4T</a> or email a copy of your resume directly to <a href=\"mailto:aynsley.hamilton@canadalife.com\">aynsley.hamilton@canadalife.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf6e28b08841f6a5a7a725fc10b8c682d50c528e/Canada%20Life%20Logo%20-%20LI.jfif"
    }
  ]